./   ADD  NAME=$$CNTL$$                                                         
//MARKNICE JOB MSGLEVEL=(0,0),CLASS=5,NOTIFY=&SYSUID,MSGCLASS=H         00010019
/*JOBPARM  S=ANY,LINES=99                                               00021000
//*-------------------------------------------------------------------- 00021901
//*                                                                     00022001
//* RACFICE -  Create reports from RACF SMF Data Unload Utility and     00022101
//*            RACF Data Base Unload Utility output                     00022201
//*                                                                     00022301
//*                                                                     00022415
//* RACF Data Base Reports                                              00022515
//*                                                                     00022615
//*    Name   Description                                               00022715
//*    ----   --------------------------------------------------------  00022815
//*    ASOC   Users Who Have Explicit Associations Defined              00022915
//* |  BGGR   Discrete General Respource Profiles with Generic Chars    00023026
//* |  CCON   Count of user connections, flagging those with more       00023326
//*           than "x" connections                                      00023429
//* |  CGEN   Count of general resource profiles                        00023526
//* |  CPRO   Count of profiles                                         00023626
//*    CONN   User IDs With Group Privileges Above Use                  00023715
//* |  IDSC   Dataset conditional access lists with ID(*) of other      00023826
//*           than NONE                                                 00023926
//* |  IDSS   Dataset standard access lists with ID(*) of other         00024026
//*           than NONE                                                 00024126
//* |  IGRC   General resource conditional access lists with ID(*)      00024226
//*           of other than NONE                                        00024326
//* |  IGRS   General resource standard access lists with ID(*)         00024426
//*           of other than NONE                                        00024526
//*    OMVS   User IDs Which Have OpenEdition (OMVS) Segments           00024615
//*    SUPU   OpenEdition Super Users (UID of Zero)                     00024715
//*    UGLB   User IDs With Extraordinary Global Authorities            00024807
//*    UGRP   User IDs With Extraordinary RACF Group Authorities        00024907
//*    UIDS   OpenEdition UIDs Used More Than Once                      00025007
//*    URVK   User IDs Which are Currently Revoked                      00025107
//*           than "x" connections                                      00026026
//* |  UADS   Dataset profiles with UACCs of other than NONE            00027226
//* |  UAGR   General resource profiles with UACCs of other than NONE   00027326
//*                                                                     00027926
//*                                                                     00028026
//* Audit Record Reports                                                00028126
//*                                                                     00028226
//*    Name   Description                                               00028326
//*    ----  --------------------------------------------------------   00028426
//*    ACD$   Users Who Are Using Automatic Command Direction           00028526
//* |  CADU   Count of IRRADU00 events                                  00028626
//*    ECD$   Users Who Are Directing Commands Explicitly               00028726
//*    LOGB   Users Who Log on with LOGON BY                            00028826
//*    LOGF   All users with excessive incorrect passwords              00028926
//*    OPER   Accesses Allowed Because the User has OPERATIONS          00029026
//*    PWD$   Users Who Are Using Password Synchronization              00029126
//*    RACL   RACLINK Audit Records                                     00029226
//*    SELU   All audit records for a specific user                     00029326
//*    SPEC   Accesses Allowed Because the User has SPECIAL             00029426
//*    TRMF   Excessive incorrect passwords from terminals              00029526
//*    VIOL   Access Violations                                         00029626
//*    WARN   Accesses Allowed Due to WARNING Mode Profiles             00029726
//*-------------------------------------------------------------------- 00029826
//         JCLLIB ORDER=MARKN.RACFICE.VERSION4.CNTL                     00029926
//         SET  ADUDATA=MARKN.RACFICE.VERSION4.IRRADU00   IRRADU00 data 00030026
//         SET  DBUDATA=MARKN.RACFICE.VERSION4.IRRDBU00   IRRDBU00 data 00030126
//         SET  ICECNTL=MARKN.RACFICE.VERSION4.CNTL       ICETOOL  data 00030226
//*-------------------------------------------------------------------- 00030326
//*------- IRRDBU00-Based Reports ------------------------------------- 00030426
//*-------------------------------------------------------------------- 00030526
//ASOC     EXEC RACFICE,REPORT=ASOC                                     00030726
//BGGR     EXEC RACFICE,REPORT=BGGR                                     00030826
//CCON     EXEC RACFICE,REPORT=CCON                                     00030926
//CGEN     EXEC RACFICE,REPORT=CGEN                                     00031026
//CPRO     EXEC RACFICE,REPORT=CPRO                                     00032026
//CONN     EXEC RACFICE,REPORT=CONN                                     00032126
//IDSC     EXEC RACFICE,REPORT=IDSC                                     00032226
//IDSS     EXEC RACFICE,REPORT=IDSS                                     00032426
//IGRC     EXEC RACFICE,REPORT=IGRC                                     00032626
//IGRS     EXEC RACFICE,REPORT=IGRS                                     00032826
//OMVS     EXEC RACFICE,REPORT=OMVS                                     00033026
//SUPU     EXEC RACFICE,REPORT=SUPU                                     00033126
//UGLB     EXEC RACFICE,REPORT=UGLB                                     00033326
//UGRP     EXEC RACFICE,REPORT=UGRP                                     00033426
//UIDS     EXEC RACFICE,REPORT=UIDS                                     00033526
//URVK     EXEC RACFICE,REPORT=URVK                                     00033626
//UADS     EXEC RACFICE,REPORT=UADS                                     00033826
//UAGR     EXEC RACFICE,REPORT=UAGR                                     00033926
//*-------------------------------------------------------------------- 00035626
//*------- IRRADU00-Based Reports ------------------------------------- 00035726
//*-------------------------------------------------------------------- 00035826
//ACD$     EXEC RACFICE,REPORT=ACD$                                     00035926
//CADU     EXEC RACFICE,REPORT=CADU                                     00036026
//ECD$     EXEC RACFICE,REPORT=ECD$                                     00036126
//LOGB     EXEC RACFICE,REPORT=LOGB                                     00036226
//LOGF     EXEC RACFICE,REPORT=LOGF                                     00036326
//OPER     EXEC RACFICE,REPORT=OPER                                     00036426
//RACL     EXEC RACFICE,REPORT=RACL                                     00036526
//PWD$     EXEC RACFICE,REPORT=PWD$                                     00036626
//SELU     EXEC RACFICE,REPORT=SELU                                     00036726
//SPEC     EXEC RACFICE,REPORT=SPEC                                     00036826
//TRMF     EXEC RACFICE,REPORT=TRMF                                     00036926
//VIOL     EXEC RACFICE,REPORT=VIOL                                     00037026
//WARN     EXEC RACFICE,REPORT=WARN                                     00038026
./   ADD  NAME=$CFQG                                                            
//MARKNICE JOB MSGLEVEL=1,CLASS=5,NOTIFY=&SYSUID,MSGCLASS=H             00010000
/*JOBPARM  S=ANY,LINES=99                                               00020000
//         SET  DBUDATA=MARKN.TEST.IRRDBU00         IRRADU00 data       00020100
//*-------------------------------------------------------------------- 00021000
//***********************************************************           00023000
//* These samples are provided for tutorial purposes only. **           00024000
//* This code has not been submitted to formal IBM testing.**           00025000
//* This source is distributed on an "as-is" basis,        **           00026000
//* without any warranties either expressed or implied.    **           00027000
//*                                                        **           00028000
//* (c) Copyright 1994, 1998 IBM Corporation               **           00029000
//***********************************************************           00030000
//***********************************************************           00040000
//*         See the "DFSORT Application Programming:       **           00050000
//*         Guide" (SC33-4035) for more information.       **           00060000
//***********************************************************           00070000
//SEPARATE  EXEC PGM=SORT                                               00071000
//SORTIN    DD   DISP=SHR,DSN=&DBUDATA                                  00072000
//SORTWK01  DD   SPACE=(CYL,(20,5,0))                                   00080000
//DS$1      DD   DISP=(NEW,PASS),DSN=&TEMP1                             00084100
//DS$2      DD   DISP=(NEW,PASS),DSN=&TEMP2                             00084200
//DS$3      DD   DISP=(NEW,PASS),DSN=&TEMP3                             00084300
//DS$4      DD   DISP=(NEW,PASS),DSN=&TEMP4                             00084400
//DS$5      DD   DISP=(NEW,PASS),DSN=&TEMP5                             00084500
//DS$6      DD   DISP=(NEW,PASS),DSN=&TEMP6                             00084600
//DS$7      DD   DISP=(NEW,PASS),DSN=&TEMP7                             00084700
//DS$8      DD   DISP=(NEW,PASS),DSN=&TEMP8                             00084800
//SYSOUT    DD   SYSOUT=*                                               00110000
//SORTOUT   DD   DSN=&TEMP,DISP=(NEW,DELETE,DELETE),                    00130000
//          SPACE=(CYL,(20,5,0))                                        00131000
//SYSIN     DD *                                                        00140000
 SORT    FIELDS=(10,44,CH,A)                                            00141002
 INCLUDE COND=(5,4,CH,EQ,C'0400',AND,62,4,CH,EQ,C'YES ',AND,            00141402
         10,44,SS,NE,C'*',AND,10,44,SS,NE,C'%')                         00141502
 OUTFIL  INCLUDE=(11,1,CH,EQ,C'.',OR,11,1,CH,EQ,C' '),                  00141604
         OUTREC=(1,4,5,4,X,10,1,7X),FNAMES=DS$1                         00141700
 OUTFIL  INCLUDE=(12,1,CH,EQ,C'.'),                                     00141800
         OUTREC=(1,4,5,4,X,10,2,6X),FNAMES=DS$2                         00141900
 OUTFIL  INCLUDE=(13,1,CH,EQ,C'.',AND,10,3,SS,NE,C'.'),                 00142000
         OUTREC=(1,4,5,4,X,10,3,5X),FNAMES=DS$3                         00142100
 OUTFIL  INCLUDE=(14,1,CH,EQ,C'.',AND,10,4,SS,NE,C'.'),                 00142200
         OUTREC=(1,4,5,4,X,10,4,4X),FNAMES=DS$4                         00142300
 OUTFIL  INCLUDE=(15,1,CH,EQ,C'.',AND,10,5,SS,NE,C'.'),                 00142400
         OUTREC=(1,4,5,4,X,10,5,3X),FNAMES=DS$5                         00142500
 OUTFIL  INCLUDE=(16,1,CH,EQ,C'.',AND,10,6,SS,NE,C'.'),                 00142600
         OUTREC=(1,4,5,4,X,10,6,2X),FNAMES=DS$6                         00142700
 OUTFIL  INCLUDE=((17,1,CH,EQ,C'.',OR,17,1,CH,EQ,C' '),                 00144100
         AND,10,7,SS,NE,C'.'),                                          00144200
         OUTREC=(1,4,5,4,X,10,7,1X),FNAMES=DS$7                         00145000
 OUTFIL  SAVE,                                                          00146000
         OUTREC=(1,4,5,4,X,10,8),FNAMES=DS$8                            00146100
 OPTION   VLSHRT                                                        00146900
/*                                                                      00147000
//***********************************************************           00152000
//RACFICE   EXEC PGM=ICETOOL                                            00152105
//TOOLMSG   DD SYSOUT=*                                                 00152200
//PRINT     DD SYSOUT=*                                                 00152300
//DFSMSG    DD SYSOUT=*                                                 00152400
//DBUDATA   DD DISP=(SHR),DSN=&TEMP1                                    00152500
//          DD DISP=(SHR),DSN=&TEMP2                                    00152600
//          DD DISP=(SHR),DSN=&TEMP3                                    00152700
//          DD DISP=(SHR),DSN=&TEMP4                                    00152800
//          DD DISP=(SHR),DSN=&TEMP5                                    00152900
//          DD DISP=(SHR),DSN=&TEMP6                                    00153000
//          DD DISP=(SHR),DSN=&TEMP7                                    00153100
//          DD DISP=(SHR),DSN=&TEMP8                                    00153200
//TEMP0001  DD DISP=(NEW,DELETE,DELETE),SPACE=(CYL,(20,5,0))            00154000
//TOOLIN    DD *                                                        00154100
 OCCURS  FROM(DBUDATA) LIST(PRINT) -                                    00154200
         PAGE -                                                         00154300
         TITLE('HLQs With Excessive Fully Qual. Generic Profiles')-     00154403
         DATE(YMD/) -                                                   00154500
         TIME(12:)  -                                                   00154600
         BLANK -                                                        00154700
         ON(10,8,CH)   HEADER('HLQ') -                                  00154800
         ON(VALCNT)    HEADER('Count') -                                00154900
         HIGHER(000)                                                    00155002
/*                                                                      00156000
./   ADD  NAME=$CHLQ                                                            
//MARKNICE JOB MSGLEVEL=1,CLASS=5,NOTIFY=&SYSUID,MSGCLASS=H             00010000
/*JOBPARM  S=ANY,LINES=99                                               00020000
//         SET  DBUDATA=MARKN.TEST.IRRDBU00         IRRDDU00 data       00020106
//*-------------------------------------------------------------------- 00021000
//***********************************************************           00023000
//* These samples are provided for tutorial purposes only. **           00024000
//* This code has not been submitted to formal IBM testing.**           00025000
//* This source is distributed on an "as-is" basis,        **           00026000
//* without any warranties either expressed or implied.    **           00027000
//*                                                        **           00028000
//* (c) Copyright 1994, 1998 IBM Corporation               **           00029004
//***********************************************************           00030000
//***********************************************************           00040000
//*         See the "DFSORT Application Programming:       **           00050000
//*         Guide" (SC33-4035) for more information.       **           00060000
//***********************************************************           00070000
//SEPARATE  EXEC PGM=SORT                                               00071000
//SORTIN    DD   DISP=SHR,DSN=&DBUDATA                                  00072004
//SORTWK01  DD   SPACE=(CYL,(20,5,0))                                   00080000
//DS$1      DD   DISP=(NEW,PASS),DSN=&TEMP1                             00084103
//DS$2      DD   DISP=(NEW,PASS),DSN=&TEMP2                             00084203
//DS$3      DD   DISP=(NEW,PASS),DSN=&TEMP3                             00084303
//DS$4      DD   DISP=(NEW,PASS),DSN=&TEMP4                             00084403
//DS$5      DD   DISP=(NEW,PASS),DSN=&TEMP5                             00084503
//DS$6      DD   DISP=(NEW,PASS),DSN=&TEMP6                             00084603
//DS$7      DD   DISP=(NEW,PASS),DSN=&TEMP7                             00084703
//DS$8      DD   DISP=(NEW,PASS),DSN=&TEMP8                             00084803
//SYSOUT    DD   SYSOUT=*                                               00110000
//SORTOUT   DD   DSN=&TEMP,DISP=(NEW,DELETE,DELETE),                    00130000
//          SPACE=(CYL,(20,5,0))                                        00131000
//SYSIN     DD *                                                        00140000
 SORT    FIELDS=(10,44,CH,A)                                            00141002
 INCLUDE COND=(5,4,CH,EQ,C'0400',AND,62,4,CH,EQ,C'YES ')                00141405
 OUTFIL  INCLUDE=(11,1,CH,EQ,C'.',OR,11,1,CH,EQ,C' '),                  00141507
         OUTREC=(1,4,5,4,X,10,1,7X),FNAMES=DS$1                         00141602
 OUTFIL  INCLUDE=(12,1,CH,EQ,C'.'),                                     00141802
         OUTREC=(1,4,5,4,X,10,2,6X),FNAMES=DS$2                         00141902
 OUTFIL  INCLUDE=(13,1,CH,EQ,C'.',AND,10,3,SS,NE,C'.'),                 00142002
         OUTREC=(1,4,5,4,X,10,3,5X),FNAMES=DS$3                         00142102
 OUTFIL  INCLUDE=(14,1,CH,EQ,C'.',AND,10,4,SS,NE,C'.'),                 00142202
         OUTREC=(1,4,5,4,X,10,4,4X),FNAMES=DS$4                         00142302
 OUTFIL  INCLUDE=(15,1,CH,EQ,C'.',AND,10,5,SS,NE,C'.'),                 00142402
         OUTREC=(1,4,5,4,X,10,5,3X),FNAMES=DS$5                         00142502
 OUTFIL  INCLUDE=(16,1,CH,EQ,C'.',AND,10,6,SS,NE,C'.'),                 00142602
         OUTREC=(1,4,5,4,X,10,6,2X),FNAMES=DS$6                         00142702
 OUTFIL  INCLUDE=((17,1,CH,EQ,C'.',OR,17,1,CH,EQ,C' '),                 00144102
         AND,10,7,SS,NE,C'.'),                                          00144202
         OUTREC=(1,4,5,4,X,10,7,1X),FNAMES=DS$7                         00145002
 OUTFIL  SAVE,                                                          00146002
         OUTREC=(1,4,5,4,X,10,8),FNAMES=DS$8                            00146102
 OPTION   VLSHRT                                                        00146902
/*                                                                      00147000
//***********************************************************           00152000
//RACFICE   EXEC PGM=ICETOOL                                            00152107
//TOOLMSG   DD SYSOUT=*                                                 00152200
//PRINT     DD SYSOUT=*                                                 00152300
//DFSMSG    DD SYSOUT=*                                                 00152400
//DBUDATA   DD DISP=(SHR),DSN=&TEMP1                                    00152503
//          DD DISP=(SHR),DSN=&TEMP2                                    00152603
//          DD DISP=(SHR),DSN=&TEMP3                                    00152703
//          DD DISP=(SHR),DSN=&TEMP4                                    00152803
//          DD DISP=(SHR),DSN=&TEMP5                                    00152903
//          DD DISP=(SHR),DSN=&TEMP6                                    00153003
//          DD DISP=(SHR),DSN=&TEMP7                                    00153103
//          DD DISP=(SHR),DSN=&TEMP8                                    00153203
//TEMP0001  DD DISP=(NEW,DELETE,DELETE),SPACE=(CYL,(20,5,0))            00154003
//TOOLIN    DD *                                                        00154103
 OCCURS  FROM(DBUDATA) LIST(PRINT) -                                    00154203
         PAGE -                                                         00154303
         TITLE('HLQs With Excessive Generic Profiles')-                 00154403
         DATE(YMD/) -                                                   00154503
         TIME(12:)  -                                                   00154603
         BLANK -                                                        00154703
         ON(10,8,CH)   HEADER('HLQ') -                                  00154803
         ON(VALCNT)    HEADER('Count') -                                00154903
         HIGHER(200)                                                    00155003
/*                                                                      00156003
./   ADD  NAME=$ULAST90                                                         
//MARKNICE JOB MSGLEVEL=(0,0),CLASS=5,NOTIFY=&SYSUID,MSGCLASS=H                 
/*JOBPARM  S=ANY,LINES=99                                                       
//         SET DBUDATA=MARKN.TEST.IRRDBU00                                      
//*******************************************************************           
//MAKEEXEC EXEC PGM=ICEGENER                                                    
//SYSUT1   DD   DATA,DLM=ZZ                                                     
 /* REXX ************************************************************/          
 /**       REXX EXEC to find all user profiles that were           **/          
 /**       created in the last <user_age> days                     **/          
 /*******************************************************************/          
                                                                                
                                                                                
 /*******************************************************************/          
 /**  Set the variable user_age below to the number of days        **/          
 /**  for this "rolling window". That is, find all of the          **/          
 /**  user profiles that were created in the past <user_age>       **/          
 /**  days.                                                        **/          
 /*******************************************************************/          
 user_age              = 90                                                     
                                                                                
 /*******************************************************************/          
 /**  Get the current date in REXX base format and standard format.**/          
 /**  Convert the standard format into IRRADU00 and IRRDBU00       **/          
 /**  output format (YYYY-MM-DD).                                  **/          
 /*******************************************************************/          
 current_days=DATE('B')                                                         
 current_date=DATE('S',current_days,'B')                                        
 current_date=INSERT("-",current_date,4)                                        
 current_date=INSERT("-",current_date,7)                                        
                                                                                
                                                                                
 /*******************************************************************/          
 /**  Calculate the selection criteria date by subtracting         **/          
 /**  <user_age> from the current date. Convert this to IRRADU00   **/          
 /**  and IRRDBU00 output (YYYY-MM-DD).                            **/          
 /*******************************************************************/          
 user_days             = current_days - user_age                                
                                                                                
 user_date             = DATE('S',user_days,'B')                                
 user_date=INSERT("-",user_date,4)                                              
 user_date=INSERT("-",user_date,7)                                              
                                                                                
 Say "Today is "  current_date                                                  
 Say "Processing user profiles defined after "  user_date                       
                                                                                
                                                                                
 /*******************************************************************/          
 /**  Create DFSORT control statements to select all of the        **/          
 /**  "User Basic Data" records (0200) where the creation date     **/          
 /**  is greater or equal to the date that we calculated above     **/          
 /*******************************************************************/          
 sortcntl.1=" INCLUDE COND=(5,4,CH,EQ,C'0200',AND,"                             
 sortcntl.2="         19,10,CH,GE,C'"||user_date||"')"                          
 sortcntl.3=" OPTION VLSHRT"                                                    
                                                                                
 /*******************************************************************/          
 /**  Weite the DFSORT control statements to a dataset.            **/          
 /*******************************************************************/          
 execio 3 diskw SORTCNTL "(ST"  sortcntl.                                       
                                                                                
 /*******************************************************************/          
 /**  Create DFSORT ICETOOL control statements to create a         **/          
 /**  report showing the creation date, user ID, creator,          **/          
 /**  and characteristics of the user ID.                          **/          
 /*******************************************************************/          
 icecntl.1= " COPY    FROM(DBUDATA) TO(TEMP0001) USING(SORT)         "          
 icecntl.2= " DISPLAY FROM(TEMP0001) LIST(PRINT) -                   "          
 icecntl.3= "         PAGE -                                         "          
 icecntl.4= "         TITLE('User Defined Within the past "||user_age||,        
                      " days')-                                      "          
 icecntl.5= "         DATE(YMD/) -                                   "          
 icecntl.6= "         TIME(12:)  -                                   "          
 icecntl.7= "         BLANK -                                        "          
 icecntl.8= "         ON(19,10,CH)  HEADER('Date') -                 "          
 icecntl.9= "         ON(10,8,CH)   HEADER('User ID') -              "          
 icecntl.10="         ON(30,8,CH)   HEADER('Owner') -                "          
 icecntl.11="         ON(44,4,CH)   HEADER('Special') -              "          
 icecntl.12="         ON(49,4,CH)   HEADER('Operations') -           "          
 icecntl.13="         ON(385,4,CH)  HEADER('Auditor')  -             "          
 icecntl.14="         ON(118,10,CH) HEADER('Last Date') -            "          
 icecntl.15="         ON(109,8,CH)  HEADER('Last Time')              "          
                                                                                
 /*******************************************************************/          
 /**  Write the DFSORT ICETOOL control statements to a dataset.    **/          
 /*******************************************************************/          
 execio 15 diskw ICECNTL "(ST"   icecntl.                                       
                                                                                
                                                                                
 /*******************************************************************/          
 /**  END!                                                         **/          
 /*******************************************************************/          
ZZ                                                                              
//SYSUT2   DD   DISP=(NEW,PASS,DELETE),DSN=&&CLIST(REXXICE),                    
//         SPACE=(TRK,(10,2,5)),                                                
//         UNIT=SYSALLDA,DCB=(LRECL=80,RECFM=FB,BLKSIZE=0)                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   DUMMY                                                           
//*******************************************************************           
//EXECREXX EXEC PGM=IKJEFT01,PARM='%REXXICE'                                    
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPROC  DD DISP=(OLD,DELETE,DELETE),DSN=&&CLIST                              
//SYSTSIN  DD DUMMY                                                             
//SORTCNTL DD DISP=(NEW,PASS,DELETE),DSN=&&SORTCNTL,                            
//         SPACE=(TRK,(1,0,0)),                                                 
//         UNIT=SYSALLDA,DCB=(LRECL=80,RECFM=FB,BLKSIZE=0)                      
//ICECNTL  DD DISP=(NEW,PASS,DELETE),DSN=&&ICECNTL,                             
//         SPACE=(TRK,(1,0,0)),                                                 
//         UNIT=SYSALLDA,DCB=(LRECL=80,RECFM=FB,BLKSIZE=0)                      
//*******************************************************************           
//RACFICE   EXEC PGM=ICETOOL                                            00080013
//TOOLMSG   DD SYSOUT=*                                                 00090000
//PRINT     DD SYSOUT=*                                                 00100000
//DFSMSG    DD SYSOUT=*                                                 00110015
//DBUDATA   DD DISP=SHR,DSN=&DBUDATA                                    00121000
//TEMP0001  DD DISP=(NEW,DELETE,DELETE),SPACE=(CYL,(20,5,0))            00130000
//SORTCNTL  DD DISP=SHR,DSN=&SORTCNTL                                   00150011
//TOOLIN    DD DISP=SHR,DSN=&ICECNTL                                    00150011
./   ADD  NAME=ACD$                                                             
**********************************************************************          
* Name: ACD$                                                         *          
*                                                                    *          
* Find all the user who are using automatic command direction.       *          
**********************************************************************          
SORT    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                  
DISPLAY FROM(TEMP0001) LIST(PRINT) -                                            
        PAGE -                                                                  
        TITLE('Users Who Are Using Automatic Command Direction') -              
        DATE(YMD/) -                                                            
        TIME(12:)  -                                                            
        BLANK -                                                                 
        ON(63,8,CH)   HEADER('User')     -                                      
        ON(32,10,CH)  HEADER('Date')     -                                      
        ON(23,8,CH)   HEADER('Time')     -                                      
        ON(14,8,CH)   HEADER('Result')   -                                      
        ON(605,20,CH) HEADER('Profile')  -                                      
        ON(861,51,CH) HEADER('Command (From LOGSTR)')                           
./   ADD  NAME=ACD$CNTL                                                         
 SORT FIELDS=(32,10,CH,A,23,8,CH,A)                                             
 INCLUDE COND=(5,8,CH,EQ,C'ACCESS  ',AND,                                       
               286,10,CH,EQ,C'AUTODIRECT',AND,                                  
               578,8,CH,EQ,C'RRSFDATA ')                                        
 OPTION   VLSHRT                                                                
./   ADD  NAME=ASOC                                                             
**********************************************************************          
* Name: ASOC                                                         *          
*                                                                    *          
* Find all users who have associations defined.                      *          
**********************************************************************          
SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                  
DISPLAY FROM(TEMP0001) LIST(PRINT) -                                            
        PAGE -                                                                  
        TITLE('Users Who Have Explicit Associations Defined') -                 
        DATE(YMD/) -                                                            
        TIME(12:)  -                                                            
        BLANK -                                                                 
        ON(10,8,CH)    HEADER('User ID') -                                      
        ON(19,8,CH)    HEADER('Tgt Node')  -                                    
        ON(28,8,CH)    HEADER('Tgt User')  -                                    
        ON(41,4,CH)    HEADER('Peer')  -                                        
        ON(56,4,CH)    HEADER('Remote Pend') -                                  
        ON(61,4,CH)    HEADER('Local Pend') -                                   
        ON(66,4,CH)    HEADER('PWSYNC') -                                       
        ON(103,10,CH)  HEADER('Accepted Date') -                                
        ON(114,8,CH)   HEADER('Accepted Time') -                                
        ON(130,8,CH)   HEADER('Creator')                                        
./   ADD  NAME=ASOCCNTL                                                         
 SORT FIELDS=(10,8,CH,A)                                                        
 INCLUDE COND=(5,4,CH,EQ,C'0206')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=BGGRCNTL                                                         
 SORT    FIELDS=(10,246,CH,A)                                                   
 INCLUDE COND=(5,4,CH,EQ,C'0500',AND,266,4,CH,EQ,C'NO  ',AND,          X        
               257,8,CH,NE,C'PROGRAM ',AND,                            X        
              (10,249,SS,EQ,C'*',OR,10,249,SS,EQ,C'%'))                         
 OPTION   VLSHRT                                                                
./   ADD  NAME=CADU                                                             
**********************************************************************          
* Name: CADU                                                         *          
*                                                                    *          
* Report the number of event records in the IRRADU00 data set.       *          
*                                                                    *          
**********************************************************************          
 COPY    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                 
 OCCURS  FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Number of Events in the IRRADU00 Data Set')-                    
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(5,8,CH)    HEADER('Type') -                                         
         ON(VALCNT)    HEADER('Count')                                          
./   ADD  NAME=CADUCNTL                                                         
 SORT FIELDS=(5,8,CH,A)                                                         
                                                                                
 OPTION   VLSHRT                                                                
./   ADD  NAME=CCONCNTL                                                         
 INCLUDE COND=(5,4,CH,EQ,C'0205')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=CGENCNTL                                                         
 INCLUDE COND=(5,4,CH,EQ,C'0500')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=CMD$                                                             
**********************************************************************          
* Name: CMD$                                                         *          
*                                                                    *          
* Find all of the commands that were issued by a specific user       *          
* incorrect passwords.                                               *          
*                                                                    *          
**********************************************************************          
 COPY    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                 
 OCCURS  FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Count of Commands Issued by User ID')-                          
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(63,8,CH)  HEADER('User ID') -                                       
         ON(32,10,CH) HEADER('Date') -                                          
         ON(5,8,CH)   HEADER('Command') -                                       
         ON(VALCNT)   HEADER('Count')                                           
./   ADD  NAME=CMD$CNTL                                                         
 INCLUDE COND=(5,8,CH,EQ,C'ADDSD   ',OR,                                        
               5,8,CH,EQ,C'ADDGROUP',OR,                                        
               5,8,CH,EQ,C'ADDUSER ',OR,                                        
               5,8,CH,EQ,C'ALTDSD  ',OR,                                        
               5,8,CH,EQ,C'ALTUSER ',OR,                                        
               5,8,CH,EQ,C'ALTGROUP',OR,                                        
               5,8,CH,EQ,C'CONNECT ',OR,                                        
               5,8,CH,EQ,C'DELUSER ',OR,                                        
               5,8,CH,EQ,C'PASSWORD',OR,                                        
               5,8,CH,EQ,C'PERMIT  ',OR,                                        
               5,8,CH,EQ,C'RALTER  ',OR,                                        
               5,8,CH,EQ,C'RDEFINE ',OR,                                        
               5,8,CH,EQ,C'SETROPTS',OR,                                        
               5,8,CH,EQ,C'RVARY   ',OR,                                        
               5,8,CH,EQ,C'RACLINK ',OR,                                        
               5,8,CH,EQ,C'RACDCERT')                                           
 OPTION   VLSHRT                                                                
./   ADD  NAME=CONN                                                             
**********************************************************************          
* Name: CONN                                                         *          
*                                                                    *          
* Find all of the user IDs which have group privileges above USE.    *          
**********************************************************************          
 SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('User IDs With Group Privileges Above Use') -                    
         DATE(YMD/) -                                                           
         TIME(12:) -                                                            
         BLANK -                                                                
         ON(19,8,CH) HEADER('User ID') -                                        
         ON(10,8,CH) HEADER('Group ID') -                                       
         ON(28,8,CH) HEADER('Authority')                                        
./   ADD  NAME=CONNCNTL                                                         
 SORT FIELDS=(10,8,CH,A)                                                        
 INCLUDE COND=(28,8,CH,NE,C'USE',AND,                                           
               5,4,CH,EQ,C'0102')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=CPROCNTL                                                         
 INCLUDE COND=(5,4,SS,EQ,C'0100,0200,0400,0500')                                
                                                                                
 OUTFIL FNAMES=TEMP0001,OUTREC=(1,4,5,4,CHANGE=(26,                             
        C'0100',C'Group Profiles',                                              
        C'0200',C'User Profiles',                                               
        C'0400',C'Dataset Profiles',                                            
        C'0500',C'General Resource Profiles'),                                  
        NOMATCH=(C'Unknown Profiles'))                                          
 OPTION   VLSHRT                                                                
./   ADD  NAME=ECD$                                                             
**********************************************************************          
* Name: ECD$                                                         *          
*                                                                    *          
* Find all the user who are directing commands explicitly.           *          
**********************************************************************          
SORT    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                  
DISPLAY FROM(TEMP0001) LIST(PRINT) -                                            
        PAGE -                                                                  
        TITLE('Users Who Are Directing Commands Explicitly') -                  
        DATE(YMD/) -                                                            
        TIME(12:)  -                                                            
        BLANK -                                                                 
        ON(63,8,CH)   HEADER('User')     -                                      
        ON(32,10,CH)  HEADER('Date')     -                                      
        ON(23,8,CH)   HEADER('Time')     -                                      
        ON(14,8,CH)   HEADER('Result')   -                                      
        ON(605,20,CH) HEADER('Profile')  -                                      
        ON(861,51,CH) HEADER('Command (From LOGSTR)')                           
./   ADD  NAME=ECD$CNTL                                                         
 SORT FIELDS=(32,10,CH,A,23,8,CH,A)                                             
 INCLUDE COND=(5,8,CH,EQ,C'ACCESS  ',AND,                                       
               286,6,CH,EQ,C'DIRECT',AND,                                       
               578,8,CH,EQ,C'RRSFDATA ')                                        
 OPTION   VLSHRT                                                                
./   ADD  NAME=ICECNTL                                                          
//RACFICE   EXEC PGM=ICETOOL,PARM='MSGPRT=ALL'                          00080013
//TOOLMSG   DD SYSOUT=*                                                 00090000
//PRINT     DD SYSOUT=*                                                 00100000
//DFSMSG    DD SYSOUT=*                                                 00110015
//ADUDATA   DD DISP=SHR,DSN=&ADUDATA                                    00120000
//DBUDATA   DD DISP=SHR,DSN=&DBUDATA                                    00121000
//TEMP0001  DD DISP=(NEW,DELETE,DELETE),SPACE=(CYL,(20,5,0))            00130000
./   ADD  NAME=IDSC                                                             
**********************************************************************          
* Name: IDSC                                                         *          
*                                                                    *          
* Find all of the data set profiles conditional access lists which   *          
* have a "*" in the access list with a level of other than NONE.     *          
**********************************************************************          
 SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('DS Conditional ACLs With ID(*) Other Than None') -              
         DATE(YMD/) -                                                           
         TIME(12:) -                                                            
         BLANK -                                                                
         ON(10,44,CH)  HEADER('Profile Name') -                                 
         ON(55,6,CH)   HEADER('Volume') -                                       
         ON(89,8,CH)   HEADER('Access') -                                       
         ON(62,8,CH)   HEADER('Access Type') -                                  
         ON(71,8,CH)   HEADER('Access Element')                                 
./   ADD  NAME=IDSCCNTL                                                         
 SORT FIELDS=(10,44,CH,A,55,6,CH,A)                                             
 INCLUDE COND=(5,4,CH,EQ,C'0402',AND,80,8,CH,EQ,C'*')                           
 OPTION   VLSHRT                                                                
./   ADD  NAME=IDSS                                                             
**********************************************************************          
* Name: IDSS                                                         *          
*                                                                    *          
* Find all of the data set profiles access lists which have an       *          
* "*" on the access list with a level of other than NONE.            *          
**********************************************************************          
 SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('DS Standard ACLs With ID(*) Other Than None') -                 
         DATE(YMD/) -                                                           
         TIME(12:) -                                                            
         BLANK -                                                                
         ON(10,44,CH)  HEADER('Profile Name') -                                 
         ON(55,6,CH)   HEADER('Volume') -                                       
         ON(71,8,CH)   HEADER('Access')                                         
./   ADD  NAME=IDSSCNTL                                                         
 SORT FIELDS=(10,44,CH,A,55,6,CH,A)                                             
 INCLUDE COND=(5,4,CH,EQ,C'0404',AND,62,8,CH,EQ,C'*')                           
 OPTION   VLSHRT                                                                
./   ADD  NAME=IGRC                                                             
**********************************************************************          
* Name: IGRC                                                         *          
*                                                                    *          
* Find all of the general resource profile conditional access list   *          
* entries which have a "*" on the access list with a level of        *          
* other than NONE.                                                   *          
**********************************************************************          
 SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('GR Conditional ACLs with ID(*) Other Than None') -              
         DATE(YMD/) -                                                           
         TIME(12:) -                                                            
         BLANK -                                                                
         ON(257,8,CH)  HEADER('Class')          -                               
         ON(10,60,CH)  HEADER('Profile Name')   -                               
         ON(293,8,CH)  HEADER('Access')         -                               
         ON(266,8,CH)  HEADER('Access Type')    -                               
         ON(275,8,CH)  HEADER('Access Element')                                 
./   ADD  NAME=IGRCCNTL                                                         
 SORT FIELDS=(257,8,CH,A,10,246,CH,A)                                           
 INCLUDE COND=(5,4,CH,EQ,C'0507',AND,284,8,CH,EQ,C'*')                          
 OPTION   VLSHRT                                                                
./   ADD  NAME=IGRS                                                             
**********************************************************************          
* Name: IGRS                                                         *          
*                                                                    *          
* Find all of the general resource profile standard access list      *          
* entries which have a "*" on the access list with a level of        *          
* other than NONE.                                                   *          
**********************************************************************          
 SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('GR Standard ACLs with ID(*) Other Than None') -                 
         DATE(YMD/) -                                                           
         TIME(12:) -                                                            
         BLANK -                                                                
         ON(257,8,CH)  HEADER('Class') -                                        
         ON(10,80,CH)  HEADER('Profile Name') -                                 
         ON(275,8,CH)  HEADER('Access')                                         
./   ADD  NAME=IGRSCNTL                                                         
 SORT FIELDS=(257,8,CH,A,10,247,CH,A)                                           
 INCLUDE COND=(5,4,CH,EQ,C'0505',AND,266,8,CH,EQ,C'*')                          
 OPTION   VLSHRT                                                                
./   ADD  NAME=LOGB                                                             
**********************************************************************          
* Name: LOGB                                                         *          
*                                                                    *          
* Find all of the RACF/VM Users who logged on with LOGON BY.         *          
**********************************************************************          
SORT    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                  
DISPLAY FROM(TEMP0001) LIST(PRINT) -                                            
        PAGE -                                                                  
        TITLE('Users Who Log on with LOGON BY') -                               
        DATE(YMD/) -                                                            
        TIME(12:)  -                                                            
        BLANK -                                                                 
        ON(32,10,CH)  HEADER('Date')     -                                      
        ON(23,8,CH)   HEADER('Time')     -                                      
        ON(43,4,CH)   HEADER('System')   -                                      
        ON(175,8,CH)  HEADER('Terminal')   -                                    
        ON(63,8,CH)   HEADER('User')     -                                      
        ON(295,8,CH)  HEADER('LOGSTR')   -                                      
        ON(673,8,CH) HEADER('By User')                                          
./   ADD  NAME=LOGBCNTL                                                         
 SORT FIELDS=(32,10,CH,A,23,8,CH,A)                                             
 INCLUDE COND=(5,8,CH,EQ,C'JOBINIT ',AND,295,8,CH,EQ,C'LOGON BY')               
 OPTION   VLSHRT                                                                
./   ADD  NAME=LOGF                                                             
**********************************************************************          
* Name: LOGF                                                         *          
*                                                                    *          
* Find all of the user IDs which have had an excessive number of     *          
* incorrect passwords.                                               *          
*                                                                    *          
* The ICETOOL "HIGHER(x)" keyword is used to set the failure         *          
* threshold.                                                         *          
**********************************************************************          
 COPY    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                 
 OCCURS  FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('User IDs With Excessive Incorrect Passwords')-                  
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(63,8,CH) HEADER('User ID') -                                        
         ON(VALCNT)  HEADER('Number of Incorrect Passwords') -                  
         HIGHER(3)                                                              
./   ADD  NAME=LOGFCNTL                                                         
 INCLUDE COND=(5,8,CH,EQ,C'JOBINIT',AND,                                        
               14,8,CH,EQ,C'INVPSWD')                                           
 OPTION   VLSHRT                                                                
./   ADD  NAME=NGRP                                                             
**********************************************************************          
* Name: NGRP                                                         *          
*                                                                    *          
* Find all of the groups which were defined after a specific         *          
* date.                                                              *          
*                                                                    *          
* The DFSORT "INCLUDE" statement is used to select the user ID.      *          
* The DFSORT control statements are pointed to by the ICETOOL        *          
* "USING" keyword.                                                   *          
**********************************************************************          
 COPY    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Groups Defined After a Specific Date')-                         
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(28,10,CH) HEADER('Date') -                                          
         ON(10,8,CH)  HEADER('Group ID') -                                      
         ON(39,8,CH)  HEADER('Owner') -                                         
         ON(19,8,CH)  HEADER('Superior Group')                                  
./   ADD  NAME=NGRPCNTL                                                         
 INCLUDE COND=(5,4,CH,EQ,C'0100',AND,                                           
               28,10,CH,GE,C'1990-01-01')                                       
 OPTION   VLSHRT                                                                
./   ADD  NAME=NOTG                                                             
SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                  
DISPLAY FROM(TEMP0001) LIST(PRINT) -                                            
        PAGE -                                                                  
        TITLE('Discrete GR Profiles with Generic Names')-                       
        DATE(YMD/) -                                                            
        TIME(12:)  -                                                            
        BLANK -                                                                 
        ON(10,40,CH)   HEADER('Profile') -                                      
        ON(266,4,CH)   HEADER('Generic') -                                      
        ON(257,8,CH)   HEADER('Class') -                                        
        ON(275,10,CH)  HEADER('Created') -                                      
        ON(286,8,CH)   HEADER('By')                                             
SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                  
DISPLAY FROM(TEMP0001) LIST(PRINT) -                                            
        PAGE -                                                                  
        TITLE('Discrete Dataset Profiles with Generic Names')-                  
        DATE(YMD/) -                                                            
        TIME(12:)  -                                                            
        BLANK -                                                                 
        ON(10,40,CH)   HEADER('Profile') -                                      
        ON(62,4,CH)    HEADER('Generic') -                                      
        ON(67,10,CH)   HEADER('Created') -                                      
        ON(78,8,CH)    HEADER('By')                                             
//BADGCNTL  DD *                                                                
 SORT    FIELDS=(10,246,CH,A)                                                   
 INCLUDE COND=(5,4,CH,EQ,C'0500',AND,266,4,CH,EQ,C'NO  ',AND,          X        
               257,8,CH,NE,C'PROGRAM ',AND,                            X        
               (10,249,SS,EQ,C'*',OR,10,249,SS,EQ,C'%'))                        
 OPTION   VLSHRT                                                                
/*                                                                              
//BADDCNTL  DD *                                                                
 SORT    FIELDS=(10,246,CH,A)                                                   
 INCLUDE COND=(5,4,CH,EQ,C'0400',AND,62,4,CH,EQ,C'NO  ',AND,           X        
               (10,44,SS,EQ,C'*',OR,10,44,SS,EQ,C'%'))                          
 OPTION   VLSHRT                                                                
/*                                                                              
./   ADD  NAME=OMVS                                                             
**********************************************************************          
* NAME: OMVS                                                         *          
*                                                                    *          
* Find all of the user IDs which have an OMVS segment specified.     *          
**********************************************************************          
 SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('User IDs With an OMVS Segment') -                               
         DATE(YMD/) -                                                           
         TIME(12:) -                                                            
         BLANK -                                                                
         ON(10,8,CH)    HEADER('User ID') -                                     
         ON(19,10,CH)   HEADER('OMVS UID') -                                    
         ON(30,44,CH)   HEADER('OMVS Home Path') -                              
         ON(1054,44,CH) HEADER('Default Program')                               
./   ADD  NAME=OMVSCNTL                                                         
 SORT FIELDS=(10,8,CH,A)                                                        
 INCLUDE COND=(5,4,CH,EQ,C'0270')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=OPER                                                             
**********************************************************************          
* Name: OPER                                                         *          
*                                                                    *          
* Find all of the resource accesses that were allowed due to         *          
* the user ID having the RACF OPERATIONS attribute.                  *          
**********************************************************************          
 SORT    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Accesses Allowed Because the User has OPERATIONS') -            
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(23,8,CH)   HEADER('Time') -                                         
         ON(32,10,CH)  HEADER('Date') -                                         
         ON(63,8,CH)   HEADER('User ID') -                                      
         ON(286,36,CH) HEADER('Resource Name') -                                
         ON(564,6,CH)  HEADER('Volume') -                                       
         ON(605,36,CH) HEADER('Profile')                                        
./   ADD  NAME=OPERCNTL                                                         
 SORT    FIELDS=(63,8,CH,A)                                                     
 INCLUDE COND=(5,8,CH,EQ,C'ACCESS',AND,                                         
               91,3,CH,EQ,C'YES')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=PWD$                                                             
**********************************************************************          
* Name: PWD$                                                         *          
*                                                                    *          
* Find all the user who are using password synchronization.          *          
**********************************************************************          
SORT    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                  
DISPLAY FROM(TEMP0001) LIST(PRINT) -                                            
        PAGE -                                                                  
        TITLE('Users Who Are Using Password Synchronization') -                 
        DATE(YMD/) -                                                            
        TIME(12:)  -                                                            
        BLANK -                                                                 
        ON(63,8,CH)   HEADER('User')     -                                      
        ON(32,10,CH)  HEADER('Date')     -                                      
        ON(23,8,CH)   HEADER('Time')     -                                      
        ON(14,8,CH)   HEADER('Result')   -                                      
        ON(605,20,CH) HEADER('Profile')  -                                      
        ON(861,51,CH) HEADER('LOGSTR Data')                                     
./   ADD  NAME=PWD$CNTL                                                         
 SORT FIELDS=(32,10,CH,A,23,8,CH,A)                                             
 INCLUDE COND=(5,8,CH,EQ,C'ACCESS  ',AND,                                       
               286,6,CH,EQ,C'PWSYNC',AND,                                       
               578,8,CH,EQ,C'RRSFDATA ')                                        
 OPTION   VLSHRT                                                                
./   ADD  NAME=RACFICE                                                          
//*-------------------------------------------------------------------- 00021900
//RACFICE  PROC  REPORT=                     Name of report             00022121
//***********************************************************           00023000
//* These samples are provided for tutorial purposes only. **           00024000
//* This code has not been submitted to formal IBM testing.**           00025000
//* This source is distributed on an "as-is" basis,        **           00026000
//* without any warranties either expressed or implied.    **           00027000
//*                                                        **           00028000
//* (c) Copyright 1994, 1996 IBM Corporation               **           00029000
//***********************************************************           00030000
//***********************************************************           00040000
//*         See the "DFSORT Application Programming:       **           00050000
//*         Guide" (SC33-4035) for more information.       **           00060000
//***********************************************************           00070000
//RACFICE   EXEC PGM=ICETOOL                                            00080025
//TOOLMSG   DD DUMMY                                                    00090030
//PRINT     DD SYSOUT=*                                                 00100000
//DFSMSG    DD DUMMY                                                    00110030
//ADUDATA   DD DISP=SHR,DSN=&ADUDATA                                    00120000
//DBUDATA   DD DISP=SHR,DSN=&DBUDATA                                    00121000
//TEMP0001  DD DISP=(NEW,DELETE,DELETE),SPACE=(CYL,(20,5,0))            00130000
//TEMP0002  DD DISP=(NEW,DELETE,DELETE),SPACE=(CYL,(20,5,0))            00131022
//TOOLIN    DD DISP=SHR,DSN=&ICECNTL(&REPORT)                           00140011
//RACFCNTL  DD DISP=SHR,DSN=&ICECNTL(&REPORT.CNTL)                      00150011
./   ADD  NAME=RACL                                                             
**********************************************************************          
* Name: RACL                                                         *          
*                                                                    *          
* Select all of the RACLINK Audit Records.                           *          
**********************************************************************          
SORT    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                  
DISPLAY FROM(TEMP0001) LIST(PRINT) -                                            
        PAGE -                                                                  
        TITLE('RACLINK Audit Records') -                                        
        DATE(YMD/) -                                                            
        TIME(12:)  -                                                            
        BLANK -                                                                 
        ON(63,8,CH)   HEADER('User')     -                                      
        ON(32,10,CH)  HEADER('Date')     -                                      
        ON(23,8,CH)   HEADER('Time')     -                                      
        ON(14,8,CH)   HEADER('Result')   -                                      
        ON(472,17,CH) HEADER('Phase')    -                                      
        ON(572,8,CH)  HEADER('Password')   -                                    
        ON(581,7,CH)  HEADER('Assoc')   -                                       
        ON(590,31,CH) HEADER('RACLINK Operands')                                
./   ADD  NAME=RACLCNTL                                                         
 SORT FIELDS=(32,10,CH,A,23,8,CH,A)                                             
 INCLUDE COND=(5,8,CH,EQ,C'RACLINK ')                                           
 OPTION   VLSHRT                                                                
./   ADD  NAME=RRSFASOC                                                         
//          INCLUDE MEMBER=ICECNTL                                      00080013
//TOOLIN    DD *                                                        00140011
**********************************************************************          
* Name: ASOC                                                         *          
*                                                                    *          
* Find all users who have associations defined.                      *          
**********************************************************************          
SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                  
DISPLAY FROM(TEMP0001) LIST(PRINT) -                                            
        PAGE -                                                                  
        TITLE('Users Who Have Explicit Associations Defined') -                 
        DATE(YMD/) -                                                            
        TIME(12:)  -                                                            
        BLANK -                                                                 
        ON(10,8,CH)    HEADER('User ID') -                                      
        ON(19,8,CH)    HEADER('Tgt Node')  -                                    
        ON(28,8,CH)    HEADER('Tgt User')  -                                    
        ON(41,4,CH)    HEADER('Peer')  -                                        
        ON(56,4,CH)    HEADER('Remote Pend') -                                  
        ON(61,4,CH)    HEADER('Local Pend') -                                   
        ON(66,4,CH)    HEADER('PWSYNC') -                                       
        ON(103,10,CH)  HEADER('Accepted Date') -                                
        ON(114,8,CH)   HEADER('Accepted Time') -                                
        ON(130,8,CH)   HEADER('Creator')                                        
//RACFCNTL  DD *                                                        00150011
 SORT FIELDS=(10,8,CH,A)                                                        
 INCLUDE COND=(5,4,CH,EQ,C'0206')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=SPEC                                                             
**********************************************************************          
* Name: SPEC                                                         *          
*                                                                    *          
* Find all of the resource accesses that were allowed due to         *          
* the user ID having the RACF SPECIAL attribute.                     *          
**********************************************************************          
 SORT    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Accesses Allowed Because the User has SPECIAL') -               
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(23,8,CH)   HEADER('Time') -                                         
         ON(32,10,CH)  HEADER('Date') -                                         
         ON(63,8,CH)   HEADER('User ID') -                                      
         ON(286,36,CH) HEADER('Resource Name') -                                
         ON(564,6,CH)  HEADER('Volume') -                                       
         ON(605,36,CH) HEADER('Profile')                                        
./   ADD  NAME=SPECCNTL                                                         
 SORT    FIELDS=(63,8,CH,A)                                                     
 INCLUDE COND=(5,8,CH,EQ,C'ACCESS',AND,                                         
               86,3,CH,EQ,C'YES')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=SUPU                                                             
**********************************************************************          
* Name: SUPU                                                         *          
*                                                                    *          
* Find all of the OpenEdition users who have a UID of zero           *          
* (superuser)                                  .                     *          
**********************************************************************          
 SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('OpenEdition Super Users (UID of Zero)') -                       
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(10,8,CH)    HEADER('User ID') -                                     
         ON(30,36,CH)   HEADER('Path Name')-                                    
         ON(1054,36,CH) HEADER('Home Name')                                     
./   ADD  NAME=SUPUCNTL                                                         
 SORT FIELDS=(10,8,CH,A)                                                        
 INCLUDE COND=(5,4,CH,EQ,C'0270',AND,19,10,CH,EQ,C'0000000000')                 
 OPTION   VLSHRT                                                                
./   ADD  NAME=TRMF                                                             
**********************************************************************          
* Name: TRMF                                                         *          
*                                                                    *          
* Find all of the terminals from which an excessive number of        *          
* logons with incorrect passwords have been attempted.               *          
*                                                                    *          
* The ICETOOL "HIGHER(x)" keyword is used to set the failure         *          
* threshold.                                                         *          
**********************************************************************          
 COPY    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                 
 OCCURS  FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Terminals with Excessive Incorrect Passwords')-                 
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(175,8,CH) HEADER('Terminal ID') -                                   
         ON(VALCNT)   HEADER('Number of Incorrect Passwords') -                 
         HIGHER(3)                                                              
./   ADD  NAME=TRMFCNTL                                                         
 INCLUDE COND=(5,8,CH,EQ,C'JOBINIT',AND,                                        
               14,8,CH,EQ,C'INVPSWD')                                           
 OPTION   VLSHRT                                                                
./   ADD  NAME=UADS                                                             
**********************************************************************          
* Name: UADS                                                         *          
*                                                                    *          
* Find all of the data set profiles which have a UACC other than     *          
* NONE.                                                              *          
**********************************************************************          
 SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Data Sets with a UACC Other Than None') -                       
         DATE(YMD/) -                                                           
         TIME(12:) -                                                            
         BLANK -                                                                
         ON(10,44,CH)  HEADER('Data Set Name') -                                
         ON(55,6,CH)   HEADER('Volume') -                                       
         ON(78,8,CH)   HEADER('Owner')  -                                       
         ON(133,8,CH)  HEADER('UACC')                                           
./   ADD  NAME=UADSCNTL                                                         
 SORT FIELDS=(10,44,CH,A,55,6,CH,A)                                             
 INCLUDE COND=(5,4,CH,EQ,C'0400',AND,133,8,CH,NE,C'NONE')                       
 OPTION   VLSHRT                                                                
./   ADD  NAME=UAGRCNTL                                                         
 SORT FIELDS=(257,8,CH,A,10,246,CH,A)                                           
 INCLUDE COND=(5,4,CH,EQ,C'0500',AND,341,8,CH,NE,C'NONE')                       
 OPTION   VLSHRT                                                                
./   ADD  NAME=UGLB                                                             
**********************************************************************          
* Name: UGLB                                                         *          
*                                                                    *          
* Find all of the user IDs which have extraordinary RACF privileges, *          
* such as SPECIAL, OPERATIONS, and AUDITOR at the global level.      *          
**********************************************************************          
 SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('User IDs With Extraordinary Global Authorities') -              
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(10,8,CH)  HEADER('User ID') -                                       
         ON(79,20,CH) HEADER('User Name') -                                     
         ON(44,4,CH)  HEADER('Special') -                                       
         ON(49,4,CH)  HEADER('Operations') -                                    
         ON(390,4,CH) HEADER('Auditor')                                         
./   ADD  NAME=UGLBCNTL                                                         
 SORT FIELDS=(10,8,CH,A)                                                        
 INCLUDE COND=((44,3,CH,EQ,C'YES',OR,                                           
               49,3,CH,EQ,C'YES',OR,                                            
               390,3,CH,EQ,C'YES'),AND,                                         
               5,4,CH,EQ,C'0200')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=UGRP                                                             
**********************************************************************          
* Name: UGRP                                                         *          
*                                                                    *          
* Find all of the user IDs which have extraordinary RACF privileges, *          
* such as SPECIAL, OPERATIONS, and AUDITOR at the group level.       *          
**********************************************************************          
 SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('User IDs With Extraordinary RACF Group Authorities') -          
         DATE(YMD/) -                                                           
         TIME(12:) -                                                            
         BLANK -                                                                
         ON(10,8,CH)  HEADER('User ID') -                                       
         ON(19,8,CH)  HEADER('Group ID') -                                      
         ON(88,4,CH)  HEADER('Group Special') -                                 
         ON(93,4,CH)  HEADER('Group Operations') -                              
         ON(113,4,CH) HEADER('Group Auditor')                                   
./   ADD  NAME=UGRPCNTL                                                         
 SORT FIELDS=(019,08,CH,A)                                                      
 INCLUDE COND=((88,3,CH,EQ,C'YES',OR,                                           
               93,3,CH,EQ,C'YES',OR,                                            
               113,3,CH,EQ,C'YES'),AND,                                         
               5,4,CH,EQ,C'0205')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=UIDS                                                             
**********************************************************************          
* Name: UIDS                                                         *          
*                                                                    *          
* Find all the OpenEdition UIDs which are used more than once.       *          
**********************************************************************          
 COPY    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 OCCURS  FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('OS/390 UNIX UIDs Used More Than Once') -                        
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(19,10,CH) HEADER('OpenEdition UID') -                               
         ON(VALCNT)   HEADER('Number of Times Used') -                          
         HIGHER(1)                                                              
./   ADD  NAME=UIDSCNTL                                                         
 INCLUDE COND=(5,4,CH,EQ,C'0270')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=URVK                                                             
**********************************************************************          
* Name: UVRK                                                         *          
*                                                                    *          
* Find all of the user IDs which are currently revoked.              *          
* Note: Only those IDs which have the REVOKED flag set in the        *          
* RACF data base are identified. IDs which will become revoked at    *          
* the next use are not found with this selection criteria.           *          
**********************************************************************          
 SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('User IDs Which are Currently Revoked') -                        
         DATE(YMD/) -                                                           
         TIME(12:) -                                                            
         BLANK -                                                                
         ON(10,8,CH)  HEADER('User ID') -                                       
         ON(79,20,CH) HEADER('User Name')                                       
./   ADD  NAME=URVKCNTL                                                         
 SORT FIELDS=(10,8,CH,A)                                                        
 INCLUDE COND=(54,3,CH,EQ,C'YES',AND,                                           
               5,4,CH,EQ,C'0200')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=VIOL                                                             
**********************************************************************          
* Name: VIOL                                                         *          
*                                                                    *          
* Find all of the resource accesses which represent a violation.     *          
**********************************************************************          
 SORT    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Access Violations')-                                            
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(23,8,CH)   HEADER('Time') -                                         
         ON(32,10,CH)  HEADER('Date') -                                         
         ON(14,8,CH)   HEADER('Qualifier') -                                    
         ON(63,8,CH)   HEADER('User ID') -                                      
         ON(286,30,CH) HEADER('Resource Name') -                                
         ON(578,8,CH)  HEADER('Class') -                                        
         ON(564,6,CH)  HEADER('Volume') -                                       
         ON(605,30,CH) HEADER('Profile')                                        
./   ADD  NAME=VIOLCNTL                                                         
 SORT    FIELDS=(63,8,CH,A)                                                     
 INCLUDE COND=(5,8,CH,EQ,C'ACCESS',AND,                                         
               48,3,CH,EQ,C'YES')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=WARN                                                             
**********************************************************************          
* Name: WARN                                                         *          
*                                                                    *          
* Find all of the resource accesses which have been granted          *          
* because a profile was in warning mode.                             *          
**********************************************************************          
 SORT    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Accesses Allowed Due to WARNING Mode Profiles')-                
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(23,8,CH)   HEADER('Time') -                                         
         ON(32,10,CH)  HEADER('Date') -                                         
         ON(63,8,CH)   HEADER('User ID') -                                      
         ON(286,36,CH) HEADER('Resource Name') -                                
         ON(564,6,CH)  HEADER('Volume') -                                       
         ON(605,36,CH) HEADER('Profile')                                        
./   ADD  NAME=WARNCNTL                                                         
 SORT    FIELDS=(63,8,CH,A)                                                     
 INCLUDE COND=(5,8,CH,EQ,C'ACCESS',AND,                                         
               58,3,CH,EQ,C'YES')                                               
 OPTION   VLSHRT                                                                
./   ADD  NAME=BGGR                                                             
**********************************************************************          
* Name: BGGR                                                         *          
*                                                                    *          
* Find the discrete generic resource profiles which have             *          
* generic characters in their name.                                  *          
**********************************************************************          
SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                  
DISPLAY FROM(TEMP0001) LIST(PRINT) -                                            
        PAGE -                                                                  
        TITLE('Discrete GR Profiles with Generic Names')-                       
        DATE(YMD/) -                                                            
        TIME(12:)  -                                                            
        BLANK -                                                                 
        ON(10,40,CH)   HEADER('Profile') -                                      
        ON(266,4,CH)   HEADER('Generic') -                                      
        ON(257,8,CH)   HEADER('Class') -                                        
        ON(275,10,CH)  HEADER('Created') -                                      
        ON(286,8,CH)   HEADER('By')                                             
./   ADD  NAME=UAGR                                                             
**********************************************************************          
* Name: UAGR                                                         *          
*                                                                    *          
* Find all of the general resporce profiles which have a UACC of     *          
* other than NONE.                                                   *          
**********************************************************************          
 SORT    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('General Resources with a UACC Other Than None') -               
         DATE(YMD/) -                                                           
         TIME(12:) -                                                            
         BLANK -                                                                
         ON(257,8,CH)  HEADER('Class') -                                        
         ON(10,44,CH)  HEADER('General Resource') -                             
         ON(286,8,CH)  HEADER('Owner')  -                                       
         ON(341,8,CH)  HEADER('UACC')                                           
./   ADD  NAME=CCON                                                             
**********************************************************************          
* Name: CCON                                                         *          
*                                                                    *          
* Find all of the users who have more than a specified number of     *          
* group connections.                                                 *          
*                                                                    *          
* The ICETOOL "HIGHER(x)" keyword is used to set the failure         *          
* threshold.                                                         *          
**********************************************************************          
 COPY    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 OCCURS  FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Users Who Have More Than 20 Group Connections') -               
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(10,8,CH)  HEADER('User ID') -                                       
         ON(VALCNT)   HEADER('Number of Group Connections') -                   
         HIGHER(20)                                                             
./   ADD  NAME=CGEN                                                             
**********************************************************************          
* Name: CGEN                                                         *          
*                                                                    *          
* Report the number of RACF profiles in the RACF data base.          *          
*                                                                    *          
**********************************************************************          
 COPY    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 OCCURS  FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Number of General Resource Profiles')-                          
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(257,8,CH)  HEADER('Class') -                                        
         ON(VALCNT)    HEADER('Count')                                          
./   ADD  NAME=CPRO                                                             
**********************************************************************          
* Name: CPRO                                                         *          
*                                                                    *          
* Report the number of RACF profiles in the RACF data base.          *          
*                                                                    *          
**********************************************************************          
 COPY    FROM(DBUDATA) TO(TEMP0001) USING(RACF)                                 
 OCCURS  FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Number of Profiles in the RACF Data Base')-                     
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(5,26,CH)   HEADER('Type') -                                         
         ON(VALCNT)    HEADER('Count')                                          
./   ADD  NAME=ADUSYMBL                                                         
*------------------------------------------------*                              
*                    JOBINIT                     *                              
*------------------------------------------------*                              
INIT_EVENT_TYPE,5,8,CH                                                          
INIT_EVENT_QUAL,14,8,CH                                                         
INIT_TIME_WRITTEN,23,8,CH                                                       
INIT_DATE_WRITTEN,32,10,CH                                                      
INIT_SYSTEM_SMFID,43,4,CH                                                       
INIT_VIOLATION,48,1,CH                                                          
INIT_USER_NDFND,53,1,CH                                                         
INIT_USER_WARNING,58,1,CH                                                       
INIT_EVT_USER_ID,63,8,CH                                                        
INIT_EVT_GRP_ID,72,8,CH                                                         
INIT_AUTH_NORMAL,81,1,CH                                                        
INIT_AUTH_SPECIAL,86,1,CH                                                       
INIT_AUTH_OPER,91,1,CH                                                          
INIT_AUTH_AUDIT,96,1,CH                                                         
INIT_AUTH_EXIT,101,1,CH                                                         
INIT_AUTH_FAILSFT,106,1,CH                                                      
INIT_AUTH_BYPASS,111,1,CH                                                       
INIT_AUTH_TRUSTED,116,1,CH                                                      
INIT_LOG_CLASS,121,1,CH                                                         
INIT_LOG_USER,126,1,CH                                                          
INIT_LOG_SPECIAL,131,1,CH                                                       
INIT_LOG_ACCESS,136,1,CH                                                        
INIT_LOG_RACINIT,141,1,CH                                                       
INIT_LOG_ALWAYS,146,1,CH                                                        
INIT_LOG_CMDVIOL,151,1,CH                                                       
INIT_LOG_GLOBAL,156,1,CH                                                        
INIT_TERM_LEVEL,161,3,CH                                                        
INIT_BACKOUT_FAIL,165,1,CH                                                      
INIT_PROF_SAME,170,1,CH                                                         
INIT_TERM,175,8,CH                                                              
INIT_JOB_NAME,184,8,CH                                                          
INIT_READ_TIME,193,8,CH                                                         
INIT_READ_DATE,202,10,CH                                                        
INIT_SMF_USER_ID,213,8,CH                                                       
INIT_LOG_LEVEL,222,1,CH                                                         
INIT_LOG_VMEVENT,227,1,CH                                                       
INIT_LOG_LOGOPT,232,1,CH                                                        
INIT_LOG_SECL,237,1,CH                                                          
INIT_LOG_COMPATM,242,1,CH                                                       
INIT_LOG_APPLAUD,247,1,CH                                                       
INIT_LOG_NONOMVS,252,1,CH                                                       
INIT_LOG_OMVSNPRV,257,1,CH                                                      
INIT_AUTH_OMVSSU,262,1,CH                                                       
INIT_AUTH_OMVSSYS,267,1,CH                                                      
INIT_USR_SECL,272,8,CH                                                          
INIT_RACF_VERSION,281,4,CH                                                      
INIT_APPL,286,8,CH                                                              
INIT_LOGSTR,295,255,CH                                                          
INIT_BAD_JOBNAME,551,8,CH                                                       
INIT_USER_NAME,560,20,CH                                                        
INIT_UTK_ENCR,581,4,CH                                                          
INIT_UTK_PRE19,586,4,CH                                                         
INIT_UTK_VERPROF,591,4,CH                                                       
INIT_UTK_NJEUNUSR,596,4,CH                                                      
INIT_UTK_LOGUSR,601,4,CH                                                        
INIT_UTK_SPECIAL,606,4,CH                                                       
INIT_UTK_DEFAULT,611,4,CH                                                       
INIT_UTK_UNKNUSR,616,4,CH                                                       
INIT_UTK_ERROR,621,4,CH                                                         
INIT_UTK_TRUSTED,626,4,CH                                                       
INIT_UTK_SESSTYPE,631,8,CH                                                      
INIT_UTK_SURROGAT,640,4,CH                                                      
INIT_UTK_REMOTE,645,4,CH                                                        
INIT_UTK_PRIV,650,4,CH                                                          
INIT_UTK_SECL,655,8,CH                                                          
INIT_UTK_EXECNODE,664,8,CH                                                      
INIT_UTK_SUSER_ID,673,8,CH                                                      
INIT_UTK_SNODE,682,8,CH                                                         
INIT_UTK_SGRP_ID,691,8,CH                                                       
INIT_UTK_SPOE,700,8,CH                                                          
INIT_UTK_SPCLASS,709,8,CH                                                       
INIT_UTK_USER_ID,718,8,CH                                                       
INIT_UTK_GRP_ID,727,8,CH                                                        
INIT_UTK_DFT_GRP,736,4,CH                                                       
INIT_UTK_DFT_SECL,741,4,CH                                                      
INIT_APPC_LINK,746,16,CH                                                        
INIT_UTK_NETW,763,8,CH                                                          
*------------------------------------------------*                              
*                     ACCESS                     *                              
*------------------------------------------------*                              
ACC_EVENT_TYPE,5,8,CH                                                           
ACC_EVENT_QUAL,14,8,CH                                                          
ACC_TIME_WRITTEN,23,8,CH                                                        
ACC_DATE_WRITTEN,32,10,CH                                                       
ACC_SYSTEM_SMFID,43,4,CH                                                        
ACC_VIOLATION,48,1,CH                                                           
ACC_USER_NDFND,53,1,CH                                                          
ACC_USER_WARNING,58,1,CH                                                        
ACC_EVT_USER_ID,63,8,CH                                                         
ACC_EVT_GRP_ID,72,8,CH                                                          
ACC_AUTH_NORMAL,81,1,CH                                                         
ACC_AUTH_SPECIAL,86,1,CH                                                        
ACC_AUTH_OPER,91,1,CH                                                           
ACC_AUTH_AUDIT,96,1,CH                                                          
ACC_AUTH_EXIT,101,1,CH                                                          
ACC_AUTH_FAILSFT,106,1,CH                                                       
ACC_AUTH_BYPASS,111,1,CH                                                        
ACC_AUTH_TRUSTED,116,1,CH                                                       
ACC_LOG_CLASS,121,1,CH                                                          
ACC_LOG_USER,126,1,CH                                                           
ACC_LOG_SPECIAL,131,1,CH                                                        
ACC_LOG_ACCESS,136,1,CH                                                         
ACC_LOG_RACINIT,141,1,CH                                                        
ACC_LOG_ALWAYS,146,1,CH                                                         
ACC_LOG_CMDVIOL,151,1,CH                                                        
ACC_LOG_GLOBAL,156,1,CH                                                         
ACC_TERM_LEVEL,161,3,CH                                                         
ACC_BACKOUT_FAIL,165,1,CH                                                       
ACC_PROF_SAME,170,1,CH                                                          
ACC_TERM,175,8,CH                                                               
ACC_JOB_NAME,184,8,CH                                                           
ACC_READ_TIME,193,8,CH                                                          
ACC_READ_DATE,202,10,CH                                                         
ACC_SMF_USER_ID,213,8,CH                                                        
ACC_LOG_LEVEL,222,1,CH                                                          
ACC_LOG_VMEVENT,227,1,CH                                                        
ACC_LOG_LOGOPT,232,1,CH                                                         
ACC_LOG_SECL,237,1,CH                                                           
ACC_LOG_COMPATM,242,1,CH                                                        
ACC_LOG_APPLAUD,247,1,CH                                                        
ACC_LOG_NONOMVS,252,1,CH                                                        
ACC_LOG_OMVSNPRV,257,1,CH                                                       
ACC_AUTH_OMVSSU,262,1,CH                                                        
ACC_AUTH_OMVSSYS,267,1,CH                                                       
ACC_USR_SECL,272,8,CH                                                           
ACC_RACF_VERSION,281,4,CH                                                       
ACC_RES_NAME,286,255,CH                                                         
ACC_REQUEST,542,8,CH                                                            
ACC_GRANT,551,8,CH                                                              
ACC_LEVEL,560,3,CH                                                              
ACC_VOL,564,6,CH                                                                
ACC_OLDVOL,571,6,CH                                                             
ACC_CLASS,578,8,CH                                                              
ACC_APPL,587,8,CH                                                               
ACC_TYPE,596,8,CH                                                               
ACC_NAME,605,246,CH                                                             
ACC_OWN_ID,852,8,CH                                                             
ACC_LOGSTR,861,255,CH                                                           
ACC_RECVR,1117,8,CH                                                             
ACC_USER_NAME,1126,20,CH                                                        
ACC_SECL,1147,8,CH                                                              
ACC_UTK_ENCR,1156,4,CH                                                          
ACC_UTK_PRE19,1161,4,CH                                                         
ACC_UTK_VERPROF,1166,4,CH                                                       
ACC_UTK_NJEUNUSR,1171,4,CH                                                      
ACC_UTK_LOGUSR,1176,4,CH                                                        
ACC_UTK_SPECIAL,1181,4,CH                                                       
ACC_UTK_DEFAULT,1186,4,CH                                                       
ACC_UTK_UNKNUSR,1191,4,CH                                                       
ACC_UTK_ERROR,1196,4,CH                                                         
ACC_UTK_TRUSTED,1201,4,CH                                                       
ACC_UTK_SESSTYPE,1206,8,CH                                                      
ACC_UTK_SURROGAT,1215,4,CH                                                      
ACC_UTK_REMOTE,1220,4,CH                                                        
ACC_UTK_PRIV,1225,4,CH                                                          
ACC_UTK_SECL,1230,8,CH                                                          
ACC_UTK_EXECNODE,1239,8,CH                                                      
ACC_UTK_SUSER_ID,1248,8,CH                                                      
ACC_UTK_SNODE,1257,8,CH                                                         
ACC_UTK_SGRP_ID,1266,8,CH                                                       
ACC_UTK_SPOE,1275,8,CH                                                          
ACC_UTK_SPCLASS,1284,8,CH                                                       
ACC_UTK_USER_ID,1293,8,CH                                                       
ACC_UTK_GRP_ID,1302,8,CH                                                        
ACC_UTK_DFT_GRP,1311,4,CH                                                       
ACC_UTK_DFT_SECL,1316,4,CH                                                      
ACC_RTK_ENCR,1321,4,CH                                                          
ACC_RTK_PRE19,1326,4,CH                                                         
ACC_RTK_VERPROF,1331,4,CH                                                       
ACC_RTK_NJEUNUSR,1336,4,CH                                                      
ACC_RTK_LOGUSR,1341,4,CH                                                        
ACC_RTK_SPECIAL,1346,4,CH                                                       
ACC_RTK_DEFAULT,1351,4,CH                                                       
ACC_RTK_UNKNUSR,1356,4,CH                                                       
ACC_RTK_ERROR,1361,4,CH                                                         
ACC_RTK_TRUSTED,1366,4,CH                                                       
ACC_RTK_SESSTYPE,1371,8,CH                                                      
ACC_RTK_SURROGAT,1380,4,CH                                                      
ACC_RTK_REMOTE,1385,4,CH                                                        
ACC_RTK_PRIV,1390,4,CH                                                          
ACC_RTK_SECL,1395,8,CH                                                          
ACC_RTK_EXECNODE,1404,8,CH                                                      
ACC_RTK_SUSER_ID,1413,8,CH                                                      
ACC_RTK_SNODE,1422,8,CH                                                         
ACC_RTK_SGRP_ID,1431,8,CH                                                       
ACC_RTK_SPOE,1440,8,CH                                                          
ACC_RTK_SPCLASS,1449,8,CH                                                       
ACC_RTK_USER_ID,1458,8,CH                                                       
ACC_RTK_GRP_ID,1467,8,CH                                                        
ACC_RTK_DFT_GRP,1476,4,CH                                                       
ACC_RTK_DFT_SECL,1481,4,CH                                                      
ACC_APPC_LINK,1486,16,CH                                                        
ACC_DCE_LINK,1503,16,CH                                                         
ACC_AUTH_TYPE,1520,13,CH                                                        
ACC_UTK_NETW,1534,8,CH                                                          
ACC_RTK_NETW,1543,8,CH                                                          
*------------------------------------------------*                              
*                     ADDVOL                     *                              
*------------------------------------------------*                              
ADV_EVENT_TYPE,5,8,CH                                                           
ADV_EVENT_QUAL,14,8,CH                                                          
ADV_TIME_WRITTEN,23,8,CH                                                        
ADV_DATE_WRITTEN,32,10,CH                                                       
ADV_SYSTEM_SMFID,43,4,CH                                                        
ADV_VIOLATION,48,1,CH                                                           
ADV_USER_NDFND,53,1,CH                                                          
ADV_USER_WARNING,58,1,CH                                                        
ADV_EVT_USER_ID,63,8,CH                                                         
ADV_EVT_GRP_ID,72,8,CH                                                          
ADV_AUTH_NORMAL,81,1,CH                                                         
ADV_AUTH_SPECIAL,86,1,CH                                                        
ADV_AUTH_OPER,91,1,CH                                                           
ADV_AUTH_AUDIT,96,1,CH                                                          
ADV_AUTH_EXIT,101,1,CH                                                          
ADV_AUTH_FAILSFT,106,1,CH                                                       
ADV_AUTH_BYPASS,111,1,CH                                                        
ADV_AUTH_TRUSTED,116,1,CH                                                       
ADV_LOG_CLASS,121,1,CH                                                          
ADV_LOG_USER,126,1,CH                                                           
ADV_LOG_SPECIAL,131,1,CH                                                        
ADV_LOG_ACCESS,136,1,CH                                                         
ADV_LOG_RACINIT,141,1,CH                                                        
ADV_LOG_ALWAYS,146,1,CH                                                         
ADV_LOG_CMDVIOL,151,1,CH                                                        
ADV_LOG_GLOBAL,156,1,CH                                                         
ADV_TERM_LEVEL,161,3,CH                                                         
ADV_BACKOUT_FAIL,165,1,CH                                                       
ADV_PROF_SAME,170,1,CH                                                          
ADV_TERM,175,8,CH                                                               
ADV_JOB_NAME,184,8,CH                                                           
ADV_READ_TIME,193,8,CH                                                          
ADV_READ_DATE,202,10,CH                                                         
ADV_SMF_USER_ID,213,8,CH                                                        
ADV_LOG_LEVEL,222,1,CH                                                          
ADV_LOG_VMEVENT,227,1,CH                                                        
ADV_LOG_LOGOPT,232,1,CH                                                         
ADV_LOG_SECL,237,1,CH                                                           
ADV_LOG_COMPATM,242,1,CH                                                        
ADV_LOG_APPLAUD,247,1,CH                                                        
ADV_LOG_NONOMVS,252,1,CH                                                        
ADV_LOG_OMVSNPRV,257,1,CH                                                       
ADV_AUTH_OMVSSU,262,1,CH                                                        
ADV_AUTH_OMVSSYS,267,1,CH                                                       
ADV_USR_SECL,272,8,CH                                                           
ADV_RACF_VERSION,281,4,CH                                                       
ADV_RES_NAME,286,255,CH                                                         
ADV_GRANT,542,8,CH                                                              
ADV_LEVEL,551,3,CH                                                              
ADV_VOL,555,6,CH                                                                
ADV_OLDVOL,562,6,CH                                                             
ADV_CLASS,569,8,CH                                                              
ADV_OWN_ID,578,8,CH                                                             
ADV_LOGSTR,587,255,CH                                                           
ADV_USER_NAME,843,20,CH                                                         
ADV_UTK_ENCR,864,4,CH                                                           
ADV_UTK_PRE19,869,4,CH                                                          
ADV_UTK_VERPROF,874,4,CH                                                        
ADV_UTK_NJEUNUSR,879,4,CH                                                       
ADV_UTK_LOGUSR,884,4,CH                                                         
ADV_UTK_SPECIAL,889,4,CH                                                        
ADV_UTK_DEFAULT,894,4,CH                                                        
ADV_UTK_UNKNUSR,899,4,CH                                                        
ADV_UTK_ERROR,904,4,CH                                                          
ADV_UTK_TRUSTED,909,4,CH                                                        
ADV_UTK_SESSTYPE,914,8,CH                                                       
ADV_UTK_SURROGAT,923,4,CH                                                       
ADV_UTK_REMOTE,928,4,CH                                                         
ADV_UTK_PRIV,933,4,CH                                                           
ADV_UTK_SECL,938,8,CH                                                           
ADV_UTK_EXECNODE,947,8,CH                                                       
ADV_UTK_SUSER_ID,956,8,CH                                                       
ADV_UTK_SNODE,965,8,CH                                                          
ADV_UTK_SGRP_ID,974,8,CH                                                        
ADV_UTK_SPOE,983,8,CH                                                           
ADV_UTK_SPCLASS,992,8,CH                                                        
ADV_UTK_USER_ID,1001,8,CH                                                       
ADV_UTK_GRP_ID,1010,8,CH                                                        
ADV_UTK_DFT_GRP,1019,4,CH                                                       
ADV_UTK_DFT_SECL,1024,4,CH                                                      
ADV_APPC_LINK,1029,16,CH                                                        
ADV_SPECIFIED,1046,1024,CH                                                      
ADV_UTK_NETW,2071,8,CH                                                          
*------------------------------------------------*                              
*                    RENAMEDS                    *                              
*------------------------------------------------*                              
REN_EVENT_TYPE,5,8,CH                                                           
REN_EVENT_QUAL,14,8,CH                                                          
REN_TIME_WRITTEN,23,8,CH                                                        
REN_DATE_WRITTEN,32,10,CH                                                       
REN_SYSTEM_SMFID,43,4,CH                                                        
REN_VIOLATION,48,1,CH                                                           
REN_USER_NDFND,53,1,CH                                                          
REN_USER_WARNING,58,1,CH                                                        
REN_EVT_USER_ID,63,8,CH                                                         
REN_EVT_GRP_ID,72,8,CH                                                          
REN_AUTH_NORMAL,81,1,CH                                                         
REN_AUTH_SPECIAL,86,1,CH                                                        
REN_AUTH_OPER,91,1,CH                                                           
REN_AUTH_AUDIT,96,1,CH                                                          
REN_AUTH_EXIT,101,1,CH                                                          
REN_AUTH_FAILSFT,106,1,CH                                                       
REN_AUTH_BYPASS,111,1,CH                                                        
REN_AUTH_TRUSTED,116,1,CH                                                       
REN_LOG_CLASS,121,1,CH                                                          
REN_LOG_USER,126,1,CH                                                           
REN_LOG_SPECIAL,131,1,CH                                                        
REN_LOG_ACCESS,136,1,CH                                                         
REN_LOG_RACINIT,141,1,CH                                                        
REN_LOG_ALWAYS,146,1,CH                                                         
REN_LOG_CMDVIOL,151,1,CH                                                        
REN_LOG_GLOBAL,156,1,CH                                                         
REN_TERM_LEVEL,161,3,CH                                                         
REN_BACKOUT_FAIL,165,1,CH                                                       
REN_PROF_SAME,170,1,CH                                                          
REN_TERM,175,8,CH                                                               
REN_JOB_NAME,184,8,CH                                                           
REN_READ_TIME,193,8,CH                                                          
REN_READ_DATE,202,10,CH                                                         
REN_SMF_USER_ID,213,8,CH                                                        
REN_LOG_LEVEL,222,1,CH                                                          
REN_LOG_VMEVENT,227,1,CH                                                        
REN_LOG_LOGOPT,232,1,CH                                                         
REN_LOG_SECL,237,1,CH                                                           
REN_LOG_COMPATM,242,1,CH                                                        
REN_LOG_APPLAUD,247,1,CH                                                        
REN_LOG_NONOMVS,252,1,CH                                                        
REN_LOG_OMVSNPRV,257,1,CH                                                       
REN_AUTH_OMVSSU,262,1,CH                                                        
REN_AUTH_OMVSSYS,267,1,CH                                                       
REN_USR_SECL,272,8,CH                                                           
REN_RACF_VERSION,281,4,CH                                                       
REN_RES_NAME,286,255,CH                                                         
REN_NEW_RES_NAME,542,255,CH                                                     
REN_LEVEL,798,3,CH                                                              
REN_VOL,802,6,CH                                                                
REN_CLASS,809,8,CH                                                              
REN_OWN_ID,818,8,CH                                                             
REN_LOGSTR,827,255,CH                                                           
REN_USER_NAME,1083,20,CH                                                        
REN_UTK_ENCR,1104,4,CH                                                          
REN_UTK_PRE19,1109,4,CH                                                         
REN_UTK_VERPROF,1114,4,CH                                                       
REN_UTK_NJEUNUSR,1119,4,CH                                                      
REN_UTK_LOGUSR,1124,4,CH                                                        
REN_UTK_SPECIAL,1129,4,CH                                                       
REN_UTK_DEFAULT,1134,4,CH                                                       
REN_UTK_UNKNUSR,1139,4,CH                                                       
REN_UTK_ERROR,1144,4,CH                                                         
REN_UTK_TRUSTED,1149,4,CH                                                       
REN_UTK_SESSTYPE,1154,8,CH                                                      
REN_UTK_SURROGAT,1163,4,CH                                                      
REN_UTK_REMOTE,1168,4,CH                                                        
REN_UTK_PRIV,1173,4,CH                                                          
REN_UTK_SECL,1178,8,CH                                                          
REN_UTK_EXECNODE,1187,8,CH                                                      
REN_UTK_SUSER_ID,1196,8,CH                                                      
REN_UTK_SNODE,1205,8,CH                                                         
REN_UTK_SGRP_ID,1214,8,CH                                                       
REN_UTK_SPOE,1223,8,CH                                                          
REN_UTK_SPCLASS,1232,8,CH                                                       
REN_UTK_USER_ID,1241,8,CH                                                       
REN_UTK_GRP_ID,1250,8,CH                                                        
REN_UTK_DFT_GRP,1259,4,CH                                                       
REN_UTK_DFT_SECL,1264,4,CH                                                      
REN_APPC_LINK,1269,16,CH                                                        
REN_SPECIFIED,1286,1024,CH                                                      
REN_UTK_NETW,2311,8,CH                                                          
*------------------------------------------------*                              
*                     DELRES                     *                              
*------------------------------------------------*                              
DELR_EVENT_TYPE,5,8,CH                                                          
DELR_EVENT_QUAL,14,8,CH                                                         
DELR_TIME_WRITTEN,23,8,CH                                                       
DELR_DATE_WRITTEN,32,10,CH                                                      
DELR_SYSTEM_SMFID,43,4,CH                                                       
DELR_VIOLATION,48,1,CH                                                          
DELR_USER_NDFND,53,1,CH                                                         
DELR_USER_WARNING,58,1,CH                                                       
DELR_EVT_USER_ID,63,8,CH                                                        
DELR_EVT_GRP_ID,72,8,CH                                                         
DELR_AUTH_NORMAL,81,1,CH                                                        
DELR_AUTH_SPECIAL,86,1,CH                                                       
DELR_AUTH_OPER,91,1,CH                                                          
DELR_AUTH_AUDIT,96,1,CH                                                         
DELR_AUTH_EXIT,101,1,CH                                                         
DELR_AUTH_FAILSFT,106,1,CH                                                      
DELR_AUTH_BYPASS,111,1,CH                                                       
DELR_AUTH_TRUSTED,116,1,CH                                                      
DELR_LOG_CLASS,121,1,CH                                                         
DELR_LOG_USER,126,1,CH                                                          
DELR_LOG_SPECIAL,131,1,CH                                                       
DELR_LOG_ACCESS,136,1,CH                                                        
DELR_LOG_RACINIT,141,1,CH                                                       
DELR_LOG_ALWAYS,146,1,CH                                                        
DELR_LOG_CMDVIOL,151,1,CH                                                       
DELR_LOG_GLOBAL,156,1,CH                                                        
DELR_TERM_LEVEL,161,3,CH                                                        
DELR_BACKOUT_FAIL,165,1,CH                                                      
DELR_PROF_SAME,170,1,CH                                                         
DELR_TERM,175,8,CH                                                              
DELR_JOB_NAME,184,8,CH                                                          
DELR_READ_TIME,193,8,CH                                                         
DELR_READ_DATE,202,10,CH                                                        
DELR_SMF_USER_ID,213,8,CH                                                       
DELR_LOG_LEVEL,222,1,CH                                                         
DELR_LOG_VMEVENT,227,1,CH                                                       
DELR_LOG_LOGOPT,232,1,CH                                                        
DELR_LOG_SECL,237,1,CH                                                          
DELR_LOG_COMPATM,242,1,CH                                                       
DELR_LOG_APPLAUD,247,1,CH                                                       
DELR_LOG_NONOMVS,252,1,CH                                                       
DELR_LOG_OMVSNPRV,257,1,CH                                                      
DELR_AUTH_OMVSSU,262,1,CH                                                       
DELR_AUTH_OMVSSYS,267,1,CH                                                      
DELR_USR_SECL,272,8,CH                                                          
DELR_RACF_VERSION,281,4,CH                                                      
DELR_RES_NAME,286,255,CH                                                        
DELR_LEVEL,542,3,CH                                                             
DELR_VOL,546,6,CH                                                               
DELR_CLASS,553,8,CH                                                             
DELR_OWN_ID,562,8,CH                                                            
DELR_LOGSTR,571,255,CH                                                          
DELR_USER_NAME,827,20,CH                                                        
DELR_UTK_ENCR,848,4,CH                                                          
DELR_UTK_PRE19,853,4,CH                                                         
DELR_UTK_VERPROF,858,4,CH                                                       
DELR_UTK_NJEUNUSR,863,4,CH                                                      
DELR_UTK_LOGUSR,868,4,CH                                                        
DELR_UTK_SPECIAL,873,4,CH                                                       
DELR_UTK_DEFAULT,878,4,CH                                                       
DELR_UTK_UNKNUSR,883,4,CH                                                       
DELR_UTK_ERROR,888,4,CH                                                         
DELR_UTK_TRUSTED,893,4,CH                                                       
DELR_UTK_SESSTYPE,898,8,CH                                                      
DELR_UTK_SURROGAT,907,4,CH                                                      
DELR_UTK_REMOTE,912,4,CH                                                        
DELR_UTK_PRIV,917,4,CH                                                          
DELR_UTK_SECL,922,8,CH                                                          
DELR_UTK_EXECNODE,931,8,CH                                                      
DELR_UTK_SUSER_ID,940,8,CH                                                      
DELR_UTK_SNODE,949,8,CH                                                         
DELR_UTK_SGRP_ID,958,8,CH                                                       
DELR_UTK_SPOE,967,8,CH                                                          
DELR_UTK_SPCLASS,976,8,CH                                                       
DELR_UTK_USER_ID,985,8,CH                                                       
DELR_UTK_GRP_ID,994,8,CH                                                        
DELR_UTK_DFT_GRP,1003,4,CH                                                      
DELR_UTK_DFT_SECL,1008,4,CH                                                     
DELR_APPC_LINK,1013,16,CH                                                       
DELR_SPECIFIED,1030,1024,CH                                                     
DELR_UTK_NETW,2055,8,CH                                                         
*------------------------------------------------*                              
*                     DELVOL                     *                              
*------------------------------------------------*                              
DELV_EVENT_TYPE,5,8,CH                                                          
DELV_EVENT_QUAL,14,8,CH                                                         
DELV_TIME_WRITTEN,23,8,CH                                                       
DELV_DATE_WRITTEN,32,10,CH                                                      
DELV_SYSTEM_SMFID,43,4,CH                                                       
DELV_VIOLATION,48,1,CH                                                          
DELV_USER_NDFND,53,1,CH                                                         
DELV_USER_WARNING,58,1,CH                                                       
DELV_EVT_USER_ID,63,8,CH                                                        
DELV_EVT_GRP_ID,72,8,CH                                                         
DELV_AUTH_NORMAL,81,1,CH                                                        
DELV_AUTH_SPECIAL,86,1,CH                                                       
DELV_AUTH_OPER,91,1,CH                                                          
DELV_AUTH_AUDIT,96,1,CH                                                         
DELV_AUTH_EXIT,101,1,CH                                                         
DELV_AUTH_FAILSFT,106,1,CH                                                      
DELV_AUTH_BYPASS,111,1,CH                                                       
DELV_AUTH_TRUSTED,116,1,CH                                                      
DELV_LOG_CLASS,121,1,CH                                                         
DELV_LOG_USER,126,1,CH                                                          
DELV_LOG_SPECIAL,131,1,CH                                                       
DELV_LOG_ACCESS,136,1,CH                                                        
DELV_LOG_RACINIT,141,1,CH                                                       
DELV_LOG_ALWAYS,146,1,CH                                                        
DELV_LOG_CMDVIOL,151,1,CH                                                       
DELV_LOG_GLOBAL,156,1,CH                                                        
DELV_TERM_LEVEL,161,3,CH                                                        
DELV_BACKOUT_FAIL,165,1,CH                                                      
DELV_PROF_SAME,170,1,CH                                                         
DELV_TERM,175,8,CH                                                              
DELV_JOB_NAME,184,8,CH                                                          
DELV_READ_TIME,193,8,CH                                                         
DELV_READ_DATE,202,10,CH                                                        
DELV_SMF_USER_ID,213,8,CH                                                       
DELV_LOG_LEVEL,222,1,CH                                                         
DELV_LOG_VMEVENT,227,1,CH                                                       
DELV_LOG_LOGOPT,232,1,CH                                                        
DELV_LOG_SECL,237,1,CH                                                          
DELV_LOG_COMPATM,242,1,CH                                                       
DELV_LOG_APPLAUD,247,1,CH                                                       
DELV_LOG_NONOMVS,252,1,CH                                                       
DELV_LOG_OMVSNPRV,257,1,CH                                                      
DELV_AUTH_OMVSSU,262,1,CH                                                       
DELV_AUTH_OMVSSYS,267,1,CH                                                      
DELV_USR_SECL,272,8,CH                                                          
DELV_RACF_VERSION,281,4,CH                                                      
DELV_RES_NAME,286,255,CH                                                        
DELV_LEVEL,542,3,CH                                                             
DELV_VOL,546,6,CH                                                               
DELV_CLASS,553,8,CH                                                             
DELV_OWN_ID,562,8,CH                                                            
DELV_LOGSTR,571,255,CH                                                          
DELV_USER_NAME,827,20,CH                                                        
DELV_UTK_ENCR,848,4,CH                                                          
DELV_UTK_PRE19,853,4,CH                                                         
DELV_UTK_VERPROF,858,4,CH                                                       
DELV_UTK_NJEUNUSR,863,4,CH                                                      
DELV_UTK_LOGUSR,868,4,CH                                                        
DELV_UTK_SPECIAL,873,4,CH                                                       
DELV_UTK_DEFAULT,878,4,CH                                                       
DELV_UTK_UNKNUSR,883,4,CH                                                       
DELV_UTK_ERROR,888,4,CH                                                         
DELV_UTK_TRUSTED,893,4,CH                                                       
DELV_UTK_SESSTYPE,898,8,CH                                                      
DELV_UTK_SURROGAT,907,4,CH                                                      
DELV_UTK_REMOTE,912,4,CH                                                        
DELV_UTK_PRIV,917,4,CH                                                          
DELV_UTK_SECL,922,8,CH                                                          
DELV_UTK_EXECNODE,931,8,CH                                                      
DELV_UTK_SUSER_ID,940,8,CH                                                      
DELV_UTK_SNODE,949,8,CH                                                         
DELV_UTK_SGRP_ID,958,8,CH                                                       
DELV_UTK_SPOE,967,8,CH                                                          
DELV_UTK_SPCLASS,976,8,CH                                                       
DELV_UTK_USER_ID,985,8,CH                                                       
DELV_UTK_GRP_ID,994,8,CH                                                        
DELV_UTK_DFT_GRP,1003,4,CH                                                      
DELV_UTK_DFT_SECL,1008,4,CH                                                     
DELV_APPC_LINK,1013,16,CH                                                       
DELV_SPECIFIED,1030,1024,CH                                                     
DELV_UTK_NETW,2055,8,CH                                                         
*------------------------------------------------*                              
*                     DEFINE                     *                              
*------------------------------------------------*                              
DEF_EVENT_TYPE,5,8,CH                                                           
DEF_EVENT_QUAL,14,8,CH                                                          
DEF_TIME_WRITTEN,23,8,CH                                                        
DEF_DATE_WRITTEN,32,10,CH                                                       
DEF_SYSTEM_SMFID,43,4,CH                                                        
DEF_VIOLATION,48,1,CH                                                           
DEF_USER_NDFND,53,1,CH                                                          
DEF_USER_WARNING,58,1,CH                                                        
DEF_EVT_USER_ID,63,8,CH                                                         
DEF_EVT_GRP_ID,72,8,CH                                                          
DEF_AUTH_NORMAL,81,1,CH                                                         
DEF_AUTH_SPECIAL,86,1,CH                                                        
DEF_AUTH_OPER,91,1,CH                                                           
DEF_AUTH_AUDIT,96,1,CH                                                          
DEF_AUTH_EXIT,101,1,CH                                                          
DEF_AUTH_FAILSFT,106,1,CH                                                       
DEF_AUTH_BYPASS,111,1,CH                                                        
DEF_AUTH_TRUSTED,116,1,CH                                                       
DEF_LOG_CLASS,121,1,CH                                                          
DEF_LOG_USER,126,1,CH                                                           
DEF_LOG_SPECIAL,131,1,CH                                                        
DEF_LOG_ACCESS,136,1,CH                                                         
DEF_LOG_RACINIT,141,1,CH                                                        
DEF_LOG_ALWAYS,146,1,CH                                                         
DEF_LOG_CMDVIOL,151,1,CH                                                        
DEF_LOG_GLOBAL,156,1,CH                                                         
DEF_TERM_LEVEL,161,3,CH                                                         
DEF_BACKOUT_FAIL,165,1,CH                                                       
DEF_PROF_SAME,170,1,CH                                                          
DEF_TERM,175,8,CH                                                               
DEF_JOB_NAME,184,8,CH                                                           
DEF_READ_TIME,193,8,CH                                                          
DEF_READ_DATE,202,10,CH                                                         
DEF_SMF_USER_ID,213,8,CH                                                        
DEF_LOG_LEVEL,222,1,CH                                                          
DEF_LOG_VMEVENT,227,1,CH                                                        
DEF_LOG_LOGOPT,232,1,CH                                                         
DEF_LOG_SECL,237,1,CH                                                           
DEF_LOG_COMPATM,242,1,CH                                                        
DEF_LOG_APPLAUD,247,1,CH                                                        
DEF_LOG_NONOMVS,252,1,CH                                                        
DEF_LOG_OMVSNPRV,257,1,CH                                                       
DEF_AUTH_OMVSSU,262,1,CH                                                        
DEF_AUTH_OMVSSYS,267,1,CH                                                       
DEF_USR_SECL,272,8,CH                                                           
DEF_RACF_VERSION,281,4,CH                                                       
DEF_RES_NAME,286,255,CH                                                         
DEF_LEVEL,542,3,CH                                                              
DEF_VOL,546,6,CH                                                                
DEF_CLASS,553,8,CH                                                              
DEF_MODEL_NAME,562,255,CH                                                       
DEF_MODEL_VOL,818,6,CH                                                          
DEF_OWN_ID,825,8,CH                                                             
DEF_LOGSTR,834,255,CH                                                           
DEF_USER_NAME,1090,20,CH                                                        
DEF_UTK_ENCR,1111,4,CH                                                          
DEF_UTK_PRE19,1116,4,CH                                                         
DEF_UTK_VERPROF,1121,4,CH                                                       
DEF_UTK_NJEUNUSR,1126,4,CH                                                      
DEF_UTK_LOGUSR,1131,4,CH                                                        
DEF_UTK_SPECIAL,1136,4,CH                                                       
DEF_UTK_DEFAULT,1141,4,CH                                                       
DEF_UTK_UNKNUSR,1146,4,CH                                                       
DEF_UTK_ERROR,1151,4,CH                                                         
DEF_UTK_TRUSTED,1156,4,CH                                                       
DEF_UTK_SESSTYPE,1161,8,CH                                                      
DEF_UTK_SURROGAT,1170,4,CH                                                      
DEF_UTK_REMOTE,1175,4,CH                                                        
DEF_UTK_PRIV,1180,4,CH                                                          
DEF_UTK_SECL,1185,8,CH                                                          
DEF_UTK_EXECNODE,1194,8,CH                                                      
DEF_UTK_SUSER_ID,1203,8,CH                                                      
DEF_UTK_SNODE,1212,8,CH                                                         
DEF_UTK_SGRP_ID,1221,8,CH                                                       
DEF_UTK_SPOE,1230,8,CH                                                          
DEF_UTK_SPCLASS,1239,8,CH                                                       
DEF_UTK_USER_ID,1248,8,CH                                                       
DEF_UTK_GRP_ID,1257,8,CH                                                        
DEF_UTK_DFT_GRP,1266,4,CH                                                       
DEF_UTK_DFT_SECL,1271,4,CH                                                      
DEF_APPC_LINK,1276,16,CH                                                        
DEF_SPECIFIED,1293,1024,CH                                                      
DEF_UTK_NETW,2318,8,CH                                                          
*------------------------------------------------*                              
*                     ADDSD                      *                              
*------------------------------------------------*                              
AD_EVENT_TYPE,5,8,CH                                                            
AD_EVENT_QUAL,14,8,CH                                                           
AD_TIME_WRITTEN,23,8,CH                                                         
AD_DATE_WRITTEN,32,10,CH                                                        
AD_SYSTEM_SMFID,43,4,CH                                                         
AD_VIOLATION,48,1,CH                                                            
AD_USER_NDFND,53,1,CH                                                           
AD_USER_WARNING,58,1,CH                                                         
AD_EVT_USER_ID,63,8,CH                                                          
AD_EVT_GRP_ID,72,8,CH                                                           
AD_AUTH_NORMAL,81,1,CH                                                          
AD_AUTH_SPECIAL,86,1,CH                                                         
AD_AUTH_OPER,91,1,CH                                                            
AD_AUTH_AUDIT,96,1,CH                                                           
AD_AUTH_EXIT,101,1,CH                                                           
AD_AUTH_FAILSFT,106,1,CH                                                        
AD_AUTH_BYPASS,111,1,CH                                                         
AD_AUTH_TRUSTED,116,1,CH                                                        
AD_LOG_CLASS,121,1,CH                                                           
AD_LOG_USER,126,1,CH                                                            
AD_LOG_SPECIAL,131,1,CH                                                         
AD_LOG_ACCESS,136,1,CH                                                          
AD_LOG_RACINIT,141,1,CH                                                         
AD_LOG_ALWAYS,146,1,CH                                                          
AD_LOG_CMDVIOL,151,1,CH                                                         
AD_LOG_GLOBAL,156,1,CH                                                          
AD_TERM_LEVEL,161,3,CH                                                          
AD_BACKOUT_FAIL,165,1,CH                                                        
AD_PROF_SAME,170,1,CH                                                           
AD_TERM,175,8,CH                                                                
AD_JOB_NAME,184,8,CH                                                            
AD_READ_TIME,193,8,CH                                                           
AD_READ_DATE,202,10,CH                                                          
AD_SMF_USER_ID,213,8,CH                                                         
AD_LOG_LEVEL,222,1,CH                                                           
AD_LOG_VMEVENT,227,1,CH                                                         
AD_LOG_LOGOPT,232,1,CH                                                          
AD_LOG_SECL,237,1,CH                                                            
AD_LOG_COMPATM,242,1,CH                                                         
AD_LOG_APPLAUD,247,1,CH                                                         
AD_LOG_NONOMVS,252,1,CH                                                         
AD_LOG_OMVSNPRV,257,1,CH                                                        
AD_AUTH_OMVSSU,262,1,CH                                                         
AD_AUTH_OMVSSYS,267,1,CH                                                        
AD_USR_SECL,272,8,CH                                                            
AD_RACF_VERSION,281,4,CH                                                        
AD_OWN_ID,286,8,CH                                                              
AD_USER_NAME,295,20,CH                                                          
AD_SECL,316,8,CH                                                                
AD_UTK_ENCR,325,4,CH                                                            
AD_UTK_PRE19,330,4,CH                                                           
AD_UTK_VERPROF,335,4,CH                                                         
AD_UTK_NJEUNUSR,340,4,CH                                                        
AD_UTK_LOGUSR,345,4,CH                                                          
AD_UTK_SPECIAL,350,4,CH                                                         
AD_UTK_DEFAULT,355,4,CH                                                         
AD_UTK_UNKNUSR,360,4,CH                                                         
AD_UTK_ERROR,365,4,CH                                                           
AD_UTK_TRUSTED,370,4,CH                                                         
AD_UTK_SESSTYPE,375,8,CH                                                        
AD_UTK_SURROGAT,384,4,CH                                                        
AD_UTK_REMOTE,389,4,CH                                                          
AD_UTK_PRIV,394,4,CH                                                            
AD_UTK_SECL,399,8,CH                                                            
AD_UTK_EXECNODE,408,8,CH                                                        
AD_UTK_SUSER_ID,417,8,CH                                                        
AD_UTK_SNODE,426,8,CH                                                           
AD_UTK_SGRP_ID,435,8,CH                                                         
AD_UTK_SPOE,444,8,CH                                                            
AD_UTK_SPCLASS,453,8,CH                                                         
AD_UTK_USER_ID,462,8,CH                                                         
AD_UTK_GRP_ID,471,8,CH                                                          
AD_UTK_DFT_GRP,480,4,CH                                                         
AD_UTK_DFT_SECL,485,4,CH                                                        
AD_APPC_LINK,490,16,CH                                                          
AD_SECL_LINK,507,16,CH                                                          
AD_DS_NAME,524,44,CH                                                            
AD_SPECIFIED,569,1024,CH                                                        
AD_FAILED,1594,1024,CH                                                          
AD_UTK_NETW,2619,8,CH                                                           
*------------------------------------------------*                              
*                    ADDGROUP                    *                              
*------------------------------------------------*                              
AG_EVENT_TYPE,5,8,CH                                                            
AG_EVENT_QUAL,14,8,CH                                                           
AG_TIME_WRITTEN,23,8,CH                                                         
AG_DATE_WRITTEN,32,10,CH                                                        
AG_SYSTEM_SMFID,43,4,CH                                                         
AG_VIOLATION,48,1,CH                                                            
AG_USER_NDFND,53,1,CH                                                           
AG_USER_WARNING,58,1,CH                                                         
AG_EVT_USER_ID,63,8,CH                                                          
AG_EVT_GRP_ID,72,8,CH                                                           
AG_AUTH_NORMAL,81,1,CH                                                          
AG_AUTH_SPECIAL,86,1,CH                                                         
AG_AUTH_OPER,91,1,CH                                                            
AG_AUTH_AUDIT,96,1,CH                                                           
AG_AUTH_EXIT,101,1,CH                                                           
AG_AUTH_FAILSFT,106,1,CH                                                        
AG_AUTH_BYPASS,111,1,CH                                                         
AG_AUTH_TRUSTED,116,1,CH                                                        
AG_LOG_CLASS,121,1,CH                                                           
AG_LOG_USER,126,1,CH                                                            
AG_LOG_SPECIAL,131,1,CH                                                         
AG_LOG_ACCESS,136,1,CH                                                          
AG_LOG_RACINIT,141,1,CH                                                         
AG_LOG_ALWAYS,146,1,CH                                                          
AG_LOG_CMDVIOL,151,1,CH                                                         
AG_LOG_GLOBAL,156,1,CH                                                          
AG_TERM_LEVEL,161,3,CH                                                          
AG_BACKOUT_FAIL,165,1,CH                                                        
AG_PROF_SAME,170,1,CH                                                           
AG_TERM,175,8,CH                                                                
AG_JOB_NAME,184,8,CH                                                            
AG_READ_TIME,193,8,CH                                                           
AG_READ_DATE,202,10,CH                                                          
AG_SMF_USER_ID,213,8,CH                                                         
AG_LOG_LEVEL,222,1,CH                                                           
AG_LOG_VMEVENT,227,1,CH                                                         
AG_LOG_LOGOPT,232,1,CH                                                          
AG_LOG_SECL,237,1,CH                                                            
AG_LOG_COMPATM,242,1,CH                                                         
AG_LOG_APPLAUD,247,1,CH                                                         
AG_LOG_NONOMVS,252,1,CH                                                         
AG_LOG_OMVSNPRV,257,1,CH                                                        
AG_AUTH_OMVSSU,262,1,CH                                                         
AG_AUTH_OMVSSYS,267,1,CH                                                        
AG_USR_SECL,272,8,CH                                                            
AG_RACF_VERSION,281,4,CH                                                        
AG_OWN_ID,286,8,CH                                                              
AG_USER_NAME,295,20,CH                                                          
AG_UTK_ENCR,316,4,CH                                                            
AG_UTK_PRE19,321,4,CH                                                           
AG_UTK_VERPROF,326,4,CH                                                         
AG_UTK_NJEUNUSR,331,4,CH                                                        
AG_UTK_LOGUSR,336,4,CH                                                          
AG_UTK_SPECIAL,341,4,CH                                                         
AG_UTK_DEFAULT,346,4,CH                                                         
AG_UTK_UNKNUSR,351,4,CH                                                         
AG_UTK_ERROR,356,4,CH                                                           
AG_UTK_TRUSTED,361,4,CH                                                         
AG_UTK_SESSTYPE,366,8,CH                                                        
AG_UTK_SURROGAT,375,4,CH                                                        
AG_UTK_REMOTE,380,4,CH                                                          
AG_UTK_PRIV,385,4,CH                                                            
AG_UTK_SECL,390,8,CH                                                            
AG_UTK_EXECNODE,399,8,CH                                                        
AG_UTK_SUSER_ID,408,8,CH                                                        
AG_UTK_SNODE,417,8,CH                                                           
AG_UTK_SGRP_ID,426,8,CH                                                         
AG_UTK_SPOE,435,8,CH                                                            
AG_UTK_SPCLASS,444,8,CH                                                         
AG_UTK_USER_ID,453,8,CH                                                         
AG_UTK_GRP_ID,462,8,CH                                                          
AG_UTK_DFT_GRP,471,4,CH                                                         
AG_UTK_DFT_SECL,476,4,CH                                                        
AG_APPC_LINK,481,16,CH                                                          
AG_GRP_ID,498,8,CH                                                              
AG_SPECIFIED,507,1024,CH                                                        
AG_FAILED,1532,1024,CH                                                          
AG_UTK_NETW,2557,8,CH                                                           
*------------------------------------------------*                              
*                    ADDUSER                     *                              
*------------------------------------------------*                              
AU_EVENT_TYPE,5,8,CH                                                            
AU_EVENT_QUAL,14,8,CH                                                           
AU_TIME_WRITTEN,23,8,CH                                                         
AU_DATE_WRITTEN,32,10,CH                                                        
AU_SYSTEM_SMFID,43,4,CH                                                         
AU_VIOLATION,48,1,CH                                                            
AU_USER_NDFND,53,1,CH                                                           
AU_USER_WARNING,58,1,CH                                                         
AU_EVT_USER_ID,63,8,CH                                                          
AU_EVT_GRP_ID,72,8,CH                                                           
AU_AUTH_NORMAL,81,1,CH                                                          
AU_AUTH_SPECIAL,86,1,CH                                                         
AU_AUTH_OPER,91,1,CH                                                            
AU_AUTH_AUDIT,96,1,CH                                                           
AU_AUTH_EXIT,101,1,CH                                                           
AU_AUTH_FAILSFT,106,1,CH                                                        
AU_AUTH_BYPASS,111,1,CH                                                         
AU_AUTH_TRUSTED,116,1,CH                                                        
AU_LOG_CLASS,121,1,CH                                                           
AU_LOG_USER,126,1,CH                                                            
AU_LOG_SPECIAL,131,1,CH                                                         
AU_LOG_ACCESS,136,1,CH                                                          
AU_LOG_RACINIT,141,1,CH                                                         
AU_LOG_ALWAYS,146,1,CH                                                          
AU_LOG_CMDVIOL,151,1,CH                                                         
AU_LOG_GLOBAL,156,1,CH                                                          
AU_TERM_LEVEL,161,3,CH                                                          
AU_BACKOUT_FAIL,165,1,CH                                                        
AU_PROF_SAME,170,1,CH                                                           
AU_TERM,175,8,CH                                                                
AU_JOB_NAME,184,8,CH                                                            
AU_READ_TIME,193,8,CH                                                           
AU_READ_DATE,202,10,CH                                                          
AU_SMF_USER_ID,213,8,CH                                                         
AU_LOG_LEVEL,222,1,CH                                                           
AU_LOG_VMEVENT,227,1,CH                                                         
AU_LOG_LOGOPT,232,1,CH                                                          
AU_LOG_SECL,237,1,CH                                                            
AU_LOG_COMPATM,242,1,CH                                                         
AU_LOG_APPLAUD,247,1,CH                                                         
AU_LOG_NONOMVS,252,1,CH                                                         
AU_LOG_OMVSNPRV,257,1,CH                                                        
AU_AUTH_OMVSSU,262,1,CH                                                         
AU_AUTH_OMVSSYS,267,1,CH                                                        
AU_USR_SECL,272,8,CH                                                            
AU_RACF_VERSION,281,4,CH                                                        
AU_OWN_ID,286,8,CH                                                              
AU_USER_NAME,295,20,CH                                                          
AU_UTK_ENCR,316,4,CH                                                            
AU_UTK_PRE19,321,4,CH                                                           
AU_UTK_VERPROF,326,4,CH                                                         
AU_UTK_NJEUNUSR,331,4,CH                                                        
AU_UTK_LOGUSR,336,4,CH                                                          
AU_UTK_SPECIAL,341,4,CH                                                         
AU_UTK_DEFAULT,346,4,CH                                                         
AU_UTK_UNKNUSR,351,4,CH                                                         
AU_UTK_ERROR,356,4,CH                                                           
AU_UTK_TRUSTED,361,4,CH                                                         
AU_UTK_SESSTYPE,366,8,CH                                                        
AU_UTK_SURROGAT,375,4,CH                                                        
AU_UTK_REMOTE,380,4,CH                                                          
AU_UTK_PRIV,385,4,CH                                                            
AU_UTK_SECL,390,8,CH                                                            
AU_UTK_EXECNODE,399,8,CH                                                        
AU_UTK_SUSER_ID,408,8,CH                                                        
AU_UTK_SNODE,417,8,CH                                                           
AU_UTK_SGRP_ID,426,8,CH                                                         
AU_UTK_SPOE,435,8,CH                                                            
AU_UTK_SPCLASS,444,8,CH                                                         
AU_UTK_USER_ID,453,8,CH                                                         
AU_UTK_GRP_ID,462,8,CH                                                          
AU_UTK_DFT_GRP,471,4,CH                                                         
AU_UTK_DFT_SECL,476,4,CH                                                        
AU_APPC_LINK,481,16,CH                                                          
AU_NOAUTH_CLAUTH,498,4,CH                                                       
AU_NOAUTH_GROUP,503,4,CH                                                        
AU_USER_ID,508,8,CH                                                             
AU_SPECIFIED,517,1024,CH                                                        
AU_FAILED,1542,1024,CH                                                          
AU_IGNORED,2567,1024,CH                                                         
AU_UTK_NETW,3592,8,CH                                                           
*------------------------------------------------*                              
*                     ALTDSD                     *                              
*------------------------------------------------*                              
ALD_EVENT_TYPE,5,8,CH                                                           
ALD_EVENT_QUAL,14,8,CH                                                          
ALD_TIME_WRITTEN,23,8,CH                                                        
ALD_DATE_WRITTEN,32,10,CH                                                       
ALD_SYSTEM_SMFID,43,4,CH                                                        
ALD_VIOLATION,48,1,CH                                                           
ALD_USER_NDFND,53,1,CH                                                          
ALD_USER_WARNING,58,1,CH                                                        
ALD_EVT_USER_ID,63,8,CH                                                         
ALD_EVT_GRP_ID,72,8,CH                                                          
ALD_AUTH_NORMAL,81,1,CH                                                         
ALD_AUTH_SPECIAL,86,1,CH                                                        
ALD_AUTH_OPER,91,1,CH                                                           
ALD_AUTH_AUDIT,96,1,CH                                                          
ALD_AUTH_EXIT,101,1,CH                                                          
ALD_AUTH_FAILSFT,106,1,CH                                                       
ALD_AUTH_BYPASS,111,1,CH                                                        
ALD_AUTH_TRUSTED,116,1,CH                                                       
ALD_LOG_CLASS,121,1,CH                                                          
ALD_LOG_USER,126,1,CH                                                           
ALD_LOG_SPECIAL,131,1,CH                                                        
ALD_LOG_ACCESS,136,1,CH                                                         
ALD_LOG_RACINIT,141,1,CH                                                        
ALD_LOG_ALWAYS,146,1,CH                                                         
ALD_LOG_CMDVIOL,151,1,CH                                                        
ALD_LOG_GLOBAL,156,1,CH                                                         
ALD_TERM_LEVEL,161,3,CH                                                         
ALD_BACKOUT_FAIL,165,1,CH                                                       
ALD_PROF_SAME,170,1,CH                                                          
ALD_TERM,175,8,CH                                                               
ALD_JOB_NAME,184,8,CH                                                           
ALD_READ_TIME,193,8,CH                                                          
ALD_READ_DATE,202,10,CH                                                         
ALD_SMF_USER_ID,213,8,CH                                                        
ALD_LOG_LEVEL,222,1,CH                                                          
ALD_LOG_VMEVENT,227,1,CH                                                        
ALD_LOG_LOGOPT,232,1,CH                                                         
ALD_LOG_SECL,237,1,CH                                                           
ALD_LOG_COMPATM,242,1,CH                                                        
ALD_LOG_APPLAUD,247,1,CH                                                        
ALD_LOG_NONOMVS,252,1,CH                                                        
ALD_LOG_OMVSNPRV,257,1,CH                                                       
ALD_AUTH_OMVSSU,262,1,CH                                                        
ALD_AUTH_OMVSSYS,267,1,CH                                                       
ALD_USR_SECL,272,8,CH                                                           
ALD_RACF_VERSION,281,4,CH                                                       
ALD_OWN_ID,286,8,CH                                                             
ALD_USER_NAME,295,20,CH                                                         
ALD_OLD_SECL,316,8,CH                                                           
ALD_UTK_ENCR,325,4,CH                                                           
ALD_UTK_PRE19,330,4,CH                                                          
ALD_UTK_VERPROF,335,4,CH                                                        
ALD_UTK_NJEUNUSR,340,4,CH                                                       
ALD_UTK_LOGUSR,345,4,CH                                                         
ALD_UTK_SPECIAL,350,4,CH                                                        
ALD_UTK_DEFAULT,355,4,CH                                                        
ALD_UTK_UNKNUSR,360,4,CH                                                        
ALD_UTK_ERROR,365,4,CH                                                          
ALD_UTK_TRUSTED,370,4,CH                                                        
ALD_UTK_SESSTYPE,375,8,CH                                                       
ALD_UTK_SURROGAT,384,4,CH                                                       
ALD_UTK_REMOTE,389,4,CH                                                         
ALD_UTK_PRIV,394,4,CH                                                           
ALD_UTK_SECL,399,8,CH                                                           
ALD_UTK_EXECNODE,408,8,CH                                                       
ALD_UTK_SUSER_ID,417,8,CH                                                       
ALD_UTK_SNODE,426,8,CH                                                          
ALD_UTK_SGRP_ID,435,8,CH                                                        
ALD_UTK_SPOE,444,8,CH                                                           
ALD_UTK_SPCLASS,453,8,CH                                                        
ALD_UTK_USER_ID,462,8,CH                                                        
ALD_UTK_GRP_ID,471,8,CH                                                         
ALD_UTK_DFT_GRP,480,4,CH                                                        
ALD_UTK_DFT_SECL,485,4,CH                                                       
ALD_APPC_LINK,490,16,CH                                                         
ALD_SECL_LINK,507,16,CH                                                         
ALD_DS_NAME,524,44,CH                                                           
ALD_SPECIFIED,569,1024,CH                                                       
ALD_FAILED,1594,1024,CH                                                         
ALD_IGNORED,2619,1024,CH                                                        
ALD_UTK_NETW,3644,8,CH                                                          
*------------------------------------------------*                              
*                    ALTGROUP                    *                              
*------------------------------------------------*                              
ALG_EVENT_TYPE,5,8,CH                                                           
ALG_EVENT_QUAL,14,8,CH                                                          
ALG_TIME_WRITTEN,23,8,CH                                                        
ALG_DATE_WRITTEN,32,10,CH                                                       
ALG_SYSTEM_SMFID,43,4,CH                                                        
ALG_VIOLATION,48,1,CH                                                           
ALG_USER_NDFND,53,1,CH                                                          
ALG_USER_WARNING,58,1,CH                                                        
ALG_EVT_USER_ID,63,8,CH                                                         
ALG_EVT_GRP_ID,72,8,CH                                                          
ALG_AUTH_NORMAL,81,1,CH                                                         
ALG_AUTH_SPECIAL,86,1,CH                                                        
ALG_AUTH_OPER,91,1,CH                                                           
ALG_AUTH_AUDIT,96,1,CH                                                          
ALG_AUTH_EXIT,101,1,CH                                                          
ALG_AUTH_FAILSFT,106,1,CH                                                       
ALG_AUTH_BYPASS,111,1,CH                                                        
ALG_AUTH_TRUSTED,116,1,CH                                                       
ALG_LOG_CLASS,121,1,CH                                                          
ALG_LOG_USER,126,1,CH                                                           
ALG_LOG_SPECIAL,131,1,CH                                                        
ALG_LOG_ACCESS,136,1,CH                                                         
ALG_LOG_RACINIT,141,1,CH                                                        
ALG_LOG_ALWAYS,146,1,CH                                                         
ALG_LOG_CMDVIOL,151,1,CH                                                        
ALG_LOG_GLOBAL,156,1,CH                                                         
ALG_TERM_LEVEL,161,3,CH                                                         
ALG_BACKOUT_FAIL,165,1,CH                                                       
ALG_PROF_SAME,170,1,CH                                                          
ALG_TERM,175,8,CH                                                               
ALG_JOB_NAME,184,8,CH                                                           
ALG_READ_TIME,193,8,CH                                                          
ALG_READ_DATE,202,10,CH                                                         
ALG_SMF_USER_ID,213,8,CH                                                        
ALG_LOG_LEVEL,222,1,CH                                                          
ALG_LOG_VMEVENT,227,1,CH                                                        
ALG_LOG_LOGOPT,232,1,CH                                                         
ALG_LOG_SECL,237,1,CH                                                           
ALG_LOG_COMPATM,242,1,CH                                                        
ALG_LOG_APPLAUD,247,1,CH                                                        
ALG_LOG_NONOMVS,252,1,CH                                                        
ALG_LOG_OMVSNPRV,257,1,CH                                                       
ALG_AUTH_OMVSSU,262,1,CH                                                        
ALG_AUTH_OMVSSYS,267,1,CH                                                       
ALG_USR_SECL,272,8,CH                                                           
ALG_RACF_VERSION,281,4,CH                                                       
ALG_OWN_ID,286,8,CH                                                             
ALG_USER_NAME,295,20,CH                                                         
ALG_UTK_ENCR,316,4,CH                                                           
ALG_UTK_PRE19,321,4,CH                                                          
ALG_UTK_VERPROF,326,4,CH                                                        
ALG_UTK_NJEUNUSR,331,4,CH                                                       
ALG_UTK_LOGUSR,336,4,CH                                                         
ALG_UTK_SPECIAL,341,4,CH                                                        
ALG_UTK_DEFAULT,346,4,CH                                                        
ALG_UTK_UNKNUSR,351,4,CH                                                        
ALG_UTK_ERROR,356,4,CH                                                          
ALG_UTK_TRUSTED,361,4,CH                                                        
ALG_UTK_SESSTYPE,366,8,CH                                                       
ALG_UTK_SURROGAT,375,4,CH                                                       
ALG_UTK_REMOTE,380,4,CH                                                         
ALG_UTK_PRIV,385,4,CH                                                           
ALG_UTK_SECL,390,8,CH                                                           
ALG_UTK_EXECNODE,399,8,CH                                                       
ALG_UTK_SUSER_ID,408,8,CH                                                       
ALG_UTK_SNODE,417,8,CH                                                          
ALG_UTK_SGRP_ID,426,8,CH                                                        
ALG_UTK_SPOE,435,8,CH                                                           
ALG_UTK_SPCLASS,444,8,CH                                                        
ALG_UTK_USER_ID,453,8,CH                                                        
ALG_UTK_GRP_ID,462,8,CH                                                         
ALG_UTK_DFT_GRP,471,4,CH                                                        
ALG_UTK_DFT_SECL,476,4,CH                                                       
ALG_APPC_LINK,481,16,CH                                                         
ALG_GRP_ID,498,8,CH                                                             
ALG_SPECIFIED,507,1024,CH                                                       
ALG_FAILED,1532,1024,CH                                                         
ALG_IGNORED,2557,1024,CH                                                        
ALG_UTK_NETW,3582,8,CH                                                          
*------------------------------------------------*                              
*                    ALTUSER                     *                              
*------------------------------------------------*                              
ALU_EVENT_TYPE,5,8,CH                                                           
ALU_EVENT_QUAL,14,8,CH                                                          
ALU_TIME_WRITTEN,23,8,CH                                                        
ALU_DATE_WRITTEN,32,10,CH                                                       
ALU_SYSTEM_SMFID,43,4,CH                                                        
ALU_VIOLATION,48,1,CH                                                           
ALU_USER_NDFND,53,1,CH                                                          
ALU_USER_WARNING,58,1,CH                                                        
ALU_EVT_USER_ID,63,8,CH                                                         
ALU_EVT_GRP_ID,72,8,CH                                                          
ALU_AUTH_NORMAL,81,1,CH                                                         
ALU_AUTH_SPECIAL,86,1,CH                                                        
ALU_AUTH_OPER,91,1,CH                                                           
ALU_AUTH_AUDIT,96,1,CH                                                          
ALU_AUTH_EXIT,101,1,CH                                                          
ALU_AUTH_FAILSFT,106,1,CH                                                       
ALU_AUTH_BYPASS,111,1,CH                                                        
ALU_AUTH_TRUSTED,116,1,CH                                                       
ALU_LOG_CLASS,121,1,CH                                                          
ALU_LOG_USER,126,1,CH                                                           
ALU_LOG_SPECIAL,131,1,CH                                                        
ALU_LOG_ACCESS,136,1,CH                                                         
ALU_LOG_RACINIT,141,1,CH                                                        
ALU_LOG_ALWAYS,146,1,CH                                                         
ALU_LOG_CMDVIOL,151,1,CH                                                        
ALU_LOG_GLOBAL,156,1,CH                                                         
ALU_TERM_LEVEL,161,3,CH                                                         
ALU_BACKOUT_FAIL,165,1,CH                                                       
ALU_PROF_SAME,170,1,CH                                                          
ALU_TERM,175,8,CH                                                               
ALU_JOB_NAME,184,8,CH                                                           
ALU_READ_TIME,193,8,CH                                                          
ALU_READ_DATE,202,10,CH                                                         
ALU_SMF_USER_ID,213,8,CH                                                        
ALU_LOG_LEVEL,222,1,CH                                                          
ALU_LOG_VMEVENT,227,1,CH                                                        
ALU_LOG_LOGOPT,232,1,CH                                                         
ALU_LOG_SECL,237,1,CH                                                           
ALU_LOG_COMPATM,242,1,CH                                                        
ALU_LOG_APPLAUD,247,1,CH                                                        
ALU_LOG_NONOMVS,252,1,CH                                                        
ALU_LOG_OMVSNPRV,257,1,CH                                                       
ALU_AUTH_OMVSSU,262,1,CH                                                        
ALU_AUTH_OMVSSYS,267,1,CH                                                       
ALU_USR_SECL,272,8,CH                                                           
ALU_RACF_VERSION,281,4,CH                                                       
ALU_OWN_ID,286,8,CH                                                             
ALU_USER_NAME,295,20,CH                                                         
ALU_OLD_SECL,316,8,CH                                                           
ALU_UTK_ENCR,325,4,CH                                                           
ALU_UTK_PRE19,330,4,CH                                                          
ALU_UTK_VERPROF,335,4,CH                                                        
ALU_UTK_NJEUNUSR,340,4,CH                                                       
ALU_UTK_LOGUSR,345,4,CH                                                         
ALU_UTK_SPECIAL,350,4,CH                                                        
ALU_UTK_DEFAULT,355,4,CH                                                        
ALU_UTK_UNKNUSR,360,4,CH                                                        
ALU_UTK_ERROR,365,4,CH                                                          
ALU_UTK_TRUSTED,370,4,CH                                                        
ALU_UTK_SESSTYPE,375,8,CH                                                       
ALU_UTK_SURROGAT,384,4,CH                                                       
ALU_UTK_REMOTE,389,4,CH                                                         
ALU_UTK_PRIV,394,4,CH                                                           
ALU_UTK_SECL,399,8,CH                                                           
ALU_UTK_EXECNODE,408,8,CH                                                       
ALU_UTK_SUSER_ID,417,8,CH                                                       
ALU_UTK_SNODE,426,8,CH                                                          
ALU_UTK_SGRP_ID,435,8,CH                                                        
ALU_UTK_SPOE,444,8,CH                                                           
ALU_UTK_SPCLASS,453,8,CH                                                        
ALU_UTK_USER_ID,462,8,CH                                                        
ALU_UTK_GRP_ID,471,8,CH                                                         
ALU_UTK_DFT_GRP,480,4,CH                                                        
ALU_UTK_DFT_SECL,485,4,CH                                                       
ALU_APPC_LINK,490,16,CH                                                         
ALU_NOAUTH_CLAUTH,507,4,CH                                                      
ALU_NOAUTH_GROUP,512,4,CH                                                       
ALU_NOAUTH_PROF,517,4,CH                                                        
ALU_USER_ID,522,8,CH                                                            
ALU_SPECIFIED,531,1024,CH                                                       
ALU_FAILED,1556,1024,CH                                                         
ALU_IGNORED,2581,1024,CH                                                        
ALU_UTK_NETW,3606,8,CH                                                          
*------------------------------------------------*                              
*                    CONNECT                     *                              
*------------------------------------------------*                              
CON_EVENT_TYPE,5,8,CH                                                           
CON_EVENT_QUAL,14,8,CH                                                          
CON_TIME_WRITTEN,23,8,CH                                                        
CON_DATE_WRITTEN,32,10,CH                                                       
CON_SYSTEM_SMFID,43,4,CH                                                        
CON_VIOLATION,48,1,CH                                                           
CON_USER_NDFND,53,1,CH                                                          
CON_USER_WARNING,58,1,CH                                                        
CON_EVT_USER_ID,63,8,CH                                                         
CON_EVT_GRP_ID,72,8,CH                                                          
CON_AUTH_NORMAL,81,1,CH                                                         
CON_AUTH_SPECIAL,86,1,CH                                                        
CON_AUTH_OPER,91,1,CH                                                           
CON_AUTH_AUDIT,96,1,CH                                                          
CON_AUTH_EXIT,101,1,CH                                                          
CON_AUTH_FAILSFT,106,1,CH                                                       
CON_AUTH_BYPASS,111,1,CH                                                        
CON_AUTH_TRUSTED,116,1,CH                                                       
CON_LOG_CLASS,121,1,CH                                                          
CON_LOG_USER,126,1,CH                                                           
CON_LOG_SPECIAL,131,1,CH                                                        
CON_LOG_ACCESS,136,1,CH                                                         
CON_LOG_RACINIT,141,1,CH                                                        
CON_LOG_ALWAYS,146,1,CH                                                         
CON_LOG_CMDVIOL,151,1,CH                                                        
CON_LOG_GLOBAL,156,1,CH                                                         
CON_TERM_LEVEL,161,3,CH                                                         
CON_BACKOUT_FAIL,165,1,CH                                                       
CON_PROF_SAME,170,1,CH                                                          
CON_TERM,175,8,CH                                                               
CON_JOB_NAME,184,8,CH                                                           
CON_READ_TIME,193,8,CH                                                          
CON_READ_DATE,202,10,CH                                                         
CON_SMF_USER_ID,213,8,CH                                                        
CON_LOG_LEVEL,222,1,CH                                                          
CON_LOG_VMEVENT,227,1,CH                                                        
CON_LOG_LOGOPT,232,1,CH                                                         
CON_LOG_SECL,237,1,CH                                                           
CON_LOG_COMPATM,242,1,CH                                                        
CON_LOG_APPLAUD,247,1,CH                                                        
CON_LOG_NONOMVS,252,1,CH                                                        
CON_LOG_OMVSNPRV,257,1,CH                                                       
CON_AUTH_OMVSSU,262,1,CH                                                        
CON_AUTH_OMVSSYS,267,1,CH                                                       
CON_USR_SECL,272,8,CH                                                           
CON_RACF_VERSION,281,4,CH                                                       
CON_OWN_ID,286,8,CH                                                             
CON_USER_NAME,295,20,CH                                                         
CON_UTK_ENCR,316,4,CH                                                           
CON_UTK_PRE19,321,4,CH                                                          
CON_UTK_VERPROF,326,4,CH                                                        
CON_UTK_NJEUNUSR,331,4,CH                                                       
CON_UTK_LOGUSR,336,4,CH                                                         
CON_UTK_SPECIAL,341,4,CH                                                        
CON_UTK_DEFAULT,346,4,CH                                                        
CON_UTK_UNKNUSR,351,4,CH                                                        
CON_UTK_ERROR,356,4,CH                                                          
CON_UTK_TRUSTED,361,4,CH                                                        
CON_UTK_SESSTYPE,366,8,CH                                                       
CON_UTK_SURROGAT,375,4,CH                                                       
CON_UTK_REMOTE,380,4,CH                                                         
CON_UTK_PRIV,385,4,CH                                                           
CON_UTK_SECL,390,8,CH                                                           
CON_UTK_EXECNODE,399,8,CH                                                       
CON_UTK_SUSER_ID,408,8,CH                                                       
CON_UTK_SNODE,417,8,CH                                                          
CON_UTK_SGRP_ID,426,8,CH                                                        
CON_UTK_SPOE,435,8,CH                                                           
CON_UTK_SPCLASS,444,8,CH                                                        
CON_UTK_USER_ID,453,8,CH                                                        
CON_UTK_GRP_ID,462,8,CH                                                         
CON_UTK_DFT_GRP,471,4,CH                                                        
CON_UTK_DFT_SECL,476,4,CH                                                       
CON_APPC_LINK,481,16,CH                                                         
CON_USER_ID,498,8,CH                                                            
CON_SPECIFIED,507,1024,CH                                                       
CON_FAILED,1532,1024,CH                                                         
CON_UTK_NETW,2557,8,CH                                                          
*------------------------------------------------*                              
*                     DELDSD                     *                              
*------------------------------------------------*                              
DELD_EVENT_TYPE,5,8,CH                                                          
DELD_EVENT_QUAL,14,8,CH                                                         
DELD_TIME_WRITTEN,23,8,CH                                                       
DELD_DATE_WRITTEN,32,10,CH                                                      
DELD_SYSTEM_SMFID,43,4,CH                                                       
DELD_VIOLATION,48,1,CH                                                          
DELD_USER_NDFND,53,1,CH                                                         
DELD_USER_WARNING,58,1,CH                                                       
DELD_EVT_USER_ID,63,8,CH                                                        
DELD_EVT_GRP_ID,72,8,CH                                                         
DELD_AUTH_NORMAL,81,1,CH                                                        
DELD_AUTH_SPECIAL,86,1,CH                                                       
DELD_AUTH_OPER,91,1,CH                                                          
DELD_AUTH_AUDIT,96,1,CH                                                         
DELD_AUTH_EXIT,101,1,CH                                                         
DELD_AUTH_FAILSFT,106,1,CH                                                      
DELD_AUTH_BYPASS,111,1,CH                                                       
DELD_AUTH_TRUSTED,116,1,CH                                                      
DELD_LOG_CLASS,121,1,CH                                                         
DELD_LOG_USER,126,1,CH                                                          
DELD_LOG_SPECIAL,131,1,CH                                                       
DELD_LOG_ACCESS,136,1,CH                                                        
DELD_LOG_RACINIT,141,1,CH                                                       
DELD_LOG_ALWAYS,146,1,CH                                                        
DELD_LOG_CMDVIOL,151,1,CH                                                       
DELD_LOG_GLOBAL,156,1,CH                                                        
DELD_TERM_LEVEL,161,3,CH                                                        
DELD_BACKOUT_FAIL,165,1,CH                                                      
DELD_PROF_SAME,170,1,CH                                                         
DELD_TERM,175,8,CH                                                              
DELD_JOB_NAME,184,8,CH                                                          
DELD_READ_TIME,193,8,CH                                                         
DELD_READ_DATE,202,10,CH                                                        
DELD_SMF_USER_ID,213,8,CH                                                       
DELD_LOG_LEVEL,222,1,CH                                                         
DELD_LOG_VMEVENT,227,1,CH                                                       
DELD_LOG_LOGOPT,232,1,CH                                                        
DELD_LOG_SECL,237,1,CH                                                          
DELD_LOG_COMPATM,242,1,CH                                                       
DELD_LOG_APPLAUD,247,1,CH                                                       
DELD_LOG_NONOMVS,252,1,CH                                                       
DELD_LOG_OMVSNPRV,257,1,CH                                                      
DELD_AUTH_OMVSSU,262,1,CH                                                       
DELD_AUTH_OMVSSYS,267,1,CH                                                      
DELD_USR_SECL,272,8,CH                                                          
DELD_RACF_VERSION,281,4,CH                                                      
DELD_OWN_ID,286,8,CH                                                            
DELD_USER_NAME,295,20,CH                                                        
DELD_OLD_SECL,316,8,CH                                                          
DELD_UTK_ENCR,325,4,CH                                                          
DELD_UTK_PRE19,330,4,CH                                                         
DELD_UTK_VERPROF,335,4,CH                                                       
DELD_UTK_NJEUNUSR,340,4,CH                                                      
DELD_UTK_LOGUSR,345,4,CH                                                        
DELD_UTK_SPECIAL,350,4,CH                                                       
DELD_UTK_DEFAULT,355,4,CH                                                       
DELD_UTK_UNKNUSR,360,4,CH                                                       
DELD_UTK_ERROR,365,4,CH                                                         
DELD_UTK_TRUSTED,370,4,CH                                                       
DELD_UTK_SESSTYPE,375,8,CH                                                      
DELD_UTK_SURROGAT,384,4,CH                                                      
DELD_UTK_REMOTE,389,4,CH                                                        
DELD_UTK_PRIV,394,4,CH                                                          
DELD_UTK_SECL,399,8,CH                                                          
DELD_UTK_EXECNODE,408,8,CH                                                      
DELD_UTK_SUSER_ID,417,8,CH                                                      
DELD_UTK_SNODE,426,8,CH                                                         
DELD_UTK_SGRP_ID,435,8,CH                                                       
DELD_UTK_SPOE,444,8,CH                                                          
DELD_UTK_SPCLASS,453,8,CH                                                       
DELD_UTK_USER_ID,462,8,CH                                                       
DELD_UTK_GRP_ID,471,8,CH                                                        
DELD_UTK_DFT_GRP,480,4,CH                                                       
DELD_UTK_DFT_SECL,485,4,CH                                                      
DELD_APPC_LINK,490,16,CH                                                        
DELD_SECL_LINK,507,16,CH                                                        
DELD_DS_NAME,524,44,CH                                                          
DELD_SPECIFIED,569,1024,CH                                                      
DELD_FAILED,1594,1024,CH                                                        
DELD_UTK_NETW,2619,8,CH                                                         
*------------------------------------------------*                              
*                    DELGROUP                    *                              
*------------------------------------------------*                              
DELG_EVENT_TYPE,5,8,CH                                                          
DELG_EVENT_QUAL,14,8,CH                                                         
DELG_TIME_WRITTEN,23,8,CH                                                       
DELG_DATE_WRITTEN,32,10,CH                                                      
DELG_SYSTEM_SMFID,43,4,CH                                                       
DELG_VIOLATION,48,1,CH                                                          
DELG_USER_NDFND,53,1,CH                                                         
DELG_USER_WARNING,58,1,CH                                                       
DELG_EVT_USER_ID,63,8,CH                                                        
DELG_EVT_GRP_ID,72,8,CH                                                         
DELG_AUTH_NORMAL,81,1,CH                                                        
DELG_AUTH_SPECIAL,86,1,CH                                                       
DELG_AUTH_OPER,91,1,CH                                                          
DELG_AUTH_AUDIT,96,1,CH                                                         
DELG_AUTH_EXIT,101,1,CH                                                         
DELG_AUTH_FAILSFT,106,1,CH                                                      
DELG_AUTH_BYPASS,111,1,CH                                                       
DELG_AUTH_TRUSTED,116,1,CH                                                      
DELG_LOG_CLASS,121,1,CH                                                         
DELG_LOG_USER,126,1,CH                                                          
DELG_LOG_SPECIAL,131,1,CH                                                       
DELG_LOG_ACCESS,136,1,CH                                                        
DELG_LOG_RACINIT,141,1,CH                                                       
DELG_LOG_ALWAYS,146,1,CH                                                        
DELG_LOG_CMDVIOL,151,1,CH                                                       
DELG_LOG_GLOBAL,156,1,CH                                                        
DELG_TERM_LEVEL,161,3,CH                                                        
DELG_BACKOUT_FAIL,165,1,CH                                                      
DELG_PROF_SAME,170,1,CH                                                         
DELG_TERM,175,8,CH                                                              
DELG_JOB_NAME,184,8,CH                                                          
DELG_READ_TIME,193,8,CH                                                         
DELG_READ_DATE,202,10,CH                                                        
DELG_SMF_USER_ID,213,8,CH                                                       
DELG_LOG_LEVEL,222,1,CH                                                         
DELG_LOG_VMEVENT,227,1,CH                                                       
DELG_LOG_LOGOPT,232,1,CH                                                        
DELG_LOG_SECL,237,1,CH                                                          
DELG_LOG_COMPATM,242,1,CH                                                       
DELG_LOG_APPLAUD,247,1,CH                                                       
DELG_LOG_NONOMVS,252,1,CH                                                       
DELG_LOG_OMVSNPRV,257,1,CH                                                      
DELG_AUTH_OMVSSU,262,1,CH                                                       
DELG_AUTH_OMVSSYS,267,1,CH                                                      
DELG_USR_SECL,272,8,CH                                                          
DELG_RACF_VERSION,281,4,CH                                                      
DELG_OWN_ID,286,8,CH                                                            
DELG_USER_NAME,295,20,CH                                                        
DELG_UTK_ENCR,316,4,CH                                                          
DELG_UTK_PRE19,321,4,CH                                                         
DELG_UTK_VERPROF,326,4,CH                                                       
DELG_UTK_NJEUNUSR,331,4,CH                                                      
DELG_UTK_LOGUSR,336,4,CH                                                        
DELG_UTK_SPECIAL,341,4,CH                                                       
DELG_UTK_DEFAULT,346,4,CH                                                       
DELG_UTK_UNKNUSR,351,4,CH                                                       
DELG_UTK_ERROR,356,4,CH                                                         
DELG_UTK_TRUSTED,361,4,CH                                                       
DELG_UTK_SESSTYPE,366,8,CH                                                      
DELG_UTK_SURROGAT,375,4,CH                                                      
DELG_UTK_REMOTE,380,4,CH                                                        
DELG_UTK_PRIV,385,4,CH                                                          
DELG_UTK_SECL,390,8,CH                                                          
DELG_UTK_EXECNODE,399,8,CH                                                      
DELG_UTK_SUSER_ID,408,8,CH                                                      
DELG_UTK_SNODE,417,8,CH                                                         
DELG_UTK_SGRP_ID,426,8,CH                                                       
DELG_UTK_SPOE,435,8,CH                                                          
DELG_UTK_SPCLASS,444,8,CH                                                       
DELG_UTK_USER_ID,453,8,CH                                                       
DELG_UTK_GRP_ID,462,8,CH                                                        
DELG_UTK_DFT_GRP,471,4,CH                                                       
DELG_UTK_DFT_SECL,476,4,CH                                                      
DELG_APPC_LINK,481,16,CH                                                        
DELG_GRP_ID,498,8,CH                                                            
DELG_SPECIFIED,507,1024,CH                                                      
DELG_UTK_NETW,1532,8,CH                                                         
*------------------------------------------------*                              
*                    DELUSER                     *                              
*------------------------------------------------*                              
DELU_EVENT_TYPE,5,8,CH                                                          
DELU_EVENT_QUAL,14,8,CH                                                         
DELU_TIME_WRITTEN,23,8,CH                                                       
DELU_DATE_WRITTEN,32,10,CH                                                      
DELU_SYSTEM_SMFID,43,4,CH                                                       
DELU_VIOLATION,48,1,CH                                                          
DELU_USER_NDFND,53,1,CH                                                         
DELU_USER_WARNING,58,1,CH                                                       
DELU_EVT_USER_ID,63,8,CH                                                        
DELU_EVT_GRP_ID,72,8,CH                                                         
DELU_AUTH_NORMAL,81,1,CH                                                        
DELU_AUTH_SPECIAL,86,1,CH                                                       
DELU_AUTH_OPER,91,1,CH                                                          
DELU_AUTH_AUDIT,96,1,CH                                                         
DELU_AUTH_EXIT,101,1,CH                                                         
DELU_AUTH_FAILSFT,106,1,CH                                                      
DELU_AUTH_BYPASS,111,1,CH                                                       
DELU_AUTH_TRUSTED,116,1,CH                                                      
DELU_LOG_CLASS,121,1,CH                                                         
DELU_LOG_USER,126,1,CH                                                          
DELU_LOG_SPECIAL,131,1,CH                                                       
DELU_LOG_ACCESS,136,1,CH                                                        
DELU_LOG_RACINIT,141,1,CH                                                       
DELU_LOG_ALWAYS,146,1,CH                                                        
DELU_LOG_CMDVIOL,151,1,CH                                                       
DELU_LOG_GLOBAL,156,1,CH                                                        
DELU_TERM_LEVEL,161,3,CH                                                        
DELU_BACKOUT_FAIL,165,1,CH                                                      
DELU_PROF_SAME,170,1,CH                                                         
DELU_TERM,175,8,CH                                                              
DELU_JOB_NAME,184,8,CH                                                          
DELU_READ_TIME,193,8,CH                                                         
DELU_READ_DATE,202,10,CH                                                        
DELU_SMF_USER_ID,213,8,CH                                                       
DELU_LOG_LEVEL,222,1,CH                                                         
DELU_LOG_VMEVENT,227,1,CH                                                       
DELU_LOG_LOGOPT,232,1,CH                                                        
DELU_LOG_SECL,237,1,CH                                                          
DELU_LOG_COMPATM,242,1,CH                                                       
DELU_LOG_APPLAUD,247,1,CH                                                       
DELU_LOG_NONOMVS,252,1,CH                                                       
DELU_LOG_OMVSNPRV,257,1,CH                                                      
DELU_AUTH_OMVSSU,262,1,CH                                                       
DELU_AUTH_OMVSSYS,267,1,CH                                                      
DELU_USR_SECL,272,8,CH                                                          
DELU_RACF_VERSION,281,4,CH                                                      
DELU_OWN_ID,286,8,CH                                                            
DELU_USER_NAME,295,20,CH                                                        
DELU_UTK_ENCR,316,4,CH                                                          
DELU_UTK_PRE19,321,4,CH                                                         
DELU_UTK_VERPROF,326,4,CH                                                       
DELU_UTK_NJEUNUSR,331,4,CH                                                      
DELU_UTK_LOGUSR,336,4,CH                                                        
DELU_UTK_SPECIAL,341,4,CH                                                       
DELU_UTK_DEFAULT,346,4,CH                                                       
DELU_UTK_UNKNUSR,351,4,CH                                                       
DELU_UTK_ERROR,356,4,CH                                                         
DELU_UTK_TRUSTED,361,4,CH                                                       
DELU_UTK_SESSTYPE,366,8,CH                                                      
DELU_UTK_SURROGAT,375,4,CH                                                      
DELU_UTK_REMOTE,380,4,CH                                                        
DELU_UTK_PRIV,385,4,CH                                                          
DELU_UTK_SECL,390,8,CH                                                          
DELU_UTK_EXECNODE,399,8,CH                                                      
DELU_UTK_SUSER_ID,408,8,CH                                                      
DELU_UTK_SNODE,417,8,CH                                                         
DELU_UTK_SGRP_ID,426,8,CH                                                       
DELU_UTK_SPOE,435,8,CH                                                          
DELU_UTK_SPCLASS,444,8,CH                                                       
DELU_UTK_USER_ID,453,8,CH                                                       
DELU_UTK_GRP_ID,462,8,CH                                                        
DELU_UTK_DFT_GRP,471,4,CH                                                       
DELU_UTK_DFT_SECL,476,4,CH                                                      
DELU_APPC_LINK,481,16,CH                                                        
DELU_USER_ID,498,8,CH                                                           
DELU_SPECIFIED,507,1024,CH                                                      
DELU_UTK_NETW,1532,8,CH                                                         
*------------------------------------------------*                              
*                    PASSWORD                    *                              
*------------------------------------------------*                              
PWD_EVENT_TYPE,5,8,CH                                                           
PWD_EVENT_QUAL,14,8,CH                                                          
PWD_TIME_WRITTEN,23,8,CH                                                        
PWD_DATE_WRITTEN,32,10,CH                                                       
PWD_SYSTEM_SMFID,43,4,CH                                                        
PWD_VIOLATION,48,1,CH                                                           
PWD_USER_NDFND,53,1,CH                                                          
PWD_USER_WARNING,58,1,CH                                                        
PWD_EVT_USER_ID,63,8,CH                                                         
PWD_EVT_GRP_ID,72,8,CH                                                          
PWD_AUTH_NORMAL,81,1,CH                                                         
PWD_AUTH_SPECIAL,86,1,CH                                                        
PWD_AUTH_OPER,91,1,CH                                                           
PWD_AUTH_AUDIT,96,1,CH                                                          
PWD_AUTH_EXIT,101,1,CH                                                          
PWD_AUTH_FAILSFT,106,1,CH                                                       
PWD_AUTH_BYPASS,111,1,CH                                                        
PWD_AUTH_TRUSTED,116,1,CH                                                       
PWD_LOG_CLASS,121,1,CH                                                          
PWD_LOG_USER,126,1,CH                                                           
PWD_LOG_SPECIAL,131,1,CH                                                        
PWD_LOG_ACCESS,136,1,CH                                                         
PWD_LOG_RACINIT,141,1,CH                                                        
PWD_LOG_ALWAYS,146,1,CH                                                         
PWD_LOG_CMDVIOL,151,1,CH                                                        
PWD_LOG_GLOBAL,156,1,CH                                                         
PWD_TERM_LEVEL,161,3,CH                                                         
PWD_BACKOUT_FAIL,165,1,CH                                                       
PWD_PROF_SAME,170,1,CH                                                          
PWD_TERM,175,8,CH                                                               
PWD_JOB_NAME,184,8,CH                                                           
PWD_READ_TIME,193,8,CH                                                          
PWD_READ_DATE,202,10,CH                                                         
PWD_SMF_USER_ID,213,8,CH                                                        
PWD_LOG_LEVEL,222,1,CH                                                          
PWD_LOG_VMEVENT,227,1,CH                                                        
PWD_LOG_LOGOPT,232,1,CH                                                         
PWD_LOG_SECL,237,1,CH                                                           
PWD_LOG_COMPATM,242,1,CH                                                        
PWD_LOG_APPLAUD,247,1,CH                                                        
PWD_LOG_NONOMVS,252,1,CH                                                        
PWD_LOG_OMVSNPRV,257,1,CH                                                       
PWD_AUTH_OMVSSU,262,1,CH                                                        
PWD_AUTH_OMVSSYS,267,1,CH                                                       
PWD_USR_SECL,272,8,CH                                                           
PWD_RACF_VERSION,281,4,CH                                                       
PWD_OWN_ID,286,8,CH                                                             
PWD_USER_NAME,295,20,CH                                                         
PWD_UTK_ENCR,316,4,CH                                                           
PWD_UTK_PRE19,321,4,CH                                                          
PWD_UTK_VERPROF,326,4,CH                                                        
PWD_UTK_NJEUNUSR,331,4,CH                                                       
PWD_UTK_LOGUSR,336,4,CH                                                         
PWD_UTK_SPECIAL,341,4,CH                                                        
PWD_UTK_DEFAULT,346,4,CH                                                        
PWD_UTK_UNKNUSR,351,4,CH                                                        
PWD_UTK_ERROR,356,4,CH                                                          
PWD_UTK_TRUSTED,361,4,CH                                                        
PWD_UTK_SESSTYPE,366,8,CH                                                       
PWD_UTK_SURROGAT,375,4,CH                                                       
PWD_UTK_REMOTE,380,4,CH                                                         
PWD_UTK_PRIV,385,4,CH                                                           
PWD_UTK_SECL,390,8,CH                                                           
PWD_UTK_EXECNODE,399,8,CH                                                       
PWD_UTK_SUSER_ID,408,8,CH                                                       
PWD_UTK_SNODE,417,8,CH                                                          
PWD_UTK_SGRP_ID,426,8,CH                                                        
PWD_UTK_SPOE,435,8,CH                                                           
PWD_UTK_SPCLASS,444,8,CH                                                        
PWD_UTK_USER_ID,453,8,CH                                                        
PWD_UTK_GRP_ID,462,8,CH                                                         
PWD_UTK_DFT_GRP,471,4,CH                                                        
PWD_UTK_DFT_SECL,476,4,CH                                                       
PWD_APPC_LINK,481,16,CH                                                         
PWD_SPECIFIED,498,1024,CH                                                       
PWD_FAILED,1523,1024,CH                                                         
PWD_IGNORED,2548,1024,CH                                                        
PWD_UTK_NETW,3573,8,CH                                                          
*------------------------------------------------*                              
*                     PERMIT                     *                              
*------------------------------------------------*                              
PERM_EVENT_TYPE,5,8,CH                                                          
PERM_EVENT_QUAL,14,8,CH                                                         
PERM_TIME_WRITTEN,23,8,CH                                                       
PERM_DATE_WRITTEN,32,10,CH                                                      
PERM_SYSTEM_SMFID,43,4,CH                                                       
PERM_VIOLATION,48,1,CH                                                          
PERM_USER_NDFND,53,1,CH                                                         
PERM_USER_WARNING,58,1,CH                                                       
PERM_EVT_USER_ID,63,8,CH                                                        
PERM_EVT_GRP_ID,72,8,CH                                                         
PERM_AUTH_NORMAL,81,1,CH                                                        
PERM_AUTH_SPECIAL,86,1,CH                                                       
PERM_AUTH_OPER,91,1,CH                                                          
PERM_AUTH_AUDIT,96,1,CH                                                         
PERM_AUTH_EXIT,101,1,CH                                                         
PERM_AUTH_FAILSFT,106,1,CH                                                      
PERM_AUTH_BYPASS,111,1,CH                                                       
PERM_AUTH_TRUSTED,116,1,CH                                                      
PERM_LOG_CLASS,121,1,CH                                                         
PERM_LOG_USER,126,1,CH                                                          
PERM_LOG_SPECIAL,131,1,CH                                                       
PERM_LOG_ACCESS,136,1,CH                                                        
PERM_LOG_RACINIT,141,1,CH                                                       
PERM_LOG_ALWAYS,146,1,CH                                                        
PERM_LOG_CMDVIOL,151,1,CH                                                       
PERM_LOG_GLOBAL,156,1,CH                                                        
PERM_TERM_LEVEL,161,3,CH                                                        
PERM_BACKOUT_FAIL,165,1,CH                                                      
PERM_PROF_SAME,170,1,CH                                                         
PERM_TERM,175,8,CH                                                              
PERM_JOB_NAME,184,8,CH                                                          
PERM_READ_TIME,193,8,CH                                                         
PERM_READ_DATE,202,10,CH                                                        
PERM_SMF_USER_ID,213,8,CH                                                       
PERM_LOG_LEVEL,222,1,CH                                                         
PERM_LOG_VMEVENT,227,1,CH                                                       
PERM_LOG_LOGOPT,232,1,CH                                                        
PERM_LOG_SECL,237,1,CH                                                          
PERM_LOG_COMPATM,242,1,CH                                                       
PERM_LOG_APPLAUD,247,1,CH                                                       
PERM_LOG_NONOMVS,252,1,CH                                                       
PERM_LOG_OMVSNPRV,257,1,CH                                                      
PERM_AUTH_OMVSSU,262,1,CH                                                       
PERM_AUTH_OMVSSYS,267,1,CH                                                      
PERM_USR_SECL,272,8,CH                                                          
PERM_RACF_VERSION,281,4,CH                                                      
PERM_CLASS,286,8,CH                                                             
PERM_OWN_ID,295,8,CH                                                            
PERM_USER_NAME,304,20,CH                                                        
PERM_UTK_ENCR,325,4,CH                                                          
PERM_UTK_PRE19,330,4,CH                                                         
PERM_UTK_VERPROF,335,4,CH                                                       
PERM_UTK_NJEUNUSR,340,4,CH                                                      
PERM_UTK_LOGUSR,345,4,CH                                                        
PERM_UTK_SPECIAL,350,4,CH                                                       
PERM_UTK_DEFAULT,355,4,CH                                                       
PERM_UTK_UNKNUSR,360,4,CH                                                       
PERM_UTK_ERROR,365,4,CH                                                         
PERM_UTK_TRUSTED,370,4,CH                                                       
PERM_UTK_SESSTYPE,375,8,CH                                                      
PERM_UTK_SURROGAT,384,4,CH                                                      
PERM_UTK_REMOTE,389,4,CH                                                        
PERM_UTK_PRIV,394,4,CH                                                          
PERM_UTK_SECL,399,8,CH                                                          
PERM_UTK_EXECNODE,408,8,CH                                                      
PERM_UTK_SUSER_ID,417,8,CH                                                      
PERM_UTK_SNODE,426,8,CH                                                         
PERM_UTK_SGRP_ID,435,8,CH                                                       
PERM_UTK_SPOE,444,8,CH                                                          
PERM_UTK_SPCLASS,453,8,CH                                                       
PERM_UTK_USER_ID,462,8,CH                                                       
PERM_UTK_GRP_ID,471,8,CH                                                        
PERM_UTK_DFT_GRP,480,4,CH                                                       
PERM_UTK_DFT_SECL,485,4,CH                                                      
PERM_APPC_LINK,490,16,CH                                                        
PERM_RES_NAME,507,255,CH                                                        
PERM_SPECIFIED,763,1024,CH                                                      
PERM_FAILED,1788,1024,CH                                                        
PERM_IGNORED,2813,1024,CH                                                       
PERM_UTK_NETW,3838,8,CH                                                         
*------------------------------------------------*                              
*                     RALTER                     *                              
*------------------------------------------------*                              
RALT_EVENT_TYPE,5,8,CH                                                          
RALT_EVENT_QUAL,14,8,CH                                                         
RALT_TIME_WRITTEN,23,8,CH                                                       
RALT_DATE_WRITTEN,32,10,CH                                                      
RALT_SYSTEM_SMFID,43,4,CH                                                       
RALT_VIOLATION,48,1,CH                                                          
RALT_USER_NDFND,53,1,CH                                                         
RALT_USER_WARNING,58,1,CH                                                       
RALT_EVT_USER_ID,63,8,CH                                                        
RALT_EVT_GRP_ID,72,8,CH                                                         
RALT_AUTH_NORMAL,81,1,CH                                                        
RALT_AUTH_SPECIAL,86,1,CH                                                       
RALT_AUTH_OPER,91,1,CH                                                          
RALT_AUTH_AUDIT,96,1,CH                                                         
RALT_AUTH_EXIT,101,1,CH                                                         
RALT_AUTH_FAILSFT,106,1,CH                                                      
RALT_AUTH_BYPASS,111,1,CH                                                       
RALT_AUTH_TRUSTED,116,1,CH                                                      
RALT_LOG_CLASS,121,1,CH                                                         
RALT_LOG_USER,126,1,CH                                                          
RALT_LOG_SPECIAL,131,1,CH                                                       
RALT_LOG_ACCESS,136,1,CH                                                        
RALT_LOG_RACINIT,141,1,CH                                                       
RALT_LOG_ALWAYS,146,1,CH                                                        
RALT_LOG_CMDVIOL,151,1,CH                                                       
RALT_LOG_GLOBAL,156,1,CH                                                        
RALT_TERM_LEVEL,161,3,CH                                                        
RALT_BACKOUT_FAIL,165,1,CH                                                      
RALT_PROF_SAME,170,1,CH                                                         
RALT_TERM,175,8,CH                                                              
RALT_JOB_NAME,184,8,CH                                                          
RALT_READ_TIME,193,8,CH                                                         
RALT_READ_DATE,202,10,CH                                                        
RALT_SMF_USER_ID,213,8,CH                                                       
RALT_LOG_LEVEL,222,1,CH                                                         
RALT_LOG_VMEVENT,227,1,CH                                                       
RALT_LOG_LOGOPT,232,1,CH                                                        
RALT_LOG_SECL,237,1,CH                                                          
RALT_LOG_COMPATM,242,1,CH                                                       
RALT_LOG_APPLAUD,247,1,CH                                                       
RALT_LOG_NONOMVS,252,1,CH                                                       
RALT_LOG_OMVSNPRV,257,1,CH                                                      
RALT_AUTH_OMVSSU,262,1,CH                                                       
RALT_AUTH_OMVSSYS,267,1,CH                                                      
RALT_USR_SECL,272,8,CH                                                          
RALT_RACF_VERSION,281,4,CH                                                      
RALT_CLASS,286,8,CH                                                             
RALT_OWN_ID,295,8,CH                                                            
RALT_USER_NAME,304,20,CH                                                        
RALT_OLD_SECL,325,8,CH                                                          
RALT_UTK_ENCR,334,4,CH                                                          
RALT_UTK_PRE19,339,4,CH                                                         
RALT_UTK_VERPROF,344,4,CH                                                       
RALT_UTK_NJEUNUSR,349,4,CH                                                      
RALT_UTK_LOGUSR,354,4,CH                                                        
RALT_UTK_SPECIAL,359,4,CH                                                       
RALT_UTK_DEFAULT,364,4,CH                                                       
RALT_UTK_UNKNUSR,369,4,CH                                                       
RALT_UTK_ERROR,374,4,CH                                                         
RALT_UTK_TRUSTED,379,4,CH                                                       
RALT_UTK_SESSTYPE,384,8,CH                                                      
RALT_UTK_SURROGAT,393,4,CH                                                      
RALT_UTK_REMOTE,398,4,CH                                                        
RALT_UTK_PRIV,403,4,CH                                                          
RALT_UTK_SECL,408,8,CH                                                          
RALT_UTK_EXECNODE,417,8,CH                                                      
RALT_UTK_SUSER_ID,426,8,CH                                                      
RALT_UTK_SNODE,435,8,CH                                                         
RALT_UTK_SGRP_ID,444,8,CH                                                       
RALT_UTK_SPOE,453,8,CH                                                          
RALT_UTK_SPCLASS,462,8,CH                                                       
RALT_UTK_USER_ID,471,8,CH                                                       
RALT_UTK_GRP_ID,480,8,CH                                                        
RALT_UTK_DFT_GRP,489,4,CH                                                       
RALT_UTK_DFT_SECL,494,4,CH                                                      
RALT_APPC_LINK,499,16,CH                                                        
RALT_RES_NAME,516,255,CH                                                        
RALT_SPECIFIED,772,1024,CH                                                      
RALT_FAILED,1797,1024,CH                                                        
RALT_UTK_NETW,2822,8,CH                                                         
*------------------------------------------------*                              
*                    RDEFINE                     *                              
*------------------------------------------------*                              
RDEF_EVENT_TYPE,5,8,CH                                                          
RDEF_EVENT_QUAL,14,8,CH                                                         
RDEF_TIME_WRITTEN,23,8,CH                                                       
RDEF_DATE_WRITTEN,32,10,CH                                                      
RDEF_SYSTEM_SMFID,43,4,CH                                                       
RDEF_VIOLATION,48,1,CH                                                          
RDEF_USER_NDFND,53,1,CH                                                         
RDEF_USER_WARNING,58,1,CH                                                       
RDEF_EVT_USER_ID,63,8,CH                                                        
RDEF_EVT_GRP_ID,72,8,CH                                                         
RDEF_AUTH_NORMAL,81,1,CH                                                        
RDEF_AUTH_SPECIAL,86,1,CH                                                       
RDEF_AUTH_OPER,91,1,CH                                                          
RDEF_AUTH_AUDIT,96,1,CH                                                         
RDEF_AUTH_EXIT,101,1,CH                                                         
RDEF_AUTH_FAILSFT,106,1,CH                                                      
RDEF_AUTH_BYPASS,111,1,CH                                                       
RDEF_AUTH_TRUSTED,116,1,CH                                                      
RDEF_LOG_CLASS,121,1,CH                                                         
RDEF_LOG_USER,126,1,CH                                                          
RDEF_LOG_SPECIAL,131,1,CH                                                       
RDEF_LOG_ACCESS,136,1,CH                                                        
RDEF_LOG_RACINIT,141,1,CH                                                       
RDEF_LOG_ALWAYS,146,1,CH                                                        
RDEF_LOG_CMDVIOL,151,1,CH                                                       
RDEF_LOG_GLOBAL,156,1,CH                                                        
RDEF_TERM_LEVEL,161,3,CH                                                        
RDEF_BACKOUT_FAIL,165,1,CH                                                      
RDEF_PROF_SAME,170,1,CH                                                         
RDEF_TERM,175,8,CH                                                              
RDEF_JOB_NAME,184,8,CH                                                          
RDEF_READ_TIME,193,8,CH                                                         
RDEF_READ_DATE,202,10,CH                                                        
RDEF_SMF_USER_ID,213,8,CH                                                       
RDEF_LOG_LEVEL,222,1,CH                                                         
RDEF_LOG_VMEVENT,227,1,CH                                                       
RDEF_LOG_LOGOPT,232,1,CH                                                        
RDEF_LOG_SECL,237,1,CH                                                          
RDEF_LOG_COMPATM,242,1,CH                                                       
RDEF_LOG_APPLAUD,247,1,CH                                                       
RDEF_LOG_NONOMVS,252,1,CH                                                       
RDEF_LOG_OMVSNPRV,257,1,CH                                                      
RDEF_AUTH_OMVSSU,262,1,CH                                                       
RDEF_AUTH_OMVSSYS,267,1,CH                                                      
RDEF_USR_SECL,272,8,CH                                                          
RDEF_RACF_VERSION,281,4,CH                                                      
RDEF_CLASS,286,8,CH                                                             
RDEF_OWN_ID,295,8,CH                                                            
RDEF_USER_NAME,304,20,CH                                                        
RDEF_SECL,325,8,CH                                                              
RDEF_UTK_ENCR,334,4,CH                                                          
RDEF_UTK_PRE19,339,4,CH                                                         
RDEF_UTK_VERPROF,344,4,CH                                                       
RDEF_UTK_NJEUNUSR,349,4,CH                                                      
RDEF_UTK_LOGUSR,354,4,CH                                                        
RDEF_UTK_SPECIAL,359,4,CH                                                       
RDEF_UTK_DEFAULT,364,4,CH                                                       
RDEF_UTK_UNKNUSR,369,4,CH                                                       
RDEF_UTK_ERROR,374,4,CH                                                         
RDEF_UTK_TRUSTED,379,4,CH                                                       
RDEF_UTK_SESSTYPE,384,8,CH                                                      
RDEF_UTK_SURROGAT,393,4,CH                                                      
RDEF_UTK_REMOTE,398,4,CH                                                        
RDEF_UTK_PRIV,403,4,CH                                                          
RDEF_UTK_SECL,408,8,CH                                                          
RDEF_UTK_EXECNODE,417,8,CH                                                      
RDEF_UTK_SUSER_ID,426,8,CH                                                      
RDEF_UTK_SNODE,435,8,CH                                                         
RDEF_UTK_SGRP_ID,444,8,CH                                                       
RDEF_UTK_SPOE,453,8,CH                                                          
RDEF_UTK_SPCLASS,462,8,CH                                                       
RDEF_UTK_USER_ID,471,8,CH                                                       
RDEF_UTK_GRP_ID,480,8,CH                                                        
RDEF_UTK_DFT_GRP,489,4,CH                                                       
RDEF_UTK_DFT_SECL,494,4,CH                                                      
RDEF_APPC_LINK,499,16,CH                                                        
RDEF_RES_NAME,516,255,CH                                                        
RDEF_SPECIFIED,772,1024,CH                                                      
RDEF_FAILED,1797,1024,CH                                                        
RDEF_UTK_NETW,2822,8,CH                                                         
*------------------------------------------------*                              
*                    RDELETE                     *                              
*------------------------------------------------*                              
RDEL_EVENT_TYPE,5,8,CH                                                          
RDEL_EVENT_QUAL,14,8,CH                                                         
RDEL_TIME_WRITTEN,23,8,CH                                                       
RDEL_DATE_WRITTEN,32,10,CH                                                      
RDEL_SYSTEM_SMFID,43,4,CH                                                       
RDEL_VIOLATION,48,1,CH                                                          
RDEL_USER_NDFND,53,1,CH                                                         
RDEL_USER_WARNING,58,1,CH                                                       
RDEL_EVT_USER_ID,63,8,CH                                                        
RDEL_EVT_GRP_ID,72,8,CH                                                         
RDEL_AUTH_NORMAL,81,1,CH                                                        
RDEL_AUTH_SPECIAL,86,1,CH                                                       
RDEL_AUTH_OPER,91,1,CH                                                          
RDEL_AUTH_AUDIT,96,1,CH                                                         
RDEL_AUTH_EXIT,101,1,CH                                                         
RDEL_AUTH_FAILSFT,106,1,CH                                                      
RDEL_AUTH_BYPASS,111,1,CH                                                       
RDEL_AUTH_TRUSTED,116,1,CH                                                      
RDEL_LOG_CLASS,121,1,CH                                                         
RDEL_LOG_USER,126,1,CH                                                          
RDEL_LOG_SPECIAL,131,1,CH                                                       
RDEL_LOG_ACCESS,136,1,CH                                                        
RDEL_LOG_RACINIT,141,1,CH                                                       
RDEL_LOG_ALWAYS,146,1,CH                                                        
RDEL_LOG_CMDVIOL,151,1,CH                                                       
RDEL_LOG_GLOBAL,156,1,CH                                                        
RDEL_TERM_LEVEL,161,3,CH                                                        
RDEL_BACKOUT_FAIL,165,1,CH                                                      
RDEL_PROF_SAME,170,1,CH                                                         
RDEL_TERM,175,8,CH                                                              
RDEL_JOB_NAME,184,8,CH                                                          
RDEL_READ_TIME,193,8,CH                                                         
RDEL_READ_DATE,202,10,CH                                                        
RDEL_SMF_USER_ID,213,8,CH                                                       
RDEL_LOG_LEVEL,222,1,CH                                                         
RDEL_LOG_VMEVENT,227,1,CH                                                       
RDEL_LOG_LOGOPT,232,1,CH                                                        
RDEL_LOG_SECL,237,1,CH                                                          
RDEL_LOG_COMPATM,242,1,CH                                                       
RDEL_LOG_APPLAUD,247,1,CH                                                       
RDEL_LOG_NONOMVS,252,1,CH                                                       
RDEL_LOG_OMVSNPRV,257,1,CH                                                      
RDEL_AUTH_OMVSSU,262,1,CH                                                       
RDEL_AUTH_OMVSSYS,267,1,CH                                                      
RDEL_USR_SECL,272,8,CH                                                          
RDEL_RACF_VERSION,281,4,CH                                                      
RDEL_CLASS,286,8,CH                                                             
RDEL_OWN_ID,295,8,CH                                                            
RDEL_USER_NAME,304,20,CH                                                        
RDEL_SECL,325,8,CH                                                              
RDEL_UTK_ENCR,334,4,CH                                                          
RDEL_UTK_PRE19,339,4,CH                                                         
RDEL_UTK_VERPROF,344,4,CH                                                       
RDEL_UTK_NJEUNUSR,349,4,CH                                                      
RDEL_UTK_LOGUSR,354,4,CH                                                        
RDEL_UTK_SPECIAL,359,4,CH                                                       
RDEL_UTK_DEFAULT,364,4,CH                                                       
RDEL_UTK_UNKNUSR,369,4,CH                                                       
RDEL_UTK_ERROR,374,4,CH                                                         
RDEL_UTK_TRUSTED,379,4,CH                                                       
RDEL_UTK_SESSTYPE,384,8,CH                                                      
RDEL_UTK_SURROGAT,393,4,CH                                                      
RDEL_UTK_REMOTE,398,4,CH                                                        
RDEL_UTK_PRIV,403,4,CH                                                          
RDEL_UTK_SECL,408,8,CH                                                          
RDEL_UTK_EXECNODE,417,8,CH                                                      
RDEL_UTK_SUSER_ID,426,8,CH                                                      
RDEL_UTK_SNODE,435,8,CH                                                         
RDEL_UTK_SGRP_ID,444,8,CH                                                       
RDEL_UTK_SPOE,453,8,CH                                                          
RDEL_UTK_SPCLASS,462,8,CH                                                       
RDEL_UTK_USER_ID,471,8,CH                                                       
RDEL_UTK_GRP_ID,480,8,CH                                                        
RDEL_UTK_DFT_GRP,489,4,CH                                                       
RDEL_UTK_DFT_SECL,494,4,CH                                                      
RDEL_APPC_LINK,499,16,CH                                                        
RDEL_RES_NAME,516,255,CH                                                        
RDEL_SPECIFIED,772,1024,CH                                                      
RDEL_UTK_NETW,1797,8,CH                                                         
*------------------------------------------------*                              
*                     REMOVE                     *                              
*------------------------------------------------*                              
REM_EVENT_TYPE,5,8,CH                                                           
REM_EVENT_QUAL,14,8,CH                                                          
REM_TIME_WRITTEN,23,8,CH                                                        
REM_DATE_WRITTEN,32,10,CH                                                       
REM_SYSTEM_SMFID,43,4,CH                                                        
REM_VIOLATION,48,1,CH                                                           
REM_USER_NDFND,53,1,CH                                                          
REM_USER_WARNING,58,1,CH                                                        
REM_EVT_USER_ID,63,8,CH                                                         
REM_EVT_GRP_ID,72,8,CH                                                          
REM_AUTH_NORMAL,81,1,CH                                                         
REM_AUTH_SPECIAL,86,1,CH                                                        
REM_AUTH_OPER,91,1,CH                                                           
REM_AUTH_AUDIT,96,1,CH                                                          
REM_AUTH_EXIT,101,1,CH                                                          
REM_AUTH_FAILSFT,106,1,CH                                                       
REM_AUTH_BYPASS,111,1,CH                                                        
REM_AUTH_TRUSTED,116,1,CH                                                       
REM_LOG_CLASS,121,1,CH                                                          
REM_LOG_USER,126,1,CH                                                           
REM_LOG_SPECIAL,131,1,CH                                                        
REM_LOG_ACCESS,136,1,CH                                                         
REM_LOG_RACINIT,141,1,CH                                                        
REM_LOG_ALWAYS,146,1,CH                                                         
REM_LOG_CMDVIOL,151,1,CH                                                        
REM_LOG_GLOBAL,156,1,CH                                                         
REM_TERM_LEVEL,161,3,CH                                                         
REM_BACKOUT_FAIL,165,1,CH                                                       
REM_PROF_SAME,170,1,CH                                                          
REM_TERM,175,8,CH                                                               
REM_JOB_NAME,184,8,CH                                                           
REM_READ_TIME,193,8,CH                                                          
REM_READ_DATE,202,10,CH                                                         
REM_SMF_USER_ID,213,8,CH                                                        
REM_LOG_LEVEL,222,1,CH                                                          
REM_LOG_VMEVENT,227,1,CH                                                        
REM_LOG_LOGOPT,232,1,CH                                                         
REM_LOG_SECL,237,1,CH                                                           
REM_LOG_COMPATM,242,1,CH                                                        
REM_LOG_APPLAUD,247,1,CH                                                        
REM_LOG_NONOMVS,252,1,CH                                                        
REM_LOG_OMVSNPRV,257,1,CH                                                       
REM_AUTH_OMVSSU,262,1,CH                                                        
REM_AUTH_OMVSSYS,267,1,CH                                                       
REM_USR_SECL,272,8,CH                                                           
REM_RACF_VERSION,281,4,CH                                                       
REM_OWN_ID,286,8,CH                                                             
REM_USER_NAME,295,20,CH                                                         
REM_UTK_ENCR,316,4,CH                                                           
REM_UTK_PRE19,321,4,CH                                                          
REM_UTK_VERPROF,326,4,CH                                                        
REM_UTK_NJEUNUSR,331,4,CH                                                       
REM_UTK_LOGUSR,336,4,CH                                                         
REM_UTK_SPECIAL,341,4,CH                                                        
REM_UTK_DEFAULT,346,4,CH                                                        
REM_UTK_UNKNUSR,351,4,CH                                                        
REM_UTK_ERROR,356,4,CH                                                          
REM_UTK_TRUSTED,361,4,CH                                                        
REM_UTK_SESSTYPE,366,8,CH                                                       
REM_UTK_SURROGAT,375,4,CH                                                       
REM_UTK_REMOTE,380,4,CH                                                         
REM_UTK_PRIV,385,4,CH                                                           
REM_UTK_SECL,390,8,CH                                                           
REM_UTK_EXECNODE,399,8,CH                                                       
REM_UTK_SUSER_ID,408,8,CH                                                       
REM_UTK_SNODE,417,8,CH                                                          
REM_UTK_SGRP_ID,426,8,CH                                                        
REM_UTK_SPOE,435,8,CH                                                           
REM_UTK_SPCLASS,444,8,CH                                                        
REM_UTK_USER_ID,453,8,CH                                                        
REM_UTK_GRP_ID,462,8,CH                                                         
REM_UTK_DFT_GRP,471,4,CH                                                        
REM_UTK_DFT_SECL,476,4,CH                                                       
REM_APPC_LINK,481,16,CH                                                         
REM_USER_ID,498,8,CH                                                            
REM_SPECIFIED,507,1024,CH                                                       
REM_FAILED,1532,1024,CH                                                         
REM_UTK_NETW,2557,8,CH                                                          
*------------------------------------------------*                              
*                    SETROPTS                    *                              
*------------------------------------------------*                              
SETR_EVENT_TYPE,5,8,CH                                                          
SETR_EVENT_QUAL,14,8,CH                                                         
SETR_TIME_WRITTEN,23,8,CH                                                       
SETR_DATE_WRITTEN,32,10,CH                                                      
SETR_SYSTEM_SMFID,43,4,CH                                                       
SETR_VIOLATION,48,1,CH                                                          
SETR_USER_NDFND,53,1,CH                                                         
SETR_USER_WARNING,58,1,CH                                                       
SETR_EVT_USER_ID,63,8,CH                                                        
SETR_EVT_GRP_ID,72,8,CH                                                         
SETR_AUTH_NORMAL,81,1,CH                                                        
SETR_AUTH_SPECIAL,86,1,CH                                                       
SETR_AUTH_OPER,91,1,CH                                                          
SETR_AUTH_AUDIT,96,1,CH                                                         
SETR_AUTH_EXIT,101,1,CH                                                         
SETR_AUTH_FAILSFT,106,1,CH                                                      
SETR_AUTH_BYPASS,111,1,CH                                                       
SETR_AUTH_TRUSTED,116,1,CH                                                      
SETR_LOG_CLASS,121,1,CH                                                         
SETR_LOG_USER,126,1,CH                                                          
SETR_LOG_SPECIAL,131,1,CH                                                       
SETR_LOG_ACCESS,136,1,CH                                                        
SETR_LOG_RACINIT,141,1,CH                                                       
SETR_LOG_ALWAYS,146,1,CH                                                        
SETR_LOG_CMDVIOL,151,1,CH                                                       
SETR_LOG_GLOBAL,156,1,CH                                                        
SETR_TERM_LEVEL,161,3,CH                                                        
SETR_BACKOUT_FAIL,165,1,CH                                                      
SETR_PROF_SAME,170,1,CH                                                         
SETR_TERM,175,8,CH                                                              
SETR_JOB_NAME,184,8,CH                                                          
SETR_READ_TIME,193,8,CH                                                         
SETR_READ_DATE,202,10,CH                                                        
SETR_SMF_USER_ID,213,8,CH                                                       
SETR_LOG_LEVEL,222,1,CH                                                         
SETR_LOG_VMEVENT,227,1,CH                                                       
SETR_LOG_LOGOPT,232,1,CH                                                        
SETR_LOG_SECL,237,1,CH                                                          
SETR_LOG_COMPATM,242,1,CH                                                       
SETR_LOG_APPLAUD,247,1,CH                                                       
SETR_LOG_NONOMVS,252,1,CH                                                       
SETR_LOG_OMVSNPRV,257,1,CH                                                      
SETR_AUTH_OMVSSU,262,1,CH                                                       
SETR_AUTH_OMVSSYS,267,1,CH                                                      
SETR_USR_SECL,272,8,CH                                                          
SETR_RACF_VERSION,281,4,CH                                                      
SETR_USER_NAME,286,20,CH                                                        
SETR_UTK_ENCR,307,4,CH                                                          
SETR_UTK_PRE19,312,4,CH                                                         
SETR_UTK_VERPROF,317,4,CH                                                       
SETR_UTK_NJEUNUSR,322,4,CH                                                      
SETR_UTK_LOGUSR,327,4,CH                                                        
SETR_UTK_SPECIAL,332,4,CH                                                       
SETR_UTK_DEFAULT,337,4,CH                                                       
SETR_UTK_UNKNUSR,342,4,CH                                                       
SETR_UTK_ERROR,347,4,CH                                                         
SETR_UTK_TRUSTED,352,4,CH                                                       
SETR_UTK_SESSTYPE,357,8,CH                                                      
SETR_UTK_SURROGAT,366,4,CH                                                      
SETR_UTK_REMOVE,371,4,CH                                                        
SETR_UTK_PRIV,376,4,CH                                                          
SETR_UTK_SECL,381,8,CH                                                          
SETR_UTK_EXECNODE,390,8,CH                                                      
SETR_UTK_SUSER_ID,399,8,CH                                                      
SETR_UTK_SNODE,408,8,CH                                                         
SETR_UTK_SGRP_ID,417,8,CH                                                       
SETR_UTK_SPOE,426,8,CH                                                          
SETR_UTK_SPCLASS,435,8,CH                                                       
SETR_UTK_USER_ID,444,8,CH                                                       
SETR_UTK_GRP_ID,453,8,CH                                                        
SETR_UTK_DFT_GRP,462,4,CH                                                       
SETR_UTK_DFT_SECL,467,4,CH                                                      
SETR_APPC_LINK,472,16,CH                                                        
SETR_SPECIFIED,489,1024,CH                                                      
SETR_FAILED,1514,1024,CH                                                        
SETR_UTK_NETW,2539,8,CH                                                         
*------------------------------------------------*                              
*                     RVARY                      *                              
*------------------------------------------------*                              
RVAR_EVENT_TYPE,5,8,CH                                                          
RVAR_EVENT_QUAL,14,8,CH                                                         
RVAR_TIME_WRITTEN,23,8,CH                                                       
RVAR_DATE_WRITTEN,32,10,CH                                                      
RVAR_SYSTEM_SMFID,43,4,CH                                                       
RVAR_VIOLATION,48,1,CH                                                          
RVAR_USER_NDFND,53,1,CH                                                         
RVAR_USER_WARNING,58,1,CH                                                       
RVAR_EVT_USER_ID,63,8,CH                                                        
RVAR_EVT_GRP_ID,72,8,CH                                                         
RVAR_AUTH_NORMAL,81,1,CH                                                        
RVAR_AUTH_SPECIAL,86,1,CH                                                       
RVAR_AUTH_OPER,91,1,CH                                                          
RVAR_AUTH_AUDIT,96,1,CH                                                         
RVAR_AUTH_EXIT,101,1,CH                                                         
RVAR_AUTH_FAILSFT,106,1,CH                                                      
RVAR_AUTH_BYPASS,111,1,CH                                                       
RVAR_AUTH_TRUSTED,116,1,CH                                                      
RVAR_LOG_CLASS,121,1,CH                                                         
RVAR_LOG_USER,126,1,CH                                                          
RVAR_LOG_SPECIAL,131,1,CH                                                       
RVAR_LOG_ACCESS,136,1,CH                                                        
RVAR_LOG_RACINIT,141,1,CH                                                       
RVAR_LOG_ALWAYS,146,1,CH                                                        
RVAR_LOG_CMDVIOL,151,1,CH                                                       
RVAR_LOG_GLOBAL,156,1,CH                                                        
RVAR_TERM_LEVEL,161,3,CH                                                        
RVAR_BACKOUT_FAIL,165,1,CH                                                      
RVAR_PROF_SAME,170,1,CH                                                         
RVAR_TERM,175,8,CH                                                              
RVAR_JOB_NAME,184,8,CH                                                          
RVAR_READ_TIME,193,8,CH                                                         
RVAR_READ_DATE,202,10,CH                                                        
RVAR_SMF_USER_ID,213,8,CH                                                       
RVAR_LOG_LEVEL,222,1,CH                                                         
RVAR_LOG_VMEVENT,227,1,CH                                                       
RVAR_LOG_LOGOPT,232,1,CH                                                        
RVAR_LOG_SECL,237,1,CH                                                          
RVAR_LOG_COMPATM,242,1,CH                                                       
RVAR_LOG_APPLAUD,247,1,CH                                                       
RVAR_LOG_NONOMVS,252,1,CH                                                       
RVAR_LOG_OMVSNPRV,257,1,CH                                                      
RVAR_AUTH_OMVSSU,262,1,CH                                                       
RVAR_AUTH_OMVSSYS,267,1,CH                                                      
RVAR_USR_SECL,272,8,CH                                                          
RVAR_RACF_VERSION,281,4,CH                                                      
RVAR_USER_NAME,286,20,CH                                                        
RVAR_UTK_ENCR,307,4,CH                                                          
RVAR_UTK_PRE19,312,4,CH                                                         
RVAR_UTK_VERPROF,317,4,CH                                                       
RVAR_UTK_NJEUNUSR,322,4,CH                                                      
RVAR_UTK_LOGUSR,327,4,CH                                                        
RVAR_UTK_SPECIAL,332,4,CH                                                       
RVAR_UTK_DEFAULT,337,4,CH                                                       
RVAR_UTK_UNKNUSR,342,4,CH                                                       
RVAR_UTK_ERROR,347,4,CH                                                         
RVAR_UTK_TRUSTED,352,4,CH                                                       
RVAR_UTK_SESSTYPE,357,8,CH                                                      
RVAR_UTK_SURROGAT,366,4,CH                                                      
RVAR_UTK_REMOVE,371,4,CH                                                        
RVAR_UTK_PRIV,376,4,CH                                                          
RVAR_UTK_SECL,381,8,CH                                                          
RVAR_UTK_EXECNODE,390,8,CH                                                      
RVAR_UTK_SUSER_ID,399,8,CH                                                      
RVAR_UTK_SNODE,408,8,CH                                                         
RVAR_UTK_SGRP_ID,417,8,CH                                                       
RVAR_UTK_SPOE,426,8,CH                                                          
RVAR_UTK_SPCLASS,435,8,CH                                                       
RVAR_UTK_USER_ID,444,8,CH                                                       
RVAR_UTK_GRP_ID,453,8,CH                                                        
RVAR_UTK_DFT_GRP,462,4,CH                                                       
RVAR_UTK_DFT_SECL,467,4,CH                                                      
RVAR_APPC_LINK,472,16,CH                                                        
RVAR_SPECIFIED,489,1024,CH                                                      
RVAR_FAILED,1514,1024,CH                                                        
RVAR_UTK_NETW,2539,8,CH                                                         
*------------------------------------------------*                              
*                     APPCLU                     *                              
*------------------------------------------------*                              
APPC_EVENT_TYPE,5,8,CH                                                          
APPC_EVENT_QUAL,14,8,CH                                                         
APPC_TIME_WRITTEN,23,8,CH                                                       
APPC_DATE_WRITTEN,32,10,CH                                                      
APPC_SYSTEM_SMFID,43,4,CH                                                       
APPC_VIOLATION,48,1,CH                                                          
APPC_USER_NDFND,53,1,CH                                                         
APPC_USER_WARNING,58,1,CH                                                       
APPC_EVT_USER_ID,63,8,CH                                                        
APPC_EVT_GRP_ID,72,8,CH                                                         
APPC_AUTH_NORMAL,81,1,CH                                                        
APPC_AUTH_SPECIAL,86,1,CH                                                       
APPC_AUTH_OPER,91,1,CH                                                          
APPC_AUTH_AUDIT,96,1,CH                                                         
APPC_AUTH_EXIT,101,1,CH                                                         
APPC_AUTH_FAILSFT,106,1,CH                                                      
APPC_AUTH_BYPASS,111,1,CH                                                       
APPC_AUTH_TRUSTED,116,1,CH                                                      
APPC_LOG_CLASS,121,1,CH                                                         
APPC_LOG_USER,126,1,CH                                                          
APPC_LOG_SPECIAL,131,1,CH                                                       
APPC_LOG_ACCESS,136,1,CH                                                        
APPC_LOG_RACINIT,141,1,CH                                                       
APPC_LOG_ALWAYS,146,1,CH                                                        
APPC_LOG_CMDVIOL,151,1,CH                                                       
APPC_LOG_GLOBAL,156,1,CH                                                        
APPC_TERM_LEVEL,161,3,CH                                                        
APPC_BACKOUT_FAIL,165,1,CH                                                      
APPC_PROF_SAME,170,1,CH                                                         
APPC_TERM,175,8,CH                                                              
APPC_JOB_NAME,184,8,CH                                                          
APPC_READ_TIME,193,8,CH                                                         
APPC_READ_DATE,202,10,CH                                                        
APPC_SMF_USER_ID,213,8,CH                                                       
APPC_LOG_LEVEL,222,1,CH                                                         
APPC_LOG_VMEVENT,227,1,CH                                                       
APPC_LOG_LOGOPT,232,1,CH                                                        
APPC_LOG_SECL,237,1,CH                                                          
APPC_LOG_COMPATM,242,1,CH                                                       
APPC_LOG_APPLAUD,247,1,CH                                                       
APPC_LOG_NONOMVS,252,1,CH                                                       
APPC_LOG_OMVSNPRV,257,1,CH                                                      
APPC_AUTH_OMVSSU,262,1,CH                                                       
APPC_AUTH_OMVSSYS,267,1,CH                                                      
APPC_USR_SECL,272,8,CH                                                          
APPC_RACF_VERSION,281,4,CH                                                      
APPC_RES_NAME,286,255,CH                                                        
APPC_CLASS,542,8,CH                                                             
APPC_TYPE,551,8,CH                                                              
APPC_NAME,560,246,CH                                                            
APPC_OWN_ID,807,8,CH                                                            
APPC_USER_NAME,816,20,CH                                                        
APPC_UTK_ENCR,837,4,CH                                                          
APPC_UTK_PRE19,842,4,CH                                                         
APPC_UTK_VERPROF,847,4,CH                                                       
APPC_UTK_NJEUNUSR,852,4,CH                                                      
APPC_UTK_LOGUSR,857,4,CH                                                        
APPC_UTK_SPECIAL,862,4,CH                                                       
APPC_UTK_DEFAULT,867,4,CH                                                       
APPC_UTK_UNKNUSR,872,4,CH                                                       
APPC_UTK_ERROR,877,4,CH                                                         
APPC_UTK_TRUSTED,882,4,CH                                                       
APPC_UTK_SESSTYPE,887,8,CH                                                      
APPC_UTK_SURROGAT,896,4,CH                                                      
APPC_UTK_REMOTE,901,4,CH                                                        
APPC_UTK_PRIV,906,4,CH                                                          
APPC_UTK_SECL,911,8,CH                                                          
APPC_UTK_EXECNODE,920,8,CH                                                      
APPC_UTK_SUSER_ID,929,8,CH                                                      
APPC_UTK_SNODE,938,8,CH                                                         
APPC_UTK_SGRP_ID,947,8,CH                                                       
APPC_UTK_SPOE,956,8,CH                                                          
APPC_UTK_SPCLASS,965,8,CH                                                       
APPC_UTK_USER_ID,974,8,CH                                                       
APPC_UTK_GRP_ID,983,8,CH                                                        
APPC_UTK_DFT_GRP,992,4,CH                                                       
APPC_UTK_DFT_SECL,997,4,CH                                                      
APPC_APPC_LINK,1002,16,CH                                                       
APPC_UTK_NETW,1019,8,CH                                                         
*------------------------------------------------*                              
*                    GENERAL                     *                              
*------------------------------------------------*                              
GEN_EVENT_TYPE,5,8,CH                                                           
GEN_EVENT_QUAL,14,8,CH                                                          
GEN_TIME_WRITTEN,23,8,CH                                                        
GEN_DATE_WRITTEN,32,10,CH                                                       
GEN_SYSTEM_SMFID,43,4,CH                                                        
GEN_VIOLATION,48,1,CH                                                           
GEN_USER_NDFND,53,1,CH                                                          
GEN_USER_WARNING,58,1,CH                                                        
GEN_EVT_USER_ID,63,8,CH                                                         
GEN_EVT_GRP_ID,72,8,CH                                                          
GEN_AUTH_NORMAL,81,1,CH                                                         
GEN_AUTH_SPECIAL,86,1,CH                                                        
GEN_AUTH_OPER,91,1,CH                                                           
GEN_AUTH_AUDIT,96,1,CH                                                          
GEN_AUTH_EXIT,101,1,CH                                                          
GEN_AUTH_FAILSFT,106,1,CH                                                       
GEN_AUTH_BYPASS,111,1,CH                                                        
GEN_AUTH_TRUSTED,116,1,CH                                                       
GEN_LOG_CLASS,121,1,CH                                                          
GEN_LOG_USER,126,1,CH                                                           
GEN_LOG_SPECIAL,131,1,CH                                                        
GEN_LOG_ACCESS,136,1,CH                                                         
GEN_LOG_RACINIT,141,1,CH                                                        
GEN_LOG_ALWAYS,146,1,CH                                                         
GEN_LOG_CMDVIOL,151,1,CH                                                        
GEN_LOG_GLOBAL,156,1,CH                                                         
GEN_TERM_LEVEL,161,3,CH                                                         
GEN_BACKOUT_FAIL,165,1,CH                                                       
GEN_PROF_SAME,170,1,CH                                                          
GEN_TERM,175,8,CH                                                               
GEN_JOB_NAME,184,8,CH                                                           
GEN_READ_TIME,193,8,CH                                                          
GEN_READ_DATE,202,10,CH                                                         
GEN_SMF_USER_ID,213,8,CH                                                        
GEN_LOG_LEVEL,222,1,CH                                                          
GEN_LOG_VMEVENT,227,1,CH                                                        
GEN_LOG_LOGOPT,232,1,CH                                                         
GEN_LOG_SECL,237,1,CH                                                           
GEN_LOG_COMPATM,242,1,CH                                                        
GEN_LOG_APPLAUD,247,1,CH                                                        
GEN_LOG_NONOMVS,252,1,CH                                                        
GEN_LOG_OMVSNPRV,257,1,CH                                                       
GEN_AUTH_OMVSSU,262,1,CH                                                        
GEN_AUTH_OMVSSYS,267,1,CH                                                       
GEN_USR_SECL,272,8,CH                                                           
GEN_RACF_VERSION,281,4,CH                                                       
GEN_CLASS,286,8,CH                                                              
GEN_LOGSTR,295,255,CH                                                           
GEN_USER_NAME,551,20,CH                                                         
GEN_UTK_ENCR,572,4,CH                                                           
GEN_UTK_PRE19,577,4,CH                                                          
GEN_UTK_VERPROF,582,4,CH                                                        
GEN_UTK_NJEUNUSR,587,4,CH                                                       
GEN_UTK_LOGUSR,592,4,CH                                                         
GEN_UTK_SPECIAL,597,4,CH                                                        
GEN_UTK_DEFAULT,602,4,CH                                                        
GEN_UTK_UNKNUSR,607,4,CH                                                        
GEN_UTK_ERROR,612,4,CH                                                          
GEN_UTK_TRUSTED,617,4,CH                                                        
GEN_UTK_SESSTYPE,622,8,CH                                                       
GEN_UTK_SURROGAT,631,4,CH                                                       
GEN_UTK_REMOTE,636,4,CH                                                         
GEN_UTK_PRIV,641,4,CH                                                           
GEN_UTK_SECL,646,8,CH                                                           
GEN_UTK_EXECNODE,655,8,CH                                                       
GEN_UTK_SUSER_ID,664,8,CH                                                       
GEN_UTK_SNODE,673,8,CH                                                          
GEN_UTK_SGRP_ID,682,8,CH                                                        
GEN_UTK_SPOE,691,8,CH                                                           
GEN_UTK_SPCLASS,700,8,CH                                                        
GEN_UTK_USER_ID,709,8,CH                                                        
GEN_UTK_GRP_ID,718,8,CH                                                         
GEN_UTK_DFT_GRP,727,4,CH                                                        
GEN_UTK_DFT_SECL,732,4,CH                                                       
GEN_APPC_LINK,737,16,CH                                                         
GEN_UTK_NETW,754,8,CH                                                           
*------------------------------------------------*                              
*                    DIRSRCH                     *                              
*------------------------------------------------*                              
DSCH_EVENT_TYPE,5,8,CH                                                          
DSCH_EVENT_QUAL,14,8,CH                                                         
DSCH_TIME_WRITTEN,23,8,CH                                                       
DSCH_DATE_WRITTEN,32,10,CH                                                      
DSCH_SYSTEM_SMFID,43,4,CH                                                       
DSCH_VIOLATION,48,1,CH                                                          
DSCH_USER_NDFND,53,1,CH                                                         
DSCH_USER_WARNING,58,1,CH                                                       
DSCH_EVT_USER_ID,63,8,CH                                                        
DSCH_EVT_GRP_ID,72,8,CH                                                         
DSCH_AUTH_NORMAL,81,1,CH                                                        
DSCH_AUTH_SPECIAL,86,1,CH                                                       
DSCH_AUTH_OPER,91,1,CH                                                          
DSCH_AUTH_AUDIT,96,1,CH                                                         
DSCH_AUTH_EXIT,101,1,CH                                                         
DSCH_AUTH_FAILSFT,106,1,CH                                                      
DSCH_AUTH_BYPASS,111,1,CH                                                       
DSCH_AUTH_TRUSTED,116,1,CH                                                      
DSCH_LOG_CLASS,121,1,CH                                                         
DSCH_LOG_USER,126,1,CH                                                          
DSCH_LOG_SPECIAL,131,1,CH                                                       
DSCH_LOG_ACCESS,136,1,CH                                                        
DSCH_LOG_RACINIT,141,1,CH                                                       
DSCH_LOG_ALWAYS,146,1,CH                                                        
DSCH_LOG_CMDVIOL,151,1,CH                                                       
DSCH_LOG_GLOBAL,156,1,CH                                                        
DSCH_TERM_LEVEL,161,3,CH                                                        
DSCH_BACKOUT_FAIL,165,1,CH                                                      
DSCH_PROF_SAME,170,1,CH                                                         
DSCH_TERM,175,8,CH                                                              
DSCH_JOB_NAME,184,8,CH                                                          
DSCH_READ_TIME,193,8,CH                                                         
DSCH_READ_DATE,202,10,CH                                                        
DSCH_SMF_USER_ID,213,8,CH                                                       
DSCH_LOG_LEVEL,222,1,CH                                                         
DSCH_LOG_VMEVENT,227,1,CH                                                       
DSCH_LOG_LOGOPT,232,1,CH                                                        
DSCH_LOG_SECL,237,1,CH                                                          
DSCH_LOG_COMPATM,242,1,CH                                                       
DSCH_LOG_APPLAUD,247,1,CH                                                       
DSCH_LOG_NONOMVS,252,1,CH                                                       
DSCH_LOG_OMVSNPRV,257,1,CH                                                      
DSCH_AUTH_OMVSSU,262,1,CH                                                       
DSCH_AUTH_OMVSSYS,267,1,CH                                                      
DSCH_USR_SECL,272,8,CH                                                          
DSCH_RACF_VERSION,281,4,CH                                                      
DSCH_CLASS,286,8,CH                                                             
DSCH_USER_NAME,295,20,CH                                                        
DSCH_UTK_ENCR,316,4,CH                                                          
DSCH_UTK_PRE19,321,4,CH                                                         
DSCH_UTK_VERPROF,326,4,CH                                                       
DSCH_UTK_NJEUNUSR,331,4,CH                                                      
DSCH_UTK_LOGUSR,336,4,CH                                                        
DSCH_UTK_SPECIAL,341,4,CH                                                       
DSCH_UTK_DEFAULT,346,4,CH                                                       
DSCH_UTK_UNKNUSR,351,4,CH                                                       
DSCH_UTK_ERROR,356,4,CH                                                         
DSCH_UTK_TRUSTED,361,4,CH                                                       
DSCH_UTK_SESSTYPE,366,8,CH                                                      
DSCH_UTK_SURROGAT,375,4,CH                                                      
DSCH_UTK_REMOTE,380,4,CH                                                        
DSCH_UTK_PRIV,385,4,CH                                                          
DSCH_UTK_SECL,390,8,CH                                                          
DSCH_UTK_EXECNODE,399,8,CH                                                      
DSCH_UTK_SUSER_ID,408,8,CH                                                      
DSCH_UTK_SNODE,417,8,CH                                                         
DSCH_UTK_SGRP_ID,426,8,CH                                                       
DSCH_UTK_SPOE,435,8,CH                                                          
DSCH_UTK_SPCLASS,444,8,CH                                                       
DSCH_UTK_USER_ID,453,8,CH                                                       
DSCH_UTK_GRP_ID,462,8,CH                                                        
DSCH_UTK_DFT_GRP,471,4,CH                                                       
DSCH_UTK_DFT_SECL,476,4,CH                                                      
DSCH_APPC_LINK,481,16,CH                                                        
DSCH_AUDIT_CODE,498,11,CH                                                       
DSCH_OLD_REAL_UID,510,10,CH                                                     
DSCH_OLD_EFF_UID,521,10,CH                                                      
DSCH_OLD_SAVED_UID,532,10,CH                                                    
DSCH_OLD_REAL_GID,543,10,CH                                                     
DSCH_OLD_EFF_GID,554,10,CH                                                      
DSCH_OLD_SAVED_GID,565,10,CH                                                    
DSCH_PATH_NAME,576,1023,CH                                                      
DSCH_FILE_ID,1600,32,CH                                                         
DSCH_FILE_OWN_UID,1633,10,CH                                                    
DSCH_FILE_OWN_GID,1644,10,CH                                                    
DSCH_REQUEST_READ,1655,4,CH                                                     
DSCH_REQUEST_WRITE,1660,4,CH                                                    
DSCH_REQUEST_EXEC,1665,4,CH                                                     
DSCH_REQUEST_DSRCH,1670,4,CH                                                    
DSCH_ACCESS_TYPE,1675,8,CH                                                      
DSCH_ALLOWED_READ,1684,4,CH                                                     
DSCH_ALLOWED_WRITE,1689,4,CH                                                    
DSCH_ALLOWED_EXEC,1694,4,CH                                                     
DSCH_REQUEST_PATH2,1699,1023,CH                                                 
DSCH_SERVICE_CODE,2723,11,CH                                                    
DSCH_HFS_DS_NAME,2735,44,CH                                                     
DSCH_SYMLINK,2780,1023,CH                                                       
DSCH_FILE_NAME,3804,256,CH                                                      
DSCH_PATH_TYPE,4061,4,CH                                                        
DSCH_FILEPOOL,4066,8,CH                                                         
DSCH_FILESPACE,4075,8,CH                                                        
DSCH_INODE,4084,10,CH                                                           
DSCH_SCID,4095,10,CH                                                            
DSCH_DCE_LINK,4106,16,CH                                                        
DSCH_AUTH_TYPE,4123,13,CH                                                       
DSCH_DFLT_PROCESS,4137,4,CH                                                     
DSCH_UTK_NETW,4142,8,CH                                                         
*------------------------------------------------*                              
*                    DACCESS                     *                              
*------------------------------------------------*                              
DACC_EVENT_TYPE,5,8,CH                                                          
DACC_EVENT_QUAL,14,8,CH                                                         
DACC_TIME_WRITTEN,23,8,CH                                                       
DACC_DATE_WRITTEN,32,10,CH                                                      
DACC_SYSTEM_SMFID,43,4,CH                                                       
DACC_VIOLATION,48,1,CH                                                          
DACC_USER_NDFND,53,1,CH                                                         
DACC_USER_WARNING,58,1,CH                                                       
DACC_EVT_USER_ID,63,8,CH                                                        
DACC_EVT_GRP_ID,72,8,CH                                                         
DACC_AUTH_NORMAL,81,1,CH                                                        
DACC_AUTH_SPECIAL,86,1,CH                                                       
DACC_AUTH_OPER,91,1,CH                                                          
DACC_AUTH_AUDIT,96,1,CH                                                         
DACC_AUTH_EXIT,101,1,CH                                                         
DACC_AUTH_FAILSFT,106,1,CH                                                      
DACC_AUTH_BYPASS,111,1,CH                                                       
DACC_AUTH_TRUSTED,116,1,CH                                                      
DACC_LOG_CLASS,121,1,CH                                                         
DACC_LOG_USER,126,1,CH                                                          
DACC_LOG_SPECIAL,131,1,CH                                                       
DACC_LOG_ACCESS,136,1,CH                                                        
DACC_LOG_RACINIT,141,1,CH                                                       
DACC_LOG_ALWAYS,146,1,CH                                                        
DACC_LOG_CMDVIOL,151,1,CH                                                       
DACC_LOG_GLOBAL,156,1,CH                                                        
DACC_TERM_LEVEL,161,3,CH                                                        
DACC_BACKOUT_FAIL,165,1,CH                                                      
DACC_PROF_SAME,170,1,CH                                                         
DACC_TERM,175,8,CH                                                              
DACC_JOB_NAME,184,8,CH                                                          
DACC_READ_TIME,193,8,CH                                                         
DACC_READ_DATE,202,10,CH                                                        
DACC_SMF_USER_ID,213,8,CH                                                       
DACC_LOG_LEVEL,222,1,CH                                                         
DACC_LOG_VMEVENT,227,1,CH                                                       
DACC_LOG_LOGOPT,232,1,CH                                                        
DACC_LOG_SECL,237,1,CH                                                          
DACC_LOG_COMPATM,242,1,CH                                                       
DACC_LOG_APPLAUD,247,1,CH                                                       
DACC_LOG_NONOMVS,252,1,CH                                                       
DACC_LOG_OMVSNPRV,257,1,CH                                                      
DACC_AUTH_OMVSSU,262,1,CH                                                       
DACC_AUTH_OMVSSYS,267,1,CH                                                      
DACC_USR_SECL,272,8,CH                                                          
DACC_RACF_VERSION,281,4,CH                                                      
DACC_CLASS,286,8,CH                                                             
DACC_USER_NAME,295,20,CH                                                        
DACC_UTK_ENCR,316,4,CH                                                          
DACC_UTK_PRE19,321,4,CH                                                         
DACC_UTK_VERPROF,326,4,CH                                                       
DACC_UTK_NJEUNUSR,331,4,CH                                                      
DACC_UTK_LOGUSR,336,4,CH                                                        
DACC_UTK_SPECIAL,341,4,CH                                                       
DACC_UTK_DEFAULT,346,4,CH                                                       
DACC_UTK_UNKNUSR,351,4,CH                                                       
DACC_UTK_ERROR,356,4,CH                                                         
DACC_UTK_TRUSTED,361,4,CH                                                       
DACC_UTK_SESSTYPE,366,8,CH                                                      
DACC_UTK_SURROGAT,375,4,CH                                                      
DACC_UTK_REMOTE,380,4,CH                                                        
DACC_UTK_PRIV,385,4,CH                                                          
DACC_UTK_SECL,390,8,CH                                                          
DACC_UTK_EXECNODE,399,8,CH                                                      
DACC_UTK_SUSER_ID,408,8,CH                                                      
DACC_UTK_SNODE,417,8,CH                                                         
DACC_UTK_SGRP_ID,426,8,CH                                                       
DACC_UTK_SPOE,435,8,CH                                                          
DACC_UTK_SPCLASS,444,8,CH                                                       
DACC_UTK_USER_ID,453,8,CH                                                       
DACC_UTK_GRP_ID,462,8,CH                                                        
DACC_UTK_DFT_GRP,471,4,CH                                                       
DACC_UTK_DFT_SECL,476,4,CH                                                      
DACC_APPC_LINK,481,16,CH                                                        
DACC_AUDIT_CODE,498,11,CH                                                       
DACC_OLD_REAL_UID,510,10,CH                                                     
DACC_OLD_EFF_UID,521,10,CH                                                      
DACC_OLD_SAVED_UID,532,10,CH                                                    
DACC_OLD_REAL_GID,543,10,CH                                                     
DACC_OLD_EFF_GID,554,10,CH                                                      
DACC_OLD_SAVED_GID,565,10,CH                                                    
DACC_PATH_NAME,576,1023,CH                                                      
DACC_FILE_ID,1600,32,CH                                                         
DACC_FILE_OWN_UID,1633,10,CH                                                    
DACC_FILE_OWN_GID,1644,10,CH                                                    
DACC_REQUEST_READ,1655,4,CH                                                     
DACC_REQUEST_WRITE,1660,4,CH                                                    
DACC_REQUEST_EXEC,1665,4,CH                                                     
DACC_REQUEST_DSRCH,1670,4,CH                                                    
DACC_ACCESS_TYPE,1675,8,CH                                                      
DACC_ALLOWED_READ,1684,4,CH                                                     
DACC_ALLOWED_WRITE,1689,4,CH                                                    
DACC_ALLOWED_EXEC,1694,4,CH                                                     
DACC_REQUEST_PATH2,1699,1023,CH                                                 
DACC_SYMLINK,2723,1023,CH                                                       
DACC_FILE_NAME,3747,256,CH                                                      
DACC_PATH_TYPE,4004,4,CH                                                        
DACC_FILEPOOL,4009,8,CH                                                         
DACC_FILESPACE,4018,8,CH                                                        
DACC_INODE,4027,10,CH                                                           
DACC_SCID,4038,10,CH                                                            
DACC_DCE_LINK,4049,16,CH                                                        
DACC_AUTH_TYPE,4066,13,CH                                                       
DACC_DFLT_PROCESS,4080,4,CH                                                     
DACC_UTK_NETW,4085,8,CH                                                         
*------------------------------------------------*                              
*                    FACCESS                     *                              
*------------------------------------------------*                              
FACC_EVENT_TYPE,5,8,CH                                                          
FACC_EVENT_QUAL,14,8,CH                                                         
FACC_TIME_WRITTEN,23,8,CH                                                       
FACC_DATE_WRITTEN,32,10,CH                                                      
FACC_SYSTEM_SMFID,43,4,CH                                                       
FACC_VIOLATION,48,1,CH                                                          
FACC_USER_NDFND,53,1,CH                                                         
FACC_USER_WARNING,58,1,CH                                                       
FACC_EVT_USER_ID,63,8,CH                                                        
FACC_EVT_GRP_ID,72,8,CH                                                         
FACC_AUTH_NORMAL,81,1,CH                                                        
FACC_AUTH_SPECIAL,86,1,CH                                                       
FACC_AUTH_OPER,91,1,CH                                                          
FACC_AUTH_AUDIT,96,1,CH                                                         
FACC_AUTH_EXIT,101,1,CH                                                         
FACC_AUTH_FAILSFT,106,1,CH                                                      
FACC_AUTH_BYPASS,111,1,CH                                                       
FACC_AUTH_TRUSTED,116,1,CH                                                      
FACC_LOG_CLASS,121,1,CH                                                         
FACC_LOG_USER,126,1,CH                                                          
FACC_LOG_SPECIAL,131,1,CH                                                       
FACC_LOG_ACCESS,136,1,CH                                                        
FACC_LOG_RACINIT,141,1,CH                                                       
FACC_LOG_ALWAYS,146,1,CH                                                        
FACC_LOG_CMDVIOL,151,1,CH                                                       
FACC_LOG_GLOBAL,156,1,CH                                                        
FACC_TERM_LEVEL,161,3,CH                                                        
FACC_BACKOUT_FAIL,165,1,CH                                                      
FACC_PROF_SAME,170,1,CH                                                         
FACC_TERM,175,8,CH                                                              
FACC_JOB_NAME,184,8,CH                                                          
FACC_READ_TIME,193,8,CH                                                         
FACC_READ_DATE,202,10,CH                                                        
FACC_SMF_USER_ID,213,8,CH                                                       
FACC_LOG_LEVEL,222,1,CH                                                         
FACC_LOG_VMEVENT,227,1,CH                                                       
FACC_LOG_LOGOPT,232,1,CH                                                        
FACC_LOG_SECL,237,1,CH                                                          
FACC_LOG_COMPATM,242,1,CH                                                       
FACC_LOG_APPLAUD,247,1,CH                                                       
FACC_LOG_NONOMVS,252,1,CH                                                       
FACC_LOG_OMVSNPRV,257,1,CH                                                      
FACC_AUTH_OMVSSU,262,1,CH                                                       
FACC_AUTH_OMVSSYS,267,1,CH                                                      
FACC_USR_SECL,272,8,CH                                                          
FACC_RACF_VERSION,281,4,CH                                                      
FACC_CLASS,286,8,CH                                                             
FACC_USER_NAME,295,20,CH                                                        
FACC_UTK_ENCR,316,4,CH                                                          
FACC_UTK_PRE19,321,4,CH                                                         
FACC_UTK_VERPROF,326,4,CH                                                       
FACC_UTK_NJEUNUSR,331,4,CH                                                      
FACC_UTK_LOGUSR,336,4,CH                                                        
FACC_UTK_SPECIAL,341,4,CH                                                       
FACC_UTK_DEFAULT,346,4,CH                                                       
FACC_UTK_UNKNUSR,351,4,CH                                                       
FACC_UTK_ERROR,356,4,CH                                                         
FACC_UTK_TRUSTED,361,4,CH                                                       
FACC_UTK_SESSTYPE,366,8,CH                                                      
FACC_UTK_SURROGAT,375,4,CH                                                      
FACC_UTK_REMOTE,380,4,CH                                                        
FACC_UTK_PRIV,385,4,CH                                                          
FACC_UTK_SECL,390,8,CH                                                          
FACC_UTK_EXECNODE,399,8,CH                                                      
FACC_UTK_SUSER_ID,408,8,CH                                                      
FACC_UTK_SNODE,417,8,CH                                                         
FACC_UTK_SGRP_ID,426,8,CH                                                       
FACC_UTK_SPOE,435,8,CH                                                          
FACC_UTK_SPCLASS,444,8,CH                                                       
FACC_UTK_USER_ID,453,8,CH                                                       
FACC_UTK_GRP_ID,462,8,CH                                                        
FACC_UTK_DFT_GRP,471,4,CH                                                       
FACC_UTK_DFT_SECL,476,4,CH                                                      
FACC_APPC_LINK,481,16,CH                                                        
FACC_AUDIT_CODE,498,11,CH                                                       
FACC_OLD_REAL_UID,510,10,CH                                                     
FACC_OLD_EFF_UID,521,10,CH                                                      
FACC_OLD_SAVED_UID,532,10,CH                                                    
FACC_OLD_REAL_GID,543,10,CH                                                     
FACC_OLD_EFF_GID,554,10,CH                                                      
FACC_OLD_SAVED_GID,565,10,CH                                                    
FACC_PATH_NAME,576,1023,CH                                                      
FACC_FILE_ID,1600,32,CH                                                         
FACC_FILE_OWN_UID,1633,10,CH                                                    
FACC_FILE_OWN_GID,1644,10,CH                                                    
FACC_REQUEST_READ,1655,4,CH                                                     
FACC_REQUEST_WRITE,1660,4,CH                                                    
FACC_REQUEST_EXEC,1665,4,CH                                                     
FACC_REQUEST_DSRCH,1670,4,CH                                                    
FACC_ACCESS_TYPE,1675,8,CH                                                      
FACC_ALLOWED_READ,1684,4,CH                                                     
FACC_ALLOWED_WRITE,1689,4,CH                                                    
FACC_ALLOWED_EXEC,1694,4,CH                                                     
FACC_REQUEST_PATH2,1699,1023,CH                                                 
FACC_FILE_NAME,2723,256,CH                                                      
FACC_PATH_TYPE,2980,4,CH                                                        
FACC_FILEPOOL,2985,8,CH                                                         
FACC_FILESPACE,2994,8,CH                                                        
FACC_INODE,3003,10,CH                                                           
FACC_SCID,3014,10,CH                                                            
FACC_DCE_LINK,3025,16,CH                                                        
FACC_AUTH_TYPE,3042,13,CH                                                       
FACC_DFLT_PROCESS,3056,4,CH                                                     
FACC_UTK_NETW,3061,8,CH                                                         
*------------------------------------------------*                              
*                    CHAUDIT                     *                              
*------------------------------------------------*                              
CAUD_EVENT_TYPE,5,8,CH                                                          
CAUD_EVENT_QUAL,14,8,CH                                                         
CAUD_TIME_WRITTEN,23,8,CH                                                       
CAUD_DATE_WRITTEN,32,10,CH                                                      
CAUD_SYSTEM_SMFID,43,4,CH                                                       
CAUD_VIOLATION,48,1,CH                                                          
CAUD_USER_NDFND,53,1,CH                                                         
CAUD_USER_WARNING,58,1,CH                                                       
CAUD_EVT_USER_ID,63,8,CH                                                        
CAUD_EVT_GRP_ID,72,8,CH                                                         
CAUD_AUTH_NORMAL,81,1,CH                                                        
CAUD_AUTH_SPECIAL,86,1,CH                                                       
CAUD_AUTH_OPER,91,1,CH                                                          
CAUD_AUTH_AUDIT,96,1,CH                                                         
CAUD_AUTH_EXIT,101,1,CH                                                         
CAUD_AUTH_FAILSFT,106,1,CH                                                      
CAUD_AUTH_BYPASS,111,1,CH                                                       
CAUD_AUTH_TRUSTED,116,1,CH                                                      
CAUD_LOG_CLASS,121,1,CH                                                         
CAUD_LOG_USER,126,1,CH                                                          
CAUD_LOG_SPECIAL,131,1,CH                                                       
CAUD_LOG_ACCESS,136,1,CH                                                        
CAUD_LOG_RACINIT,141,1,CH                                                       
CAUD_LOG_ALWAYS,146,1,CH                                                        
CAUD_LOG_CMDVIOL,151,1,CH                                                       
CAUD_LOG_GLOBAL,156,1,CH                                                        
CAUD_TERM_LEVEL,161,3,CH                                                        
CAUD_BACKOUT_FAIL,165,1,CH                                                      
CAUD_PROF_SAME,170,1,CH                                                         
CAUD_TERM,175,8,CH                                                              
CAUD_JOB_NAME,184,8,CH                                                          
CAUD_READ_TIME,193,8,CH                                                         
CAUD_READ_DATE,202,10,CH                                                        
CAUD_SMF_USER_ID,213,8,CH                                                       
CAUD_LOG_LEVEL,222,1,CH                                                         
CAUD_LOG_VMEVENT,227,1,CH                                                       
CAUD_LOG_LOGOPT,232,1,CH                                                        
CAUD_LOG_SECL,237,1,CH                                                          
CAUD_LOG_COMPATM,242,1,CH                                                       
CAUD_LOG_APPLAUD,247,1,CH                                                       
CAUD_LOG_NONOMVS,252,1,CH                                                       
CAUD_LOG_OMVSNPRV,257,1,CH                                                      
CAUD_AUTH_OMVSSU,262,1,CH                                                       
CAUD_AUTH_OMVSSYS,267,1,CH                                                      
CAUD_USR_SECL,272,8,CH                                                          
CAUD_RACF_VERSION,281,4,CH                                                      
CAUD_CLASS,286,8,CH                                                             
CAUD_USER_NAME,295,20,CH                                                        
CAUD_UTK_ENCR,316,4,CH                                                          
CAUD_UTK_PRE19,321,4,CH                                                         
CAUD_UTK_VERPROF,326,4,CH                                                       
CAUD_UTK_NJEUNUSR,331,4,CH                                                      
CAUD_UTK_LOGUSR,336,4,CH                                                        
CAUD_UTK_SPECIAL,341,4,CH                                                       
CAUD_UTK_DEFAULT,346,4,CH                                                       
CAUD_UTK_UNKNUSR,351,4,CH                                                       
CAUD_UTK_ERROR,356,4,CH                                                         
CAUD_UTK_TRUSTED,361,4,CH                                                       
CAUD_UTK_SESSTYPE,366,8,CH                                                      
CAUD_UTK_SURROGAT,375,4,CH                                                      
CAUD_UTK_REMOTE,380,4,CH                                                        
CAUD_UTK_PRIV,385,4,CH                                                          
CAUD_UTK_SECL,390,8,CH                                                          
CAUD_UTK_EXECNODE,399,8,CH                                                      
CAUD_UTK_SUSER_ID,408,8,CH                                                      
CAUD_UTK_SNODE,417,8,CH                                                         
CAUD_UTK_SGRP_ID,426,8,CH                                                       
CAUD_UTK_SPOE,435,8,CH                                                          
CAUD_UTK_SPCLASS,444,8,CH                                                       
CAUD_UTK_USER_ID,453,8,CH                                                       
CAUD_UTK_GRP_ID,462,8,CH                                                        
CAUD_UTK_DFT_GRP,471,4,CH                                                       
CAUD_UTK_DFT_SECL,476,4,CH                                                      
CAUD_APPC_LINK,481,16,CH                                                        
CAUD_AUDIT_CODE,498,11,CH                                                       
CAUD_OLD_REAL_UID,510,10,CH                                                     
CAUD_OLD_EFF_UID,521,10,CH                                                      
CAUD_OLD_SAVED_UID,532,10,CH                                                    
CAUD_OLD_REAL_GID,543,10,CH                                                     
CAUD_OLD_EFF_GID,554,10,CH                                                      
CAUD_OLD_SAVED_GID,565,10,CH                                                    
CAUD_PATH_NAME,576,1023,CH                                                      
CAUD_FILE_ID,1600,32,CH                                                         
CAUD_FILE_OWN_UID,1633,10,CH                                                    
CAUD_FILE_OWN_GID,1644,10,CH                                                    
CAUD_REQUEST_READ,1655,8,CH                                                     
CAUD_REQUEST_WRITE,1664,8,CH                                                    
CAUD_REQUEST_EXEC,1673,8,CH                                                     
CAUD_UOLD_READ,1682,8,CH                                                        
CAUD_UOLD_WRITE,1691,8,CH                                                       
CAUD_UOLD_EXEC,1700,8,CH                                                        
CAUD_AOLD_READ,1709,8,CH                                                        
CAUD_AOLD_WRITE,1718,8,CH                                                       
CAUD_AOLD_EXEC,1727,8,CH                                                        
CAUD_UNEW_READ,1736,8,CH                                                        
CAUD_UNEW_WRITE,1745,8,CH                                                       
CAUD_UNEW_EXEC,1754,8,CH                                                        
CAUD_ANEW_READ,1763,8,CH                                                        
CAUD_ANEW_WRITE,1772,8,CH                                                       
CAUD_ANEW_EXEC,1781,8,CH                                                        
CAUD_FILEPOOL,1790,8,CH                                                         
CAUD_FILESPACE,1799,8,CH                                                        
CAUD_INODE,1808,10,CH                                                           
CAUD_SCID,1819,10,CH                                                            
CAUD_DCE_LINK,1830,16,CH                                                        
CAUD_AUTH_TYPE,1847,13,CH                                                       
CAUD_DFLT_PROCESS,1861,4,CH                                                     
CAUD_UTK_NETW,1866,8,CH                                                         
*------------------------------------------------*                              
*                     CHDIR                      *                              
*------------------------------------------------*                              
CDIR_EVENT_TYPE,5,8,CH                                                          
CDIR_EVENT_QUAL,14,8,CH                                                         
CDIR_TIME_WRITTEN,23,8,CH                                                       
CDIR_DATE_WRITTEN,32,10,CH                                                      
CDIR_SYSTEM_SMFID,43,4,CH                                                       
CDIR_VIOLATION,48,1,CH                                                          
CDIR_USER_NDFND,53,1,CH                                                         
CDIR_USER_WARNING,58,1,CH                                                       
CDIR_EVT_USER_ID,63,8,CH                                                        
CDIR_EVT_GRP_ID,72,8,CH                                                         
CDIR_AUTH_NORMAL,81,1,CH                                                        
CDIR_AUTH_SPECIAL,86,1,CH                                                       
CDIR_AUTH_OPER,91,1,CH                                                          
CDIR_AUTH_AUDIT,96,1,CH                                                         
CDIR_AUTH_EXIT,101,1,CH                                                         
CDIR_AUTH_FAILSFT,106,1,CH                                                      
CDIR_AUTH_BYPASS,111,1,CH                                                       
CDIR_AUTH_TRUSTED,116,1,CH                                                      
CDIR_LOG_CLASS,121,1,CH                                                         
CDIR_LOG_USER,126,1,CH                                                          
CDIR_LOG_SPECIAL,131,1,CH                                                       
CDIR_LOG_ACCESS,136,1,CH                                                        
CDIR_LOG_RACINIT,141,1,CH                                                       
CDIR_LOG_ALWAYS,146,1,CH                                                        
CDIR_LOG_CMDVIOL,151,1,CH                                                       
CDIR_LOG_GLOBAL,156,1,CH                                                        
CDIR_TERM_LEVEL,161,3,CH                                                        
CDIR_BACKOUT_FAIL,165,1,CH                                                      
CDIR_PROF_SAME,170,1,CH                                                         
CDIR_TERM,175,8,CH                                                              
CDIR_JOB_NAME,184,8,CH                                                          
CDIR_READ_TIME,193,8,CH                                                         
CDIR_READ_DATE,202,10,CH                                                        
CDIR_SMF_USER_ID,213,8,CH                                                       
CDIR_LOG_LEVEL,222,1,CH                                                         
CDIR_LOG_VMEVENT,227,1,CH                                                       
CDIR_LOG_LOGOPT,232,1,CH                                                        
CDIR_LOG_SECL,237,1,CH                                                          
CDIR_LOG_COMPATM,242,1,CH                                                       
CDIR_LOG_APPLAUD,247,1,CH                                                       
CDIR_LOG_NONOMVS,252,1,CH                                                       
CDIR_LOG_OMVSNPRV,257,1,CH                                                      
CDIR_AUTH_OMVSSU,262,1,CH                                                       
CDIR_AUTH_OMVSSYS,267,1,CH                                                      
CDIR_USR_SECL,272,8,CH                                                          
CDIR_RACF_VERSION,281,4,CH                                                      
CDIR_CLASS,286,8,CH                                                             
CDIR_USER_NAME,295,20,CH                                                        
CDIR_UTK_ENCR,316,4,CH                                                          
CDIR_UTK_PRE19,321,4,CH                                                         
CDIR_UTK_VERPROF,326,4,CH                                                       
CDIR_UTK_NJEUNUSR,331,4,CH                                                      
CDIR_UTK_LOGUSR,336,4,CH                                                        
CDIR_UTK_SPECIAL,341,4,CH                                                       
CDIR_UTK_DEFAULT,346,4,CH                                                       
CDIR_UTK_UNKNUSR,351,4,CH                                                       
CDIR_UTK_ERROR,356,4,CH                                                         
CDIR_UTK_TRUSTED,361,4,CH                                                       
CDIR_UTK_SESSTYPE,366,8,CH                                                      
CDIR_UTK_SURROGAT,375,4,CH                                                      
CDIR_UTK_REMOTE,380,4,CH                                                        
CDIR_UTK_PRIV,385,4,CH                                                          
CDIR_UTK_SECL,390,8,CH                                                          
CDIR_UTK_EXECNODE,399,8,CH                                                      
CDIR_UTK_SUSER_ID,408,8,CH                                                      
CDIR_UTK_SNODE,417,8,CH                                                         
CDIR_UTK_SGRP_ID,426,8,CH                                                       
CDIR_UTK_SPOE,435,8,CH                                                          
CDIR_UTK_SPCLASS,444,8,CH                                                       
CDIR_UTK_USER_ID,453,8,CH                                                       
CDIR_UTK_GRP_ID,462,8,CH                                                        
CDIR_UTK_DFT_GRP,471,4,CH                                                       
CDIR_UTK_DFT_SECL,476,4,CH                                                      
CDIR_APPC_LINK,481,16,CH                                                        
CDIR_AUDIT_CODE,498,11,CH                                                       
CDIR_OLD_REAL_UID,510,10,CH                                                     
CDIR_OLD_EFF_UID,521,10,CH                                                      
CDIR_OLD_SAVED_UID,532,10,CH                                                    
CDIR_OLD_REAL_GID,543,10,CH                                                     
CDIR_OLD_EFF_GID,554,10,CH                                                      
CDIR_OLD_SAVED_GID,565,10,CH                                                    
CDIR_PATH_NAME,576,1023,CH                                                      
CDIR_FILE_ID,1600,32,CH                                                         
CDIR_FILE_OWN_UID,1633,10,CH                                                    
CDIR_FILE_OWN_GID,1644,10,CH                                                    
CDIR_DCE_LINK,1655,16,CH                                                        
CDIR_AUTH_TYPE,1672,13,CH                                                       
CDIR_DFLT_PROCESS,1686,4,CH                                                     
CDIR_UTK_NETW,1691,8,CH                                                         
*------------------------------------------------*                              
*                     CHMOD                      *                              
*------------------------------------------------*                              
CMOD_EVENT_TYPE,5,8,CH                                                          
CMOD_EVENT_QUAL,14,8,CH                                                         
CMOD_TIME_WRITTEN,23,8,CH                                                       
CMOD_DATE_WRITTEN,32,10,CH                                                      
CMOD_SYSTEM_SMFID,43,4,CH                                                       
CMOD_VIOLATION,48,1,CH                                                          
CMOD_USER_NDFND,53,1,CH                                                         
CMOD_USER_WARNING,58,1,CH                                                       
CMOD_EVT_USER_ID,63,8,CH                                                        
CMOD_EVT_GRP_ID,72,8,CH                                                         
CMOD_AUTH_NORMAL,81,1,CH                                                        
CMOD_AUTH_SPECIAL,86,1,CH                                                       
CMOD_AUTH_OPER,91,1,CH                                                          
CMOD_AUTH_AUDIT,96,1,CH                                                         
CMOD_AUTH_EXIT,101,1,CH                                                         
CMOD_AUTH_FAILSFT,106,1,CH                                                      
CMOD_AUTH_BYPASS,111,1,CH                                                       
CMOD_AUTH_TRUSTED,116,1,CH                                                      
CMOD_LOG_CLASS,121,1,CH                                                         
CMOD_LOG_USER,126,1,CH                                                          
CMOD_LOG_SPECIAL,131,1,CH                                                       
CMOD_LOG_ACCESS,136,1,CH                                                        
CMOD_LOG_RACINIT,141,1,CH                                                       
CMOD_LOG_ALWAYS,146,1,CH                                                        
CMOD_LOG_CMDVIOL,151,1,CH                                                       
CMOD_LOG_GLOBAL,156,1,CH                                                        
CMOD_TERM_LEVEL,161,3,CH                                                        
CMOD_BACKOUT_FAIL,165,1,CH                                                      
CMOD_PROF_SAME,170,1,CH                                                         
CMOD_TERM,175,8,CH                                                              
CMOD_JOB_NAME,184,8,CH                                                          
CMOD_READ_TIME,193,8,CH                                                         
CMOD_READ_DATE,202,10,CH                                                        
CMOD_SMF_USER_ID,213,8,CH                                                       
CMOD_LOG_LEVEL,222,1,CH                                                         
CMOD_LOG_VMEVENT,227,1,CH                                                       
CMOD_LOG_LOGOPT,232,1,CH                                                        
CMOD_LOG_SECL,237,1,CH                                                          
CMOD_LOG_COMPATM,242,1,CH                                                       
CMOD_LOG_APPLAUD,247,1,CH                                                       
CMOD_LOG_NONOMVS,252,1,CH                                                       
CMOD_LOG_OMVSNPRV,257,1,CH                                                      
CMOD_AUTH_OMVSSU,262,1,CH                                                       
CMOD_AUTH_OMVSSYS,267,1,CH                                                      
CMOD_USR_SECL,272,8,CH                                                          
CMOD_RACF_VERSION,281,4,CH                                                      
CMOD_CLASS,286,8,CH                                                             
CMOD_USER_NAME,295,20,CH                                                        
CMOD_UTK_ENCR,316,4,CH                                                          
CMOD_UTK_PRE19,321,4,CH                                                         
CMOD_UTK_VERPROF,326,4,CH                                                       
CMOD_UTK_NJEUNUSR,331,4,CH                                                      
CMOD_UTK_LOGUSR,336,4,CH                                                        
CMOD_UTK_SPECIAL,341,4,CH                                                       
CMOD_UTK_DEFAULT,346,4,CH                                                       
CMOD_UTK_UNKNUSR,351,4,CH                                                       
CMOD_UTK_ERROR,356,4,CH                                                         
CMOD_UTK_TRUSTED,361,4,CH                                                       
CMOD_UTK_SESSTYPE,366,8,CH                                                      
CMOD_UTK_SURROGAT,375,4,CH                                                      
CMOD_UTK_REMOTE,380,4,CH                                                        
CMOD_UTK_PRIV,385,4,CH                                                          
CMOD_UTK_SECL,390,8,CH                                                          
CMOD_UTK_EXECNODE,399,8,CH                                                      
CMOD_UTK_SUSER_ID,408,8,CH                                                      
CMOD_UTK_SNODE,417,8,CH                                                         
CMOD_UTK_SGRP_ID,426,8,CH                                                       
CMOD_UTK_SPOE,435,8,CH                                                          
CMOD_UTK_SPCLASS,444,8,CH                                                       
CMOD_UTK_USER_ID,453,8,CH                                                       
CMOD_UTK_GRP_ID,462,8,CH                                                        
CMOD_UTK_DFT_GRP,471,4,CH                                                       
CMOD_UTK_DFT_SECL,476,4,CH                                                      
CMOD_APPC_LINK,481,16,CH                                                        
CMOD_AUDIT_CODE,498,11,CH                                                       
CMOD_OLD_REAL_UID,510,10,CH                                                     
CMOD_OLD_EFF_UID,521,10,CH                                                      
CMOD_OLD_SAVED_UID,532,10,CH                                                    
CMOD_OLD_REAL_GID,543,10,CH                                                     
CMOD_OLD_EFF_GID,554,10,CH                                                      
CMOD_OLD_SAVED_GID,565,10,CH                                                    
CMOD_PATH_NAME,576,1023,CH                                                      
CMOD_FILE_ID,1600,32,CH                                                         
CMOD_FILE_OWN_UID,1633,10,CH                                                    
CMOD_FILE_OWN_GID,1644,10,CH                                                    
CMOD_OLD_S_ISGID,1655,4,CH                                                      
CMOD_OLD_S_ISUID,1660,4,CH                                                      
CMOD_OLD_S_ISVTX,1665,4,CH                                                      
CMOD_OLD_OWN_READ,1670,4,CH                                                     
CMOD_OLD_OWN_WRITE,1675,4,CH                                                    
CMOD_OLD_OWN_EXEC,1680,4,CH                                                     
CMOD_OLD_GRP_READ,1685,4,CH                                                     
CMOD_OLD_GRP_WRITE,1690,4,CH                                                    
CMOD_OLD_GRP_EXEC,1695,4,CH                                                     
CMOD_OLD_OTH_READ,1700,4,CH                                                     
CMOD_OLD_OTH_WRITE,1705,4,CH                                                    
CMOD_OLD_OTH_EXEC,1710,4,CH                                                     
CMOD_NEW_S_ISGID,1715,4,CH                                                      
CMOD_NEW_S_ISUID,1720,4,CH                                                      
CMOD_NEW_S_ISVTX,1725,4,CH                                                      
CMOD_NEW_OWN_READ,1730,4,CH                                                     
CMOD_NEW_OWN_WRITE,1735,4,CH                                                    
CMOD_NEW_OWN_EXEC,1740,4,CH                                                     
CMOD_NEW_GRP_READ,1745,4,CH                                                     
CMOD_NEW_GRP_WRITE,1750,4,CH                                                    
CMOD_NEW_GRP_EXEC,1755,4,CH                                                     
CMOD_NEW_OTH_READ,1760,4,CH                                                     
CMOD_NEW_OTH_WRITE,1765,4,CH                                                    
CMOD_NEW_OTH_EXEC,1770,4,CH                                                     
CMOD_REQ_S_ISGID,1775,4,CH                                                      
CMOD_REQ_S_ISUID,1780,4,CH                                                      
CMOD_REQ_S_ISVTX,1785,4,CH                                                      
CMOD_REQ_OWN_READ,1790,4,CH                                                     
CMOD_REQ_OWN_WRITE,1795,4,CH                                                    
CMOD_REQ_OWN_EXEC,1800,4,CH                                                     
CMOD_REQ_GRP_READ,1805,4,CH                                                     
CMOD_REQ_GRP_WRITE,1810,4,CH                                                    
CMOD_REQ_GRP_EXEC,1815,4,CH                                                     
CMOD_REQ_OTH_READ,1820,4,CH                                                     
CMOD_REQ_OTH_WRITE,1825,4,CH                                                    
CMOD_REQ_OTH_EXEC,1830,4,CH                                                     
CMOD_FILEPOOL,1835,8,CH                                                         
CMOD_FILESPACE,1844,8,CH                                                        
CMOD_INODE,1853,10,CH                                                           
CMOD_SCID,1864,10,CH                                                            
CMOD_DCE_LINK,1875,16,CH                                                        
CMOD_AUTH_TYPE,1892,13,CH                                                       
CMOD_DFLT_PROCESS,1906,4,CH                                                     
CMOD_UTK_NETW,1911,8,CH                                                         
*------------------------------------------------*                              
*                     CHOWN                      *                              
*------------------------------------------------*                              
COWN_EVENT_TYPE,5,8,CH                                                          
COWN_EVENT_QUAL,14,8,CH                                                         
COWN_TIME_WRITTEN,23,8,CH                                                       
COWN_DATE_WRITTEN,32,10,CH                                                      
COWN_SYSTEM_SMFID,43,4,CH                                                       
COWN_VIOLATION,48,1,CH                                                          
COWN_USER_NDFND,53,1,CH                                                         
COWN_USER_WARNING,58,1,CH                                                       
COWN_EVT_USER_ID,63,8,CH                                                        
COWN_EVT_GRP_ID,72,8,CH                                                         
COWN_AUTH_NORMAL,81,1,CH                                                        
COWN_AUTH_SPECIAL,86,1,CH                                                       
COWN_AUTH_OPER,91,1,CH                                                          
COWN_AUTH_AUDIT,96,1,CH                                                         
COWN_AUTH_EXIT,101,1,CH                                                         
COWN_AUTH_FAILSFT,106,1,CH                                                      
COWN_AUTH_BYPASS,111,1,CH                                                       
COWN_AUTH_TRUSTED,116,1,CH                                                      
COWN_LOG_CLASS,121,1,CH                                                         
COWN_LOG_USER,126,1,CH                                                          
COWN_LOG_SPECIAL,131,1,CH                                                       
COWN_LOG_ACCESS,136,1,CH                                                        
COWN_LOG_RACINIT,141,1,CH                                                       
COWN_LOG_ALWAYS,146,1,CH                                                        
COWN_LOG_CMDVIOL,151,1,CH                                                       
COWN_LOG_GLOBAL,156,1,CH                                                        
COWN_TERM_LEVEL,161,3,CH                                                        
COWN_BACKOUT_FAIL,165,1,CH                                                      
COWN_PROF_SAME,170,1,CH                                                         
COWN_TERM,175,8,CH                                                              
COWN_JOB_NAME,184,8,CH                                                          
COWN_READ_TIME,193,8,CH                                                         
COWN_READ_DATE,202,10,CH                                                        
COWN_SMF_USER_ID,213,8,CH                                                       
COWN_LOG_LEVEL,222,1,CH                                                         
COWN_LOG_VMEVENT,227,1,CH                                                       
COWN_LOG_LOGOPT,232,1,CH                                                        
COWN_LOG_SECL,237,1,CH                                                          
COWN_LOG_COMPATM,242,1,CH                                                       
COWN_LOG_APPLAUD,247,1,CH                                                       
COWN_LOG_NONOMVS,252,1,CH                                                       
COWN_LOG_OMVSNPRV,257,1,CH                                                      
COWN_AUTH_OMVSSU,262,1,CH                                                       
COWN_AUTH_OMVSSYS,267,1,CH                                                      
COWN_USR_SECL,272,8,CH                                                          
COWN_RACF_VERSION,281,4,CH                                                      
COWN_CLASS,286,8,CH                                                             
COWN_USER_NAME,295,20,CH                                                        
COWN_UTK_ENCR,316,4,CH                                                          
COWN_UTK_PRE19,321,4,CH                                                         
COWN_UTK_VERPROF,326,4,CH                                                       
COWN_UTK_NJEUNUSR,331,4,CH                                                      
COWN_UTK_LOGUSR,336,4,CH                                                        
COWN_UTK_SPECIAL,341,4,CH                                                       
COWN_UTK_DEFAULT,346,4,CH                                                       
COWN_UTK_UNKNUSR,351,4,CH                                                       
COWN_UTK_ERROR,356,4,CH                                                         
COWN_UTK_TRUSTED,361,4,CH                                                       
COWN_UTK_SESSTYPE,366,8,CH                                                      
COWN_UTK_SURROGAT,375,4,CH                                                      
COWN_UTK_REMOTE,380,4,CH                                                        
COWN_UTK_PRIV,385,4,CH                                                          
COWN_UTK_SECL,390,8,CH                                                          
COWN_UTK_EXECNODE,399,8,CH                                                      
COWN_UTK_SUSER_ID,408,8,CH                                                      
COWN_UTK_SNODE,417,8,CH                                                         
COWN_UTK_SGRP_ID,426,8,CH                                                       
COWN_UTK_SPOE,435,8,CH                                                          
COWN_UTK_SPCLASS,444,8,CH                                                       
COWN_UTK_USER_ID,453,8,CH                                                       
COWN_UTK_GRP_ID,462,8,CH                                                        
COWN_UTK_DFT_GRP,471,4,CH                                                       
COWN_UTK_DFT_SECL,476,4,CH                                                      
COWN_APPC_LINK,481,16,CH                                                        
COWN_AUDIT_CODE,498,11,CH                                                       
COWN_OLD_REAL_UID,510,10,CH                                                     
COWN_OLD_EFF_UID,521,10,CH                                                      
COWN_OLD_SAVED_UID,532,10,CH                                                    
COWN_OLD_REAL_GID,543,10,CH                                                     
COWN_OLD_EFF_GID,554,10,CH                                                      
COWN_OLD_SAVED_GID,565,10,CH                                                    
COWN_PATH_NAME,576,1023,CH                                                      
COWN_FILE_ID,1600,32,CH                                                         
COWN_FILE_OWN_UID,1633,10,CH                                                    
COWN_FILE_OWN_GID,1644,10,CH                                                    
COWN_UID,1655,10,CH                                                             
COWN_GID,1666,10,CH                                                             
COWN_FILEPOOL,1677,8,CH                                                         
COWN_FILESPACE,1686,8,CH                                                        
COWN_INODE,1695,10,CH                                                           
COWN_SCID,1706,10,CH                                                            
COWN_DCE_LINK,1717,16,CH                                                        
COWN_AUTH_TYPE,1734,13,CH                                                       
COWN_DFLT_PROCESS,1748,4,CH                                                     
COWN_UTK_NETW,1753,8,CH                                                         
*------------------------------------------------*                              
*                    CLRSETID                    *                              
*------------------------------------------------*                              
CSID_EVENT_TYPE,5,8,CH                                                          
CSID_EVENT_QUAL,14,8,CH                                                         
CSID_TIME_WRITTEN,23,8,CH                                                       
CSID_DATE_WRITTEN,32,10,CH                                                      
CSID_SYSTEM_SMFID,43,4,CH                                                       
CSID_VIOLATION,48,1,CH                                                          
CSID_USER_NDFND,53,1,CH                                                         
CSID_USER_WARNING,58,1,CH                                                       
CSID_EVT_USER_ID,63,8,CH                                                        
CSID_EVT_GRP_ID,72,8,CH                                                         
CSID_AUTH_NORMAL,81,1,CH                                                        
CSID_AUTH_SPECIAL,86,1,CH                                                       
CSID_AUTH_OPER,91,1,CH                                                          
CSID_AUTH_AUDIT,96,1,CH                                                         
CSID_AUTH_EXIT,101,1,CH                                                         
CSID_AUTH_FAILSFT,106,1,CH                                                      
CSID_AUTH_BYPASS,111,1,CH                                                       
CSID_AUTH_TRUSTED,116,1,CH                                                      
CSID_LOG_CLASS,121,1,CH                                                         
CSID_LOG_USER,126,1,CH                                                          
CSID_LOG_SPECIAL,131,1,CH                                                       
CSID_LOG_ACCESS,136,1,CH                                                        
CSID_LOG_RACINIT,141,1,CH                                                       
CSID_LOG_ALWAYS,146,1,CH                                                        
CSID_LOG_CMDVIOL,151,1,CH                                                       
CSID_LOG_GLOBAL,156,1,CH                                                        
CSID_TERM_LEVEL,161,3,CH                                                        
CSID_BACKOUT_FAIL,165,1,CH                                                      
CSID_PROF_SAME,170,1,CH                                                         
CSID_TERM,175,8,CH                                                              
CSID_JOB_NAME,184,8,CH                                                          
CSID_READ_TIME,193,8,CH                                                         
CSID_READ_DATE,202,10,CH                                                        
CSID_SMF_USER_ID,213,8,CH                                                       
CSID_LOG_LEVEL,222,1,CH                                                         
CSID_LOG_VMEVENT,227,1,CH                                                       
CSID_LOG_LOGOPT,232,1,CH                                                        
CSID_LOG_SECL,237,1,CH                                                          
CSID_LOG_COMPATM,242,1,CH                                                       
CSID_LOG_APPLAUD,247,1,CH                                                       
CSID_LOG_NONOMVS,252,1,CH                                                       
CSID_LOG_OMVSNPRV,257,1,CH                                                      
CSID_AUTH_OMVSSU,262,1,CH                                                       
CSID_AUTH_OMVSSYS,267,1,CH                                                      
CSID_USR_SECL,272,8,CH                                                          
CSID_RACF_VERSION,281,4,CH                                                      
CSID_CLASS,286,8,CH                                                             
CSID_USER_NAME,295,20,CH                                                        
CSID_UTK_ENCR,316,4,CH                                                          
CSID_UTK_PRE19,321,4,CH                                                         
CSID_UTK_VERPROF,326,4,CH                                                       
CSID_UTK_NJEUNUSR,331,4,CH                                                      
CSID_UTK_LOGUSR,336,4,CH                                                        
CSID_UTK_SPECIAL,341,4,CH                                                       
CSID_UTK_DEFAULT,346,4,CH                                                       
CSID_UTK_UNKNUSR,351,4,CH                                                       
CSID_UTK_ERROR,356,4,CH                                                         
CSID_UTK_TRUSTED,361,4,CH                                                       
CSID_UTK_SESSTYPE,366,8,CH                                                      
CSID_UTK_SURROGAT,375,4,CH                                                      
CSID_UTK_REMOTE,380,4,CH                                                        
CSID_UTK_PRIV,385,4,CH                                                          
CSID_UTK_SECL,390,8,CH                                                          
CSID_UTK_EXECNODE,399,8,CH                                                      
CSID_UTK_SUSER_ID,408,8,CH                                                      
CSID_UTK_SNODE,417,8,CH                                                         
CSID_UTK_SGRP_ID,426,8,CH                                                       
CSID_UTK_SPOE,435,8,CH                                                          
CSID_UTK_SPCLASS,444,8,CH                                                       
CSID_UTK_USER_ID,453,8,CH                                                       
CSID_UTK_GRP_ID,462,8,CH                                                        
CSID_UTK_DFT_GRP,471,4,CH                                                       
CSID_UTK_DFT_SECL,476,4,CH                                                      
CSID_APPC_LINK,481,16,CH                                                        
CSID_AUDIT_CODE,498,11,CH                                                       
CSID_OLD_REAL_UID,510,10,CH                                                     
CSID_OLD_EFF_UID,521,10,CH                                                      
CSID_OLD_SAVED_UID,532,10,CH                                                    
CSID_OLD_REAL_GID,543,10,CH                                                     
CSID_OLD_EFF_GID,554,10,CH                                                      
CSID_OLD_SAVED_GID,565,10,CH                                                    
CSID_PATH_NAME,576,1023,CH                                                      
CSID_FILE_ID,1600,32,CH                                                         
CSID_FILE_OWN_UID,1633,10,CH                                                    
CSID_FILE_OWN_GID,1644,10,CH                                                    
CSID_OLD_S_ISGID,1655,4,CH                                                      
CSID_OLD_S_ISUID,1660,4,CH                                                      
CSID_OLD_S_ISVTX,1665,4,CH                                                      
CSID_OLD_OWN_READ,1670,4,CH                                                     
CSID_OLD_OWN_WRITE,1675,4,CH                                                    
CSID_OLD_OWN_EXEC,1680,4,CH                                                     
CSID_OLD_GRP_READ,1685,4,CH                                                     
CSID_OLD_GRP_WRITE,1690,4,CH                                                    
CSID_OLD_GRP_EXEC,1695,4,CH                                                     
CSID_OLD_OTH_READ,1700,4,CH                                                     
CSID_OLD_OTH_WRITE,1705,4,CH                                                    
CSID_OLD_OTH_EXEC,1710,4,CH                                                     
CSID_NEW_S_ISGID,1715,4,CH                                                      
CSID_NEW_S_ISUID,1720,4,CH                                                      
CSID_NEW_S_ISVTX,1725,4,CH                                                      
CSID_NEW_OWN_READ,1730,4,CH                                                     
CSID_NEW_OWN_WRITE,1735,4,CH                                                    
CSID_NEW_OWN_EXEC,1740,4,CH                                                     
CSID_NEW_GRP_READ,1745,4,CH                                                     
CSID_NEW_GRP_WRITE,1750,4,CH                                                    
CSID_NEW_GRP_EXEC,1755,4,CH                                                     
CSID_NEW_OTH_READ,1760,4,CH                                                     
CSID_NEW_OTH_WRITE,1765,4,CH                                                    
CSID_NEW_OTH_EXEC,1770,4,CH                                                     
CSID_DFLT_PROCESS,1775,4,CH                                                     
CSID_UTK_NETW,1780,8,CH                                                         
*------------------------------------------------*                              
*                    EXESETID                    *                              
*------------------------------------------------*                              
ESID_EVENT_TYPE,5,8,CH                                                          
ESID_EVENT_QUAL,14,8,CH                                                         
ESID_TIME_WRITTEN,23,8,CH                                                       
ESID_DATE_WRITTEN,32,10,CH                                                      
ESID_SYSTEM_SMFID,43,4,CH                                                       
ESID_VIOLATION,48,1,CH                                                          
ESID_USER_NDFND,53,1,CH                                                         
ESID_USER_WARNING,58,1,CH                                                       
ESID_EVT_USER_ID,63,8,CH                                                        
ESID_EVT_GRP_ID,72,8,CH                                                         
ESID_AUTH_NORMAL,81,1,CH                                                        
ESID_AUTH_SPECIAL,86,1,CH                                                       
ESID_AUTH_OPER,91,1,CH                                                          
ESID_AUTH_AUDIT,96,1,CH                                                         
ESID_AUTH_EXIT,101,1,CH                                                         
ESID_AUTH_FAILSFT,106,1,CH                                                      
ESID_AUTH_BYPASS,111,1,CH                                                       
ESID_AUTH_TRUSTED,116,1,CH                                                      
ESID_LOG_CLASS,121,1,CH                                                         
ESID_LOG_USER,126,1,CH                                                          
ESID_LOG_SPECIAL,131,1,CH                                                       
ESID_LOG_ACCESS,136,1,CH                                                        
ESID_LOG_RACINIT,141,1,CH                                                       
ESID_LOG_ALWAYS,146,1,CH                                                        
ESID_LOG_CMDVIOL,151,1,CH                                                       
ESID_LOG_GLOBAL,156,1,CH                                                        
ESID_TERM_LEVEL,161,3,CH                                                        
ESID_BACKOUT_FAIL,165,1,CH                                                      
ESID_PROF_SAME,170,1,CH                                                         
ESID_TERM,175,8,CH                                                              
ESID_JOB_NAME,184,8,CH                                                          
ESID_READ_TIME,193,8,CH                                                         
ESID_READ_DATE,202,10,CH                                                        
ESID_SMF_USER_ID,213,8,CH                                                       
ESID_LOG_LEVEL,222,1,CH                                                         
ESID_LOG_VMEVENT,227,1,CH                                                       
ESID_LOG_LOGOPT,232,1,CH                                                        
ESID_LOG_SECL,237,1,CH                                                          
ESID_LOG_COMPATM,242,1,CH                                                       
ESID_LOG_APPLAUD,247,1,CH                                                       
ESID_LOG_NONOMVS,252,1,CH                                                       
ESID_LOG_OMVSNPRV,257,1,CH                                                      
ESID_AUTH_OMVSSU,262,1,CH                                                       
ESID_AUTH_OMVSSYS,267,1,CH                                                      
ESID_USR_SECL,272,8,CH                                                          
ESID_RACF_VERSION,281,4,CH                                                      
ESID_CLASS,286,8,CH                                                             
ESID_USER_NAME,295,20,CH                                                        
ESID_UTK_ENCR,316,4,CH                                                          
ESID_UTK_PRE19,321,4,CH                                                         
ESID_UTK_VERPROF,326,4,CH                                                       
ESID_UTK_NJEUNUSR,331,4,CH                                                      
ESID_UTK_LOGUSR,336,4,CH                                                        
ESID_UTK_SPECIAL,341,4,CH                                                       
ESID_UTK_DEFAULT,346,4,CH                                                       
ESID_UTK_UNKNUSR,351,4,CH                                                       
ESID_UTK_ERROR,356,4,CH                                                         
ESID_UTK_TRUSTED,361,4,CH                                                       
ESID_UTK_SESSTYPE,366,8,CH                                                      
ESID_UTK_SURROGAT,375,4,CH                                                      
ESID_UTK_REMOTE,380,4,CH                                                        
ESID_UTK_PRIV,385,4,CH                                                          
ESID_UTK_SECL,390,8,CH                                                          
ESID_UTK_EXECNODE,399,8,CH                                                      
ESID_UTK_SUSER_ID,408,8,CH                                                      
ESID_UTK_SNODE,417,8,CH                                                         
ESID_UTK_SGRP_ID,426,8,CH                                                       
ESID_UTK_SPOE,435,8,CH                                                          
ESID_UTK_SPCLASS,444,8,CH                                                       
ESID_UTK_USER_ID,453,8,CH                                                       
ESID_UTK_GRP_ID,462,8,CH                                                        
ESID_UTK_DFT_GRP,471,4,CH                                                       
ESID_UTK_DFT_SECL,476,4,CH                                                      
ESID_APPC_LINK,481,16,CH                                                        
ESID_AUDIT_CODE,498,11,CH                                                       
ESID_OLD_REAL_UID,510,10,CH                                                     
ESID_OLD_EFF_UID,521,10,CH                                                      
ESID_OLD_SAVED_UID,532,10,CH                                                    
ESID_OLD_REAL_GID,543,10,CH                                                     
ESID_OLD_EFF_GID,554,10,CH                                                      
ESID_OLD_SAVED_GID,565,10,CH                                                    
ESID_NEW_REAL_UID,576,10,CH                                                     
ESID_NEW_EFF_UID,587,10,CH                                                      
ESID_NEW_SAVED_UID,598,10,CH                                                    
ESID_NEW_REAL_GID,609,10,CH                                                     
ESID_NEW_EFF_GID,620,10,CH                                                      
ESID_NEW_SAVED_GID,631,10,CH                                                    
ESID_UID,642,10,CH                                                              
ESID_GID,653,10,CH                                                              
ESID_DFLT_PROCESS,664,4,CH                                                      
ESID_UTK_NETW,669,8,CH                                                          
*------------------------------------------------*                              
*                    GETPSENT                    *                              
*------------------------------------------------*                              
GPST_EVENT_TYPE,5,8,CH                                                          
GPST_EVENT_QUAL,14,8,CH                                                         
GPST_TIME_WRITTEN,23,8,CH                                                       
GPST_DATE_WRITTEN,32,10,CH                                                      
GPST_SYSTEM_SMFID,43,4,CH                                                       
GPST_VIOLATION,48,1,CH                                                          
GPST_USER_NDFND,53,1,CH                                                         
GPST_USER_WARNING,58,1,CH                                                       
GPST_EVT_USER_ID,63,8,CH                                                        
GPST_EVT_GRP_ID,72,8,CH                                                         
GPST_AUTH_NORMAL,81,1,CH                                                        
GPST_AUTH_SPECIAL,86,1,CH                                                       
GPST_AUTH_OPER,91,1,CH                                                          
GPST_AUTH_AUDIT,96,1,CH                                                         
GPST_AUTH_EXIT,101,1,CH                                                         
GPST_AUTH_FAILSFT,106,1,CH                                                      
GPST_AUTH_BYPASS,111,1,CH                                                       
GPST_AUTH_TRUSTED,116,1,CH                                                      
GPST_LOG_CLASS,121,1,CH                                                         
GPST_LOG_USER,126,1,CH                                                          
GPST_LOG_SPECIAL,131,1,CH                                                       
GPST_LOG_ACCESS,136,1,CH                                                        
GPST_LOG_RACINIT,141,1,CH                                                       
GPST_LOG_ALWAYS,146,1,CH                                                        
GPST_LOG_CMDVIOL,151,1,CH                                                       
GPST_LOG_GLOBAL,156,1,CH                                                        
GPST_TERM_LEVEL,161,3,CH                                                        
GPST_BACKOUT_FAIL,165,1,CH                                                      
GPST_PROF_SAME,170,1,CH                                                         
GPST_TERM,175,8,CH                                                              
GPST_JOB_NAME,184,8,CH                                                          
GPST_READ_TIME,193,8,CH                                                         
GPST_READ_DATE,202,10,CH                                                        
GPST_SMF_USER_ID,213,8,CH                                                       
GPST_LOG_LEVEL,222,1,CH                                                         
GPST_LOG_VMEVENT,227,1,CH                                                       
GPST_LOG_LOGOPT,232,1,CH                                                        
GPST_LOG_SECL,237,1,CH                                                          
GPST_LOG_COMPATM,242,1,CH                                                       
GPST_LOG_APPLAUD,247,1,CH                                                       
GPST_LOG_NONOMVS,252,1,CH                                                       
GPST_LOG_OMVSNPRV,257,1,CH                                                      
GPST_AUTH_OMVSSU,262,1,CH                                                       
GPST_AUTH_OMVSSYS,267,1,CH                                                      
GPST_USR_SECL,272,8,CH                                                          
GPST_RACF_VERSION,281,4,CH                                                      
GPST_CLASS,286,8,CH                                                             
GPST_USER_NAME,295,20,CH                                                        
GPST_UTK_ENCR,316,4,CH                                                          
GPST_UTK_PRE19,321,4,CH                                                         
GPST_UTK_VERPROF,326,4,CH                                                       
GPST_UTK_NJEUNUSR,331,4,CH                                                      
GPST_UTK_LOGUSR,336,4,CH                                                        
GPST_UTK_SPECIAL,341,4,CH                                                       
GPST_UTK_DEFAULT,346,4,CH                                                       
GPST_UTK_UNKNUSR,351,4,CH                                                       
GPST_UTK_ERROR,356,4,CH                                                         
GPST_UTK_TRUSTED,361,4,CH                                                       
GPST_UTK_SESSTYPE,366,8,CH                                                      
GPST_UTK_SURROGAT,375,4,CH                                                      
GPST_UTK_REMOTE,380,4,CH                                                        
GPST_UTK_PRIV,385,4,CH                                                          
GPST_UTK_SECL,390,8,CH                                                          
GPST_UTK_EXECNODE,399,8,CH                                                      
GPST_UTK_SUSER_ID,408,8,CH                                                      
GPST_UTK_SNODE,417,8,CH                                                         
GPST_UTK_SGRP_ID,426,8,CH                                                       
GPST_UTK_SPOE,435,8,CH                                                          
GPST_UTK_SPCLASS,444,8,CH                                                       
GPST_UTK_USER_ID,453,8,CH                                                       
GPST_UTK_GRP_ID,462,8,CH                                                        
GPST_UTK_DFT_GRP,471,4,CH                                                       
GPST_UTK_DFT_SECL,476,4,CH                                                      
GPST_APPC_LINK,481,16,CH                                                        
GPST_AUDIT_CODE,498,11,CH                                                       
GPST_OLD_REAL_UID,510,10,CH                                                     
GPST_OLD_EFF_UID,521,10,CH                                                      
GPST_OLD_SAVED_UID,532,10,CH                                                    
GPST_OLD_REAL_GID,543,10,CH                                                     
GPST_OLD_EFF_GID,554,10,CH                                                      
GPST_OLD_SAVED_GID,565,10,CH                                                    
GPST_TGT_REAL_UID,576,10,CH                                                     
GPST_TGT_EFF_UID,587,10,CH                                                      
GPST_TGT_SAV_UID,598,10,CH                                                      
GPST_TGT_PID,609,10,CH                                                          
GPST_DFLT_PROCESS,620,4,CH                                                      
GPST_UTK_NETW,625,8,CH                                                          
*------------------------------------------------*                              
*                    INITOEDP                    *                              
*------------------------------------------------*                              
IOEP_EVENT_TYPE,5,8,CH                                                          
IOEP_EVENT_QUAL,14,8,CH                                                         
IOEP_TIME_WRITTEN,23,8,CH                                                       
IOEP_DATE_WRITTEN,32,10,CH                                                      
IOEP_SYSTEM_SMFID,43,4,CH                                                       
IOEP_VIOLATION,48,1,CH                                                          
IOEP_USER_NDFND,53,1,CH                                                         
IOEP_USER_WARNING,58,1,CH                                                       
IOEP_EVT_USER_ID,63,8,CH                                                        
IOEP_EVT_GRP_ID,72,8,CH                                                         
IOEP_AUTH_NORMAL,81,1,CH                                                        
IOEP_AUTH_SPECIAL,86,1,CH                                                       
IOEP_AUTH_OPER,91,1,CH                                                          
IOEP_AUTH_AUDIT,96,1,CH                                                         
IOEP_AUTH_EXIT,101,1,CH                                                         
IOEP_AUTH_FAILSFT,106,1,CH                                                      
IOEP_AUTH_BYPASS,111,1,CH                                                       
IOEP_AUTH_TRUSTED,116,1,CH                                                      
IOEP_LOG_CLASS,121,1,CH                                                         
IOEP_LOG_USER,126,1,CH                                                          
IOEP_LOG_SPECIAL,131,1,CH                                                       
IOEP_LOG_ACCESS,136,1,CH                                                        
IOEP_LOG_RACINIT,141,1,CH                                                       
IOEP_LOG_ALWAYS,146,1,CH                                                        
IOEP_LOG_CMDVIOL,151,1,CH                                                       
IOEP_LOG_GLOBAL,156,1,CH                                                        
IOEP_TERM_LEVEL,161,3,CH                                                        
IOEP_BACKOUT_FAIL,165,1,CH                                                      
IOEP_PROF_SAME,170,1,CH                                                         
IOEP_TERM,175,8,CH                                                              
IOEP_JOB_NAME,184,8,CH                                                          
IOEP_READ_TIME,193,8,CH                                                         
IOEP_READ_DATE,202,10,CH                                                        
IOEP_SMF_USER_ID,213,8,CH                                                       
IOEP_LOG_LEVEL,222,1,CH                                                         
IOEP_LOG_VMEVENT,227,1,CH                                                       
IOEP_LOG_LOGOPT,232,1,CH                                                        
IOEP_LOG_SECL,237,1,CH                                                          
IOEP_LOG_COMPATM,242,1,CH                                                       
IOEP_LOG_APPLAUD,247,1,CH                                                       
IOEP_LOG_NONOMVS,252,1,CH                                                       
IOEP_LOG_OMVSNPRV,257,1,CH                                                      
IOEP_AUTH_OMVSSU,262,1,CH                                                       
IOEP_AUTH_OMVSSYS,267,1,CH                                                      
IOEP_USR_SECL,272,8,CH                                                          
IOEP_RACF_VERSION,281,4,CH                                                      
IOEP_CLASS,286,8,CH                                                             
IOEP_USER_NAME,295,20,CH                                                        
IOEP_UTK_ENCR,316,4,CH                                                          
IOEP_UTK_PRE19,321,4,CH                                                         
IOEP_UTK_VERPROF,326,4,CH                                                       
IOEP_UTK_NJEUNUSR,331,4,CH                                                      
IOEP_UTK_LOGUSR,336,4,CH                                                        
IOEP_UTK_SPECIAL,341,4,CH                                                       
IOEP_UTK_DEFAULT,346,4,CH                                                       
IOEP_UTK_UNKNUSR,351,4,CH                                                       
IOEP_UTK_ERROR,356,4,CH                                                         
IOEP_UTK_TRUSTED,361,4,CH                                                       
IOEP_UTK_SESSTYPE,366,8,CH                                                      
IOEP_UTK_SURROGAT,375,4,CH                                                      
IOEP_UTK_REMOTE,380,4,CH                                                        
IOEP_UTK_PRIV,385,4,CH                                                          
IOEP_UTK_SECL,390,8,CH                                                          
IOEP_UTK_EXECNODE,399,8,CH                                                      
IOEP_UTK_SUSER_ID,408,8,CH                                                      
IOEP_UTK_SNODE,417,8,CH                                                         
IOEP_UTK_SGRP_ID,426,8,CH                                                       
IOEP_UTK_SPOE,435,8,CH                                                          
IOEP_UTK_SPCLASS,444,8,CH                                                       
IOEP_UTK_USER_ID,453,8,CH                                                       
IOEP_UTK_GRP_ID,462,8,CH                                                        
IOEP_UTK_DFT_GRP,471,4,CH                                                       
IOEP_UTK_DFT_SECL,476,4,CH                                                      
IOEP_APPC_LINK,481,16,CH                                                        
IOEP_AUDIT_CODE,498,11,CH                                                       
IOEP_OLD_REAL_UID,510,10,CH                                                     
IOEP_OLD_EFF_UID,521,10,CH                                                      
IOEP_OLD_SAVED_UID,532,10,CH                                                    
IOEP_OLD_REAL_GID,543,10,CH                                                     
IOEP_OLD_EFF_GID,554,10,CH                                                      
IOEP_OLD_SAVED_GID,565,10,CH                                                    
IOEP_DFLT_PROCESS,576,4,CH                                                      
IOEP_UTK_NETW,581,8,CH                                                          
*------------------------------------------------*                              
*                    TERMOEDP                    *                              
*------------------------------------------------*                              
TOEP_EVENT_TYPE,5,8,CH                                                          
TOEP_EVENT_QUAL,14,8,CH                                                         
TOEP_TIME_WRITTEN,23,8,CH                                                       
TOEP_DATE_WRITTEN,32,10,CH                                                      
TOEP_SYSTEM_SMFID,43,4,CH                                                       
TOEP_VIOLATION,48,1,CH                                                          
TOEP_USER_NDFND,53,1,CH                                                         
TOEP_USER_WARNING,58,1,CH                                                       
TOEP_EVT_USER_ID,63,8,CH                                                        
TOEP_EVT_GRP_ID,72,8,CH                                                         
TOEP_AUTH_NORMAL,81,1,CH                                                        
TOEP_AUTH_SPECIAL,86,1,CH                                                       
TOEP_AUTH_OPER,91,1,CH                                                          
TOEP_AUTH_AUDIT,96,1,CH                                                         
TOEP_AUTH_EXIT,101,1,CH                                                         
TOEP_AUTH_FAILSFT,106,1,CH                                                      
TOEP_AUTH_BYPASS,111,1,CH                                                       
TOEP_AUTH_TRUSTED,116,1,CH                                                      
TOEP_LOG_CLASS,121,1,CH                                                         
TOEP_LOG_USER,126,1,CH                                                          
TOEP_LOG_SPECIAL,131,1,CH                                                       
TOEP_LOG_ACCESS,136,1,CH                                                        
TOEP_LOG_RACINIT,141,1,CH                                                       
TOEP_LOG_ALWAYS,146,1,CH                                                        
TOEP_LOG_CMDVIOL,151,1,CH                                                       
TOEP_LOG_GLOBAL,156,1,CH                                                        
TOEP_TERM_LEVEL,161,3,CH                                                        
TOEP_BACKOUT_FAIL,165,1,CH                                                      
TOEP_PROF_SAME,170,1,CH                                                         
TOEP_TERM,175,8,CH                                                              
TOEP_JOB_NAME,184,8,CH                                                          
TOEP_READ_TIME,193,8,CH                                                         
TOEP_READ_DATE,202,10,CH                                                        
TOEP_SMF_USER_ID,213,8,CH                                                       
TOEP_LOG_LEVEL,222,1,CH                                                         
TOEP_LOG_VMEVENT,227,1,CH                                                       
TOEP_LOG_LOGOPT,232,1,CH                                                        
TOEP_LOG_SECL,237,1,CH                                                          
TOEP_LOG_COMPATM,242,1,CH                                                       
TOEP_LOG_APPLAUD,247,1,CH                                                       
TOEP_LOG_NONOMVS,252,1,CH                                                       
TOEP_LOG_OMVSNPRV,257,1,CH                                                      
TOEP_AUTH_OMVSSU,262,1,CH                                                       
TOEP_AUTH_OMVSSYS,267,1,CH                                                      
TOEP_USR_SECL,272,8,CH                                                          
TOEP_RACF_VERSION,281,4,CH                                                      
TOEP_CLASS,286,8,CH                                                             
TOEP_USER_NAME,295,20,CH                                                        
TOEP_UTK_ENCR,316,4,CH                                                          
TOEP_UTK_PRE19,321,4,CH                                                         
TOEP_UTK_VERPROF,326,4,CH                                                       
TOEP_UTK_NJEUNUSR,331,4,CH                                                      
TOEP_UTK_LOGUSR,336,4,CH                                                        
TOEP_UTK_SPECIAL,341,4,CH                                                       
TOEP_UTK_DEFAULT,346,4,CH                                                       
TOEP_UTK_UNKNUSR,351,4,CH                                                       
TOEP_UTK_ERROR,356,4,CH                                                         
TOEP_UTK_TRUSTED,361,4,CH                                                       
TOEP_UTK_SESSTYPE,366,8,CH                                                      
TOEP_UTK_SURROGAT,375,4,CH                                                      
TOEP_UTK_REMOTE,380,4,CH                                                        
TOEP_UTK_PRIV,385,4,CH                                                          
TOEP_UTK_SECL,390,8,CH                                                          
TOEP_UTK_EXECNODE,399,8,CH                                                      
TOEP_UTK_SUSER_ID,408,8,CH                                                      
TOEP_UTK_SNODE,417,8,CH                                                         
TOEP_UTK_SGRP_ID,426,8,CH                                                       
TOEP_UTK_SPOE,435,8,CH                                                          
TOEP_UTK_SPCLASS,444,8,CH                                                       
TOEP_UTK_USER_ID,453,8,CH                                                       
TOEP_UTK_GRP_ID,462,8,CH                                                        
TOEP_UTK_DFT_GRP,471,4,CH                                                       
TOEP_UTK_DFT_SECL,476,4,CH                                                      
TOEP_APPC_LINK,481,16,CH                                                        
TOEP_AUDIT_CODE,498,11,CH                                                       
TOEP_OLD_REAL_UID,510,10,CH                                                     
TOEP_OLD_EFF_UID,521,10,CH                                                      
TOEP_OLD_SAVED_UID,532,10,CH                                                    
TOEP_OLD_REAL_GID,543,10,CH                                                     
TOEP_OLD_EFF_GID,554,10,CH                                                      
TOEP_OLD_SAVED_GID,565,10,CH                                                    
TOEP_DFLT_PROCESS,576,4,CH                                                      
TOEP_UTK_NETW,581,8,CH                                                          
*------------------------------------------------*                              
*                      KILL                      *                              
*------------------------------------------------*                              
KILL_EVENT_TYPE,5,8,CH                                                          
KILL_EVENT_QUAL,14,8,CH                                                         
KILL_TIME_WRITTEN,23,8,CH                                                       
KILL_DATE_WRITTEN,32,10,CH                                                      
KILL_SYSTEM_SMFID,43,4,CH                                                       
KILL_VIOLATION,48,1,CH                                                          
KILL_USER_NDFND,53,1,CH                                                         
KILL_USER_WARNING,58,1,CH                                                       
KILL_EVT_USER_ID,63,8,CH                                                        
KILL_EVT_GRP_ID,72,8,CH                                                         
KILL_AUTH_NORMAL,81,1,CH                                                        
KILL_AUTH_SPECIAL,86,1,CH                                                       
KILL_AUTH_OPER,91,1,CH                                                          
KILL_AUTH_AUDIT,96,1,CH                                                         
KILL_AUTH_EXIT,101,1,CH                                                         
KILL_AUTH_FAILSFT,106,1,CH                                                      
KILL_AUTH_BYPASS,111,1,CH                                                       
KILL_AUTH_TRUSTED,116,1,CH                                                      
KILL_LOG_CLASS,121,1,CH                                                         
KILL_LOG_USER,126,1,CH                                                          
KILL_LOG_SPECIAL,131,1,CH                                                       
KILL_LOG_ACCESS,136,1,CH                                                        
KILL_LOG_RACINIT,141,1,CH                                                       
KILL_LOG_ALWAYS,146,1,CH                                                        
KILL_LOG_CMDVIOL,151,1,CH                                                       
KILL_LOG_GLOBAL,156,1,CH                                                        
KILL_TERM_LEVEL,161,3,CH                                                        
KILL_BACKOUT_FAIL,165,1,CH                                                      
KILL_PROF_SAME,170,1,CH                                                         
KILL_TERM,175,8,CH                                                              
KILL_JOB_NAME,184,8,CH                                                          
KILL_READ_TIME,193,8,CH                                                         
KILL_READ_DATE,202,10,CH                                                        
KILL_SMF_USER_ID,213,8,CH                                                       
KILL_LOG_LEVEL,222,1,CH                                                         
KILL_LOG_VMEVENT,227,1,CH                                                       
KILL_LOG_LOGOPT,232,1,CH                                                        
KILL_LOG_SECL,237,1,CH                                                          
KILL_LOG_COMPATM,242,1,CH                                                       
KILL_LOG_APPLAUD,247,1,CH                                                       
KILL_LOG_NONOMVS,252,1,CH                                                       
KILL_LOG_OMVSNPRV,257,1,CH                                                      
KILL_AUTH_OMVSSU,262,1,CH                                                       
KILL_AUTH_OMVSSYS,267,1,CH                                                      
KILL_USR_SECL,272,8,CH                                                          
KILL_RACF_VERSION,281,4,CH                                                      
KILL_CLASS,286,8,CH                                                             
KILL_USER_NAME,295,20,CH                                                        
KILL_UTK_ENCR,316,4,CH                                                          
KILL_UTK_PRE19,321,4,CH                                                         
KILL_UTK_VERPROF,326,4,CH                                                       
KILL_UTK_NJEUNUSR,331,4,CH                                                      
KILL_UTK_LOGUSR,336,4,CH                                                        
KILL_UTK_SPECIAL,341,4,CH                                                       
KILL_UTK_DEFAULT,346,4,CH                                                       
KILL_UTK_UNKNUSR,351,4,CH                                                       
KILL_UTK_ERROR,356,4,CH                                                         
KILL_UTK_TRUSTED,361,4,CH                                                       
KILL_UTK_SESSTYPE,366,8,CH                                                      
KILL_UTK_SURROGAT,375,4,CH                                                      
KILL_UTK_REMOTE,380,4,CH                                                        
KILL_UTK_PRIV,385,4,CH                                                          
KILL_UTK_SECL,390,8,CH                                                          
KILL_UTK_EXECNODE,399,8,CH                                                      
KILL_UTK_SUSER_ID,408,8,CH                                                      
KILL_UTK_SNODE,417,8,CH                                                         
KILL_UTK_SGRP_ID,426,8,CH                                                       
KILL_UTK_SPOE,435,8,CH                                                          
KILL_UTK_SPCLASS,444,8,CH                                                       
KILL_UTK_USER_ID,453,8,CH                                                       
KILL_UTK_GRP_ID,462,8,CH                                                        
KILL_UTK_DFT_GRP,471,4,CH                                                       
KILL_UTK_DFT_SECL,476,4,CH                                                      
KILL_APPC_LINK,481,16,CH                                                        
KILL_AUDIT_CODE,498,11,CH                                                       
KILL_OLD_REAL_UID,510,10,CH                                                     
KILL_OLD_EFF_UID,521,10,CH                                                      
KILL_OLD_SAVED_UID,532,10,CH                                                    
KILL_OLD_REAL_GID,543,10,CH                                                     
KILL_OLD_EFF_GID,554,10,CH                                                      
KILL_OLD_SAVED_GID,565,10,CH                                                    
KILL_TGT_REAL_UID,576,10,CH                                                     
KILL_TGT_EFF_UID,587,10,CH                                                      
KILL_TGT_SAV_UID,598,10,CH                                                      
KILL_TGT_PID,609,10,CH                                                          
KILL_SIGNAL_CODE,620,10,CH                                                      
KILL_DFLT_PROCESS,631,4,CH                                                      
KILL_UTK_NETW,636,8,CH                                                          
*------------------------------------------------*                              
*                      LINK                      *                              
*------------------------------------------------*                              
LINK_EVENT_TYPE,5,8,CH                                                          
LINK_EVENT_QUAL,14,8,CH                                                         
LINK_TIME_WRITTEN,23,8,CH                                                       
LINK_DATE_WRITTEN,32,10,CH                                                      
LINK_SYSTEM_SMFID,43,4,CH                                                       
LINK_VIOLATION,48,1,CH                                                          
LINK_USER_NDFND,53,1,CH                                                         
LINK_USER_WARNING,58,1,CH                                                       
LINK_EVT_USER_ID,63,8,CH                                                        
LINK_EVT_GRP_ID,72,8,CH                                                         
LINK_AUTH_NORMAL,81,1,CH                                                        
LINK_AUTH_SPECIAL,86,1,CH                                                       
LINK_AUTH_OPER,91,1,CH                                                          
LINK_AUTH_AUDIT,96,1,CH                                                         
LINK_AUTH_EXIT,101,1,CH                                                         
LINK_AUTH_FAILSFT,106,1,CH                                                      
LINK_AUTH_BYPASS,111,1,CH                                                       
LINK_AUTH_TRUSTED,116,1,CH                                                      
LINK_LOG_CLASS,121,1,CH                                                         
LINK_LOG_USER,126,1,CH                                                          
LINK_LOG_SPECIAL,131,1,CH                                                       
LINK_LOG_ACCESS,136,1,CH                                                        
LINK_LOG_RACINIT,141,1,CH                                                       
LINK_LOG_ALWAYS,146,1,CH                                                        
LINK_LOG_CMDVIOL,151,1,CH                                                       
LINK_LOG_GLOBAL,156,1,CH                                                        
LINK_TERM_LEVEL,161,3,CH                                                        
LINK_BACKOUT_FAIL,165,1,CH                                                      
LINK_PROF_SAME,170,1,CH                                                         
LINK_TERM,175,8,CH                                                              
LINK_JOB_NAME,184,8,CH                                                          
LINK_READ_TIME,193,8,CH                                                         
LINK_READ_DATE,202,10,CH                                                        
LINK_SMF_USER_ID,213,8,CH                                                       
LINK_LOG_LEVEL,222,1,CH                                                         
LINK_LOG_VMEVENT,227,1,CH                                                       
LINK_LOG_LOGOPT,232,1,CH                                                        
LINK_LOG_SECL,237,1,CH                                                          
LINK_LOG_COMPATM,242,1,CH                                                       
LINK_LOG_APPLAUD,247,1,CH                                                       
LINK_LOG_NONOMVS,252,1,CH                                                       
LINK_LOG_OMVSNPRV,257,1,CH                                                      
LINK_AUTH_OMVSSU,262,1,CH                                                       
LINK_AUTH_OMVSSYS,267,1,CH                                                      
LINK_USR_SECL,272,8,CH                                                          
LINK_RACF_VERSION,281,4,CH                                                      
LINK_CLASS,286,8,CH                                                             
LINK_USER_NAME,295,20,CH                                                        
LINK_UTK_ENCR,316,4,CH                                                          
LINK_UTK_PRE19,321,4,CH                                                         
LINK_UTK_VERPROF,326,4,CH                                                       
LINK_UTK_NJEUNUSR,331,4,CH                                                      
LINK_UTK_LOGUSR,336,4,CH                                                        
LINK_UTK_SPECIAL,341,4,CH                                                       
LINK_UTK_DEFAULT,346,4,CH                                                       
LINK_UTK_UNKNUSR,351,4,CH                                                       
LINK_UTK_ERROR,356,4,CH                                                         
LINK_UTK_TRUSTED,361,4,CH                                                       
LINK_UTK_SESSTYPE,366,8,CH                                                      
LINK_UTK_SURROGAT,375,4,CH                                                      
LINK_UTK_REMOTE,380,4,CH                                                        
LINK_UTK_PRIV,385,4,CH                                                          
LINK_UTK_SECL,390,8,CH                                                          
LINK_UTK_EXECNODE,399,8,CH                                                      
LINK_UTK_SUSER_ID,408,8,CH                                                      
LINK_UTK_SNODE,417,8,CH                                                         
LINK_UTK_SGRP_ID,426,8,CH                                                       
LINK_UTK_SPOE,435,8,CH                                                          
LINK_UTK_SPCLASS,444,8,CH                                                       
LINK_UTK_USER_ID,453,8,CH                                                       
LINK_UTK_GRP_ID,462,8,CH                                                        
LINK_UTK_DFT_GRP,471,4,CH                                                       
LINK_UTK_DFT_SECL,476,4,CH                                                      
LINK_APPC_LINK,481,16,CH                                                        
LINK_AUDIT_CODE,498,11,CH                                                       
LINK_OLD_REAL_UID,510,10,CH                                                     
LINK_OLD_EFF_UID,521,10,CH                                                      
LINK_OLD_SAVED_UID,532,10,CH                                                    
LINK_OLD_REAL_GID,543,10,CH                                                     
LINK_OLD_EFF_GID,554,10,CH                                                      
LINK_OLD_SAVED_GID,565,10,CH                                                    
LINK_PATH_NAME,576,1023,CH                                                      
LINK_FILE_ID,1600,32,CH                                                         
LINK_FILE_OWN_UID,1633,10,CH                                                    
LINK_FILE_OWN_GID,1644,10,CH                                                    
LINK_REQUEST_PATH2,1655,1023,CH                                                 
LINK_PATH_TYPE,2679,4,CH                                                        
LINK_FILEPOOL,2684,8,CH                                                         
LINK_FILESPACE,2693,8,CH                                                        
LINK_INODE,2702,10,CH                                                           
LINK_SCID,2713,10,CH                                                            
LINK_DCE_LINK,2724,16,CH                                                        
LINK_AUTH_TYPE,2741,13,CH                                                       
LINK_DFLT_PROCESS,2755,4,CH                                                     
LINK_UTK_NETW,2760,8,CH                                                         
*------------------------------------------------*                              
*                     MKDIR                      *                              
*------------------------------------------------*                              
MDIR_EVENT_TYPE,5,8,CH                                                          
MDIR_EVENT_QUAL,14,8,CH                                                         
MDIR_TIME_WRITTEN,23,8,CH                                                       
MDIR_DATE_WRITTEN,32,10,CH                                                      
MDIR_SYSTEM_SMFID,43,4,CH                                                       
MDIR_VIOLATION,48,1,CH                                                          
MDIR_USER_NDFND,53,1,CH                                                         
MDIR_USER_WARNING,58,1,CH                                                       
MDIR_EVT_USER_ID,63,8,CH                                                        
MDIR_EVT_GRP_ID,72,8,CH                                                         
MDIR_AUTH_NORMAL,81,1,CH                                                        
MDIR_AUTH_SPECIAL,86,1,CH                                                       
MDIR_AUTH_OPER,91,1,CH                                                          
MDIR_AUTH_AUDIT,96,1,CH                                                         
MDIR_AUTH_EXIT,101,1,CH                                                         
MDIR_AUTH_FAILSFT,106,1,CH                                                      
MDIR_AUTH_BYPASS,111,1,CH                                                       
MDIR_AUTH_TRUSTED,116,1,CH                                                      
MDIR_LOG_CLASS,121,1,CH                                                         
MDIR_LOG_USER,126,1,CH                                                          
MDIR_LOG_SPECIAL,131,1,CH                                                       
MDIR_LOG_ACCESS,136,1,CH                                                        
MDIR_LOG_RACINIT,141,1,CH                                                       
MDIR_LOG_ALWAYS,146,1,CH                                                        
MDIR_LOG_CMDVIOL,151,1,CH                                                       
MDIR_LOG_GLOBAL,156,1,CH                                                        
MDIR_TERM_LEVEL,161,3,CH                                                        
MDIR_BACKOUT_FAIL,165,1,CH                                                      
MDIR_PROF_SAME,170,1,CH                                                         
MDIR_TERM,175,8,CH                                                              
MDIR_JOB_NAME,184,8,CH                                                          
MDIR_READ_TIME,193,8,CH                                                         
MDIR_READ_DATE,202,10,CH                                                        
MDIR_SMF_USER_ID,213,8,CH                                                       
MDIR_LOG_LEVEL,222,1,CH                                                         
MDIR_LOG_VMEVENT,227,1,CH                                                       
MDIR_LOG_LOGOPT,232,1,CH                                                        
MDIR_LOG_SECL,237,1,CH                                                          
MDIR_LOG_COMPATM,242,1,CH                                                       
MDIR_LOG_APPLAUD,247,1,CH                                                       
MDIR_LOG_NONOMVS,252,1,CH                                                       
MDIR_LOG_OMVSNPRV,257,1,CH                                                      
MDIR_AUTH_OMVSSU,262,1,CH                                                       
MDIR_AUTH_OMVSSYS,267,1,CH                                                      
MDIR_USR_SECL,272,8,CH                                                          
MDIR_RACF_VERSION,281,4,CH                                                      
MDIR_CLASS,286,8,CH                                                             
MDIR_USER_NAME,295,20,CH                                                        
MDIR_UTK_ENCR,316,4,CH                                                          
MDIR_UTK_PRE19,321,4,CH                                                         
MDIR_UTK_VERPROF,326,4,CH                                                       
MDIR_UTK_NJEUNUSR,331,4,CH                                                      
MDIR_UTK_LOGUSR,336,4,CH                                                        
MDIR_UTK_SPECIAL,341,4,CH                                                       
MDIR_UTK_DEFAULT,346,4,CH                                                       
MDIR_UTK_UNKNUSR,351,4,CH                                                       
MDIR_UTK_ERROR,356,4,CH                                                         
MDIR_UTK_TRUSTED,361,4,CH                                                       
MDIR_UTK_SESSTYPE,366,8,CH                                                      
MDIR_UTK_SURROGAT,375,4,CH                                                      
MDIR_UTK_REMOTE,380,4,CH                                                        
MDIR_UTK_PRIV,385,4,CH                                                          
MDIR_UTK_SECL,390,8,CH                                                          
MDIR_UTK_EXECNODE,399,8,CH                                                      
MDIR_UTK_SUSER_ID,408,8,CH                                                      
MDIR_UTK_SNODE,417,8,CH                                                         
MDIR_UTK_SGRP_ID,426,8,CH                                                       
MDIR_UTK_SPOE,435,8,CH                                                          
MDIR_UTK_SPCLASS,444,8,CH                                                       
MDIR_UTK_USER_ID,453,8,CH                                                       
MDIR_UTK_GRP_ID,462,8,CH                                                        
MDIR_UTK_DFT_GRP,471,4,CH                                                       
MDIR_UTK_DFT_SECL,476,4,CH                                                      
MDIR_APPC_LINK,481,16,CH                                                        
MDIR_AUDIT_CODE,498,11,CH                                                       
MDIR_OLD_REAL_UID,510,10,CH                                                     
MDIR_OLD_EFF_UID,521,10,CH                                                      
MDIR_OLD_SAVED_UID,532,10,CH                                                    
MDIR_OLD_REAL_GID,543,10,CH                                                     
MDIR_OLD_EFF_GID,554,10,CH                                                      
MDIR_OLD_SAVED_GID,565,10,CH                                                    
MDIR_PATH_NAME,576,1023,CH                                                      
MDIR_FILE_ID,1600,32,CH                                                         
MDIR_FILE_OWN_UID,1633,10,CH                                                    
MDIR_FILE_OWN_GID,1644,10,CH                                                    
MDIR_OLD_S_ISGID,1655,4,CH                                                      
MDIR_OLD_S_ISUID,1660,4,CH                                                      
MDIR_OLD_S_ISVTX,1665,4,CH                                                      
MDIR_OLD_OWN_READ,1670,4,CH                                                     
MDIR_OLD_OWN_WRITE,1675,4,CH                                                    
MDIR_OLD_OWN_EXEC,1680,4,CH                                                     
MDIR_OLD_GRP_READ,1685,4,CH                                                     
MDIR_OLD_GRP_WRITE,1690,4,CH                                                    
MDIR_OLD_GRP_EXEC,1695,4,CH                                                     
MDIR_OLD_OTH_READ,1700,4,CH                                                     
MDIR_OLD_OTH_WRITE,1705,4,CH                                                    
MDIR_OLD_OTH_EXEC,1710,4,CH                                                     
MDIR_NEW_S_ISGID,1715,4,CH                                                      
MDIR_NEW_S_ISUID,1720,4,CH                                                      
MDIR_NEW_S_ISVTX,1725,4,CH                                                      
MDIR_NEW_OWN_READ,1730,4,CH                                                     
MDIR_NEW_OWN_WRITE,1735,4,CH                                                    
MDIR_NEW_OWN_EXEC,1740,4,CH                                                     
MDIR_NEW_GRP_READ,1745,4,CH                                                     
MDIR_NEW_GRP_WRITE,1750,4,CH                                                    
MDIR_NEW_GRP_EXEC,1755,4,CH                                                     
MDIR_NEW_OTH_READ,1760,4,CH                                                     
MDIR_NEW_OTH_WRITE,1765,4,CH                                                    
MDIR_NEW_OTH_EXEC,1770,4,CH                                                     
MDIR_UNEW_READ,1775,8,CH                                                        
MDIR_UNEW_WRITE,1784,8,CH                                                       
MDIR_UNEW_EXEC,1793,8,CH                                                        
MDIR_ANEW_READ,1802,8,CH                                                        
MDIR_ANEW_WRITE,1811,8,CH                                                       
MDIR_ANEW_EXEC,1820,8,CH                                                        
MDIR_REQ_S_ISGID,1829,4,CH                                                      
MDIR_REQ_S_ISUID,1834,4,CH                                                      
MDIR_REQ_S_ISVTX,1839,4,CH                                                      
MDIR_REQ_OWN_READ,1844,4,CH                                                     
MDIR_REQ_OWN_WRITE,1849,4,CH                                                    
MDIR_REQ_OWN_EXEC,1854,4,CH                                                     
MDIR_REQ_GRP_READ,1859,4,CH                                                     
MDIR_REQ_GRP_WRITE,1864,4,CH                                                    
MDIR_REQ_GRP_EXEC,1869,4,CH                                                     
MDIR_REQ_OTH_READ,1874,4,CH                                                     
MDIR_REQ_OTH_WRITE,1879,4,CH                                                    
MDIR_REQ_OTH_EXEC,1884,4,CH                                                     
MDIR_FILEPOOL,1889,8,CH                                                         
MDIR_FILESPACE,1898,8,CH                                                        
MDIR_INODE,1907,10,CH                                                           
MDIR_SCID,1918,10,CH                                                            
MDIR_DFLT_PROCESS,1929,4,CH                                                     
MDIR_UTK_NETW,1934,8,CH                                                         
*------------------------------------------------*                              
*                     MKNOD                      *                              
*------------------------------------------------*                              
MNOD_EVENT_TYPE,5,8,CH                                                          
MNOD_EVENT_QUAL,14,8,CH                                                         
MNOD_TIME_WRITTEN,23,8,CH                                                       
MNOD_DATE_WRITTEN,32,10,CH                                                      
MNOD_SYSTEM_SMFID,43,4,CH                                                       
MNOD_VIOLATION,48,1,CH                                                          
MNOD_USER_NDFND,53,1,CH                                                         
MNOD_USER_WARNING,58,1,CH                                                       
MNOD_EVT_USER_ID,63,8,CH                                                        
MNOD_EVT_GRP_ID,72,8,CH                                                         
MNOD_AUTH_NORMAL,81,1,CH                                                        
MNOD_AUTH_SPECIAL,86,1,CH                                                       
MNOD_AUTH_OPER,91,1,CH                                                          
MNOD_AUTH_AUDIT,96,1,CH                                                         
MNOD_AUTH_EXIT,101,1,CH                                                         
MNOD_AUTH_FAILSFT,106,1,CH                                                      
MNOD_AUTH_BYPASS,111,1,CH                                                       
MNOD_AUTH_TRUSTED,116,1,CH                                                      
MNOD_LOG_CLASS,121,1,CH                                                         
MNOD_LOG_USER,126,1,CH                                                          
MNOD_LOG_SPECIAL,131,1,CH                                                       
MNOD_LOG_ACCESS,136,1,CH                                                        
MNOD_LOG_RACINIT,141,1,CH                                                       
MNOD_LOG_ALWAYS,146,1,CH                                                        
MNOD_LOG_CMDVIOL,151,1,CH                                                       
MNOD_LOG_GLOBAL,156,1,CH                                                        
MNOD_TERM_LEVEL,161,3,CH                                                        
MNOD_BACKOUT_FAIL,165,1,CH                                                      
MNOD_PROF_SAME,170,1,CH                                                         
MNOD_TERM,175,8,CH                                                              
MNOD_JOB_NAME,184,8,CH                                                          
MNOD_READ_TIME,193,8,CH                                                         
MNOD_READ_DATE,202,10,CH                                                        
MNOD_SMF_USER_ID,213,8,CH                                                       
MNOD_LOG_LEVEL,222,1,CH                                                         
MNOD_LOG_VMEVENT,227,1,CH                                                       
MNOD_LOG_LOGOPT,232,1,CH                                                        
MNOD_LOG_SECL,237,1,CH                                                          
MNOD_LOG_COMPATM,242,1,CH                                                       
MNOD_LOG_APPLAUD,247,1,CH                                                       
MNOD_LOG_NONOMVS,252,1,CH                                                       
MNOD_LOG_OMVSNPRV,257,1,CH                                                      
MNOD_AUTH_OMVSSU,262,1,CH                                                       
MNOD_AUTH_OMVSSYS,267,1,CH                                                      
MNOD_USR_SECL,272,8,CH                                                          
MNOD_RACF_VERSION,281,4,CH                                                      
MNOD_CLASS,286,8,CH                                                             
MNOD_USER_NAME,295,20,CH                                                        
MNOD_UTK_ENCR,316,4,CH                                                          
MNOD_UTK_PRE19,321,4,CH                                                         
MNOD_UTK_VERPROF,326,4,CH                                                       
MNOD_UTK_NJEUNUSR,331,4,CH                                                      
MNOD_UTK_LOGUSR,336,4,CH                                                        
MNOD_UTK_SPECIAL,341,4,CH                                                       
MNOD_UTK_DEFAULT,346,4,CH                                                       
MNOD_UTK_UNKNUSR,351,4,CH                                                       
MNOD_UTK_ERROR,356,4,CH                                                         
MNOD_UTK_TRUSTED,361,4,CH                                                       
MNOD_UTK_SESSTYPE,366,8,CH                                                      
MNOD_UTK_SURROGAT,375,4,CH                                                      
MNOD_UTK_REMOTE,380,4,CH                                                        
MNOD_UTK_PRIV,385,4,CH                                                          
MNOD_UTK_SECL,390,8,CH                                                          
MNOD_UTK_EXECNODE,399,8,CH                                                      
MNOD_UTK_SUSER_ID,408,8,CH                                                      
MNOD_UTK_SNODE,417,8,CH                                                         
MNOD_UTK_SGRP_ID,426,8,CH                                                       
MNOD_UTK_SPOE,435,8,CH                                                          
MNOD_UTK_SPCLASS,444,8,CH                                                       
MNOD_UTK_USER_ID,453,8,CH                                                       
MNOD_UTK_GRP_ID,462,8,CH                                                        
MNOD_UTK_DFT_GRP,471,4,CH                                                       
MNOD_UTK_DFT_SECL,476,4,CH                                                      
MNOD_APPC_LINK,481,16,CH                                                        
MNOD_AUDIT_CODE,498,11,CH                                                       
MNOD_OLD_REAL_UID,510,10,CH                                                     
MNOD_OLD_EFF_UID,521,10,CH                                                      
MNOD_OLD_SAVED_UID,532,10,CH                                                    
MNOD_OLD_REAL_GID,543,10,CH                                                     
MNOD_OLD_EFF_GID,554,10,CH                                                      
MNOD_OLD_SAVED_GID,565,10,CH                                                    
MNOD_PATH_NAME,576,1023,CH                                                      
MNOD_FILE_ID,1600,32,CH                                                         
MNOD_FILE_OWN_UID,1633,10,CH                                                    
MNOD_FILE_OWN_GID,1644,10,CH                                                    
MNOD_OLD_S_ISGID,1655,4,CH                                                      
MNOD_OLD_S_ISUID,1660,4,CH                                                      
MNOD_OLD_S_ISVTX,1665,4,CH                                                      
MNOD_OLD_OWN_READ,1670,4,CH                                                     
MNOD_OLD_OWN_WRITE,1675,4,CH                                                    
MNOD_OLD_OWN_EXEC,1680,4,CH                                                     
MNOD_OLD_GRP_READ,1685,4,CH                                                     
MNOD_OLD_GRP_WRITE,1690,4,CH                                                    
MNOD_OLD_GRP_EXEC,1695,4,CH                                                     
MNOD_OLD_OTH_READ,1700,4,CH                                                     
MNOD_OLD_OTH_WRITE,1705,4,CH                                                    
MNOD_OLD_OTH_EXEC,1710,4,CH                                                     
MNOD_NEW_S_ISGID,1715,4,CH                                                      
MNOD_NEW_S_ISUID,1720,4,CH                                                      
MNOD_NEW_S_ISVTX,1725,4,CH                                                      
MNOD_NEW_OWN_READ,1730,4,CH                                                     
MNOD_NEW_OWN_WRITE,1735,4,CH                                                    
MNOD_NEW_OWN_EXEC,1740,4,CH                                                     
MNOD_NEW_GRP_READ,1745,4,CH                                                     
MNOD_NEW_GRP_WRITE,1750,4,CH                                                    
MNOD_NEW_GRP_EXEC,1755,4,CH                                                     
MNOD_NEW_OTH_READ,1760,4,CH                                                     
MNOD_NEW_OTH_WRITE,1765,4,CH                                                    
MNOD_NEW_OTH_EXEC,1770,4,CH                                                     
MNOD_UNEW_READ,1775,8,CH                                                        
MNOD_UNEW_WRITE,1784,8,CH                                                       
MNOD_UNEW_EXEC,1793,8,CH                                                        
MNOD_ANEW_READ,1802,8,CH                                                        
MNOD_ANEW_WRITE,1811,8,CH                                                       
MNOD_ANEW_EXEC,1820,8,CH                                                        
MNOD_REQ_S_ISGID,1829,4,CH                                                      
MNOD_REQ_S_ISUID,1834,4,CH                                                      
MNOD_REQ_S_ISVTX,1839,4,CH                                                      
MNOD_REQ_OWN_READ,1844,4,CH                                                     
MNOD_REQ_OWN_WRITE,1849,4,CH                                                    
MNOD_REQ_OWN_EXEC,1854,4,CH                                                     
MNOD_REQ_GRP_READ,1859,4,CH                                                     
MNOD_REQ_GRP_WRITE,1864,4,CH                                                    
MNOD_REQ_GRP_EXEC,1869,4,CH                                                     
MNOD_REQ_OTH_READ,1874,4,CH                                                     
MNOD_REQ_OTH_WRITE,1879,4,CH                                                    
MNOD_REQ_OTH_EXEC,1884,4,CH                                                     
MNOD_FILEPOOL,1889,8,CH                                                         
MNOD_FILESPACE,1898,8,CH                                                        
MNOD_INODE,1907,10,CH                                                           
MNOD_SCID,1918,10,CH                                                            
MNOD_DFLT_PROCESS,1929,4,CH                                                     
MNOD_UTK_NETW,1934,8,CH                                                         
*------------------------------------------------*                              
*                    MNTFSYS                     *                              
*------------------------------------------------*                              
MFS_EVENT_TYPE,5,8,CH                                                           
MFS_EVENT_QUAL,14,8,CH                                                          
MFS_TIME_WRITTEN,23,8,CH                                                        
MFS_DATE_WRITTEN,32,10,CH                                                       
MFS_SYSTEM_SMFID,43,4,CH                                                        
MFS_VIOLATION,48,1,CH                                                           
MFS_USER_NDFND,53,1,CH                                                          
MFS_USER_WARNING,58,1,CH                                                        
MFS_EVT_USER_ID,63,8,CH                                                         
MFS_EVT_GRP_ID,72,8,CH                                                          
MFS_AUTH_NORMAL,81,1,CH                                                         
MFS_AUTH_SPECIAL,86,1,CH                                                        
MFS_AUTH_OPER,91,1,CH                                                           
MFS_AUTH_AUDIT,96,1,CH                                                          
MFS_AUTH_EXIT,101,1,CH                                                          
MFS_AUTH_FAILSFT,106,1,CH                                                       
MFS_AUTH_BYPASS,111,1,CH                                                        
MFS_AUTH_TRUSTED,116,1,CH                                                       
MFS_LOG_CLASS,121,1,CH                                                          
MFS_LOG_USER,126,1,CH                                                           
MFS_LOG_SPECIAL,131,1,CH                                                        
MFS_LOG_ACCESS,136,1,CH                                                         
MFS_LOG_RACINIT,141,1,CH                                                        
MFS_LOG_ALWAYS,146,1,CH                                                         
MFS_LOG_CMDVIOL,151,1,CH                                                        
MFS_LOG_GLOBAL,156,1,CH                                                         
MFS_TERM_LEVEL,161,3,CH                                                         
MFS_BACKOUT_FAIL,165,1,CH                                                       
MFS_PROF_SAME,170,1,CH                                                          
MFS_TERM,175,8,CH                                                               
MFS_JOB_NAME,184,8,CH                                                           
MFS_READ_TIME,193,8,CH                                                          
MFS_READ_DATE,202,10,CH                                                         
MFS_SMF_USER_ID,213,8,CH                                                        
MFS_LOG_LEVEL,222,1,CH                                                          
MFS_LOG_VMEVENT,227,1,CH                                                        
MFS_LOG_LOGOPT,232,1,CH                                                         
MFS_LOG_SECL,237,1,CH                                                           
MFS_LOG_COMPATM,242,1,CH                                                        
MFS_LOG_APPLAUD,247,1,CH                                                        
MFS_LOG_NONOMVS,252,1,CH                                                        
MFS_LOG_OMVSNPRV,257,1,CH                                                       
MFS_AUTH_OMVSSU,262,1,CH                                                        
MFS_AUTH_OMVSSYS,267,1,CH                                                       
MFS_USR_SECL,272,8,CH                                                           
MFS_RACF_VERSION,281,4,CH                                                       
MFS_CLASS,286,8,CH                                                              
MFS_USER_NAME,295,20,CH                                                         
MFS_UTK_ENCR,316,4,CH                                                           
MFS_UTK_PRE19,321,4,CH                                                          
MFS_UTK_VERPROF,326,4,CH                                                        
MFS_UTK_NJEUNUSR,331,4,CH                                                       
MFS_UTK_LOGUSR,336,4,CH                                                         
MFS_UTK_SPECIAL,341,4,CH                                                        
MFS_UTK_DEFAULT,346,4,CH                                                        
MFS_UTK_UNKNUSR,351,4,CH                                                        
MFS_UTK_ERROR,356,4,CH                                                          
MFS_UTK_TRUSTED,361,4,CH                                                        
MFS_UTK_SESSTYPE,366,8,CH                                                       
MFS_UTK_SURROGAT,375,4,CH                                                       
MFS_UTK_REMOTE,380,4,CH                                                         
MFS_UTK_PRIV,385,4,CH                                                           
MFS_UTK_SECL,390,8,CH                                                           
MFS_UTK_EXECNODE,399,8,CH                                                       
MFS_UTK_SUSER_ID,408,8,CH                                                       
MFS_UTK_SNODE,417,8,CH                                                          
MFS_UTK_SGRP_ID,426,8,CH                                                        
MFS_UTK_SPOE,435,8,CH                                                           
MFS_UTK_SPCLASS,444,8,CH                                                        
MFS_UTK_USER_ID,453,8,CH                                                        
MFS_UTK_GRP_ID,462,8,CH                                                         
MFS_UTK_DFT_GRP,471,4,CH                                                        
MFS_UTK_DFT_SECL,476,4,CH                                                       
MFS_APPC_LINK,481,16,CH                                                         
MFS_AUDIT_CODE,498,11,CH                                                        
MFS_OLD_REAL_UID,510,10,CH                                                      
MFS_OLD_EFF_UID,521,10,CH                                                       
MFS_OLD_SAVED_UID,532,10,CH                                                     
MFS_OLD_REAL_GID,543,10,CH                                                      
MFS_OLD_EFF_GID,554,10,CH                                                       
MFS_OLD_SAVED_GID,565,10,CH                                                     
MFS_PATH_NAME,576,1023,CH                                                       
MFS_FILE_ID,1600,32,CH                                                          
MFS_FILE_OWN_UID,1633,10,CH                                                     
MFS_FILE_OWN_GID,1644,10,CH                                                     
MFS_HFS_DS_NAME,1655,44,CH                                                      
MFS_DCE_LINK,1700,16,CH                                                         
MFS_AUTH_TYPE,1717,13,CH                                                        
MFS_DFLT_PROCESS,1731,4,CH                                                      
MFS_UTK_NETW,1736,8,CH                                                          
*------------------------------------------------*                              
*                    OPENFILE                    *                              
*------------------------------------------------*                              
OPEN_EVENT_TYPE,5,8,CH                                                          
OPEN_EVENT_QUAL,14,8,CH                                                         
OPEN_TIME_WRITTEN,23,8,CH                                                       
OPEN_DATE_WRITTEN,32,10,CH                                                      
OPEN_SYSTEM_SMFID,43,4,CH                                                       
OPEN_VIOLATION,48,1,CH                                                          
OPEN_USER_NDFND,53,1,CH                                                         
OPEN_USER_WARNING,58,1,CH                                                       
OPEN_EVT_USER_ID,63,8,CH                                                        
OPEN_EVT_GRP_ID,72,8,CH                                                         
OPEN_AUTH_NORMAL,81,1,CH                                                        
OPEN_AUTH_SPECIAL,86,1,CH                                                       
OPEN_AUTH_OPER,91,1,CH                                                          
OPEN_AUTH_AUDIT,96,1,CH                                                         
OPEN_AUTH_EXIT,101,1,CH                                                         
OPEN_AUTH_FAILSFT,106,1,CH                                                      
OPEN_AUTH_BYPASS,111,1,CH                                                       
OPEN_AUTH_TRUSTED,116,1,CH                                                      
OPEN_LOG_CLASS,121,1,CH                                                         
OPEN_LOG_USER,126,1,CH                                                          
OPEN_LOG_SPECIAL,131,1,CH                                                       
OPEN_LOG_ACCESS,136,1,CH                                                        
OPEN_LOG_RACINIT,141,1,CH                                                       
OPEN_LOG_ALWAYS,146,1,CH                                                        
OPEN_LOG_CMDVIOL,151,1,CH                                                       
OPEN_LOG_GLOBAL,156,1,CH                                                        
OPEN_TERM_LEVEL,161,3,CH                                                        
OPEN_BACKOUT_FAIL,165,1,CH                                                      
OPEN_PROF_SAME,170,1,CH                                                         
OPEN_TERM,175,8,CH                                                              
OPEN_JOB_NAME,184,8,CH                                                          
OPEN_READ_TIME,193,8,CH                                                         
OPEN_READ_DATE,202,10,CH                                                        
OPEN_SMF_USER_ID,213,8,CH                                                       
OPEN_LOG_LEVEL,222,1,CH                                                         
OPEN_LOG_VMEVENT,227,1,CH                                                       
OPEN_LOG_LOGOPT,232,1,CH                                                        
OPEN_LOG_SECL,237,1,CH                                                          
OPEN_LOG_COMPATM,242,1,CH                                                       
OPEN_LOG_APPLAUD,247,1,CH                                                       
OPEN_LOG_NONOMVS,252,1,CH                                                       
OPEN_LOG_OMVSNPRV,257,1,CH                                                      
OPEN_AUTH_OMVSSU,262,1,CH                                                       
OPEN_AUTH_OMVSSYS,267,1,CH                                                      
OPEN_USR_SECL,272,8,CH                                                          
OPEN_RACF_VERSION,281,4,CH                                                      
OPEN_CLASS,286,8,CH                                                             
OPEN_USER_NAME,295,20,CH                                                        
OPEN_UTK_ENCR,316,4,CH                                                          
OPEN_UTK_PRE19,321,4,CH                                                         
OPEN_UTK_VERPROF,326,4,CH                                                       
OPEN_UTK_NJEUNUSR,331,4,CH                                                      
OPEN_UTK_LOGUSR,336,4,CH                                                        
OPEN_UTK_SPECIAL,341,4,CH                                                       
OPEN_UTK_DEFAULT,346,4,CH                                                       
OPEN_UTK_UNKNUSR,351,4,CH                                                       
OPEN_UTK_ERROR,356,4,CH                                                         
OPEN_UTK_TRUSTED,361,4,CH                                                       
OPEN_UTK_SESSTYPE,366,8,CH                                                      
OPEN_UTK_SURROGAT,375,4,CH                                                      
OPEN_UTK_REMOTE,380,4,CH                                                        
OPEN_UTK_PRIV,385,4,CH                                                          
OPEN_UTK_SECL,390,8,CH                                                          
OPEN_UTK_EXECNODE,399,8,CH                                                      
OPEN_UTK_SUSER_ID,408,8,CH                                                      
OPEN_UTK_SNODE,417,8,CH                                                         
OPEN_UTK_SGRP_ID,426,8,CH                                                       
OPEN_UTK_SPOE,435,8,CH                                                          
OPEN_UTK_SPCLASS,444,8,CH                                                       
OPEN_UTK_USER_ID,453,8,CH                                                       
OPEN_UTK_GRP_ID,462,8,CH                                                        
OPEN_UTK_DFT_GRP,471,4,CH                                                       
OPEN_UTK_DFT_SECL,476,4,CH                                                      
OPEN_APPC_LINK,481,16,CH                                                        
OPEN_AUDIT_CODE,498,11,CH                                                       
OPEN_OLD_REAL_UID,510,10,CH                                                     
OPEN_OLD_EFF_UID,521,10,CH                                                      
OPEN_OLD_SAVED_UID,532,10,CH                                                    
OPEN_OLD_REAL_GID,543,10,CH                                                     
OPEN_OLD_EFF_GID,554,10,CH                                                      
OPEN_OLD_SAVED_GID,565,10,CH                                                    
OPEN_PATH_NAME,576,1023,CH                                                      
OPEN_FILE_ID,1600,32,CH                                                         
OPEN_FILE_OWN_UID,1633,10,CH                                                    
OPEN_FILE_OWN_GID,1644,10,CH                                                    
OPEN_OLD_S_ISGID,1655,4,CH                                                      
OPEN_OLD_S_ISUID,1660,4,CH                                                      
OPEN_OLD_S_ISVTX,1665,4,CH                                                      
OPEN_OLD_OWN_READ,1670,4,CH                                                     
OPEN_OLD_OWN_WRITE,1675,4,CH                                                    
OPEN_OLD_OWN_EXEC,1680,4,CH                                                     
OPEN_OLD_GRP_READ,1685,4,CH                                                     
OPEN_OLD_GRP_WRITE,1690,4,CH                                                    
OPEN_OLD_GRP_EXEC,1695,4,CH                                                     
OPEN_OLD_OTH_READ,1700,4,CH                                                     
OPEN_OLD_OTH_WRITE,1705,4,CH                                                    
OPEN_OLD_OTH_EXEC,1710,4,CH                                                     
OPEN_NEW_S_ISGID,1715,4,CH                                                      
OPEN_NEW_S_ISUID,1720,4,CH                                                      
OPEN_NEW_S_ISVTX,1725,4,CH                                                      
OPEN_NEW_OWN_READ,1730,4,CH                                                     
OPEN_NEW_OWN_WRITE,1735,4,CH                                                    
OPEN_NEW_OWN_EXEC,1740,4,CH                                                     
OPEN_NEW_GRP_READ,1745,4,CH                                                     
OPEN_NEW_GRP_WRITE,1750,4,CH                                                    
OPEN_NEW_GRP_EXEC,1755,4,CH                                                     
OPEN_NEW_OTH_READ,1760,4,CH                                                     
OPEN_NEW_OTH_WRITE,1765,4,CH                                                    
OPEN_NEW_OTH_EXEC,1770,4,CH                                                     
OPEN_UNEW_READ,1775,8,CH                                                        
OPEN_UNEW_WRITE,1784,8,CH                                                       
OPEN_UNEW_EXEC,1793,8,CH                                                        
OPEN_ANEW_READ,1802,8,CH                                                        
OPEN_ANEW_WRITE,1811,8,CH                                                       
OPEN_ANEW_EXEC,1820,8,CH                                                        
OPEN_REQ_S_ISGID,1829,4,CH                                                      
OPEN_REQ_S_ISUID,1834,4,CH                                                      
OPEN_REQ_S_ISVTX,1839,4,CH                                                      
OPEN_REQ_OWN_READ,1844,4,CH                                                     
OPEN_REQ_OWN_WRITE,1849,4,CH                                                    
OPEN_REQ_OWN_EXEC,1854,4,CH                                                     
OPEN_REQ_GRP_READ,1859,4,CH                                                     
OPEN_REQ_GRP_WRITE,1864,4,CH                                                    
OPEN_REQ_GRP_EXEC,1869,4,CH                                                     
OPEN_REQ_OTH_READ,1874,4,CH                                                     
OPEN_REQ_OTH_WRITE,1879,4,CH                                                    
OPEN_REQ_OTH_EXEC,1884,4,CH                                                     
OPEN_FILEPOOL,1889,8,CH                                                         
OPEN_FILESPACE,1898,8,CH                                                        
OPEN_INODE,1907,10,CH                                                           
OPEN_SCID,1918,10,CH                                                            
OPEN_DFLT_PROCESS,1929,4,CH                                                     
OPEN_UTK_NETW,1934,8,CH                                                         
*------------------------------------------------*                              
*                     PTRACE                     *                              
*------------------------------------------------*                              
PTRC_EVENT_TYPE,5,8,CH                                                          
PTRC_EVENT_QUAL,14,8,CH                                                         
PTRC_TIME_WRITTEN,23,8,CH                                                       
PTRC_DATE_WRITTEN,32,10,CH                                                      
PTRC_SYSTEM_SMFID,43,4,CH                                                       
PTRC_VIOLATION,48,1,CH                                                          
PTRC_USER_NDFND,53,1,CH                                                         
PTRC_USER_WARNING,58,1,CH                                                       
PTRC_EVT_USER_ID,63,8,CH                                                        
PTRC_EVT_GRP_ID,72,8,CH                                                         
PTRC_AUTH_NORMAL,81,1,CH                                                        
PTRC_AUTH_SPECIAL,86,1,CH                                                       
PTRC_AUTH_OPER,91,1,CH                                                          
PTRC_AUTH_AUDIT,96,1,CH                                                         
PTRC_AUTH_EXIT,101,1,CH                                                         
PTRC_AUTH_FAILSFT,106,1,CH                                                      
PTRC_AUTH_BYPASS,111,1,CH                                                       
PTRC_AUTH_TRUSTED,116,1,CH                                                      
PTRC_LOG_CLASS,121,1,CH                                                         
PTRC_LOG_USER,126,1,CH                                                          
PTRC_LOG_SPECIAL,131,1,CH                                                       
PTRC_LOG_ACCESS,136,1,CH                                                        
PTRC_LOG_RACINIT,141,1,CH                                                       
PTRC_LOG_ALWAYS,146,1,CH                                                        
PTRC_LOG_CMDVIOL,151,1,CH                                                       
PTRC_LOG_GLOBAL,156,1,CH                                                        
PTRC_TERM_LEVEL,161,3,CH                                                        
PTRC_BACKOUT_FAIL,165,1,CH                                                      
PTRC_PROF_SAME,170,1,CH                                                         
PTRC_TERM,175,8,CH                                                              
PTRC_JOB_NAME,184,8,CH                                                          
PTRC_READ_TIME,193,8,CH                                                         
PTRC_READ_DATE,202,10,CH                                                        
PTRC_SMF_USER_ID,213,8,CH                                                       
PTRC_LOG_LEVEL,222,1,CH                                                         
PTRC_LOG_VMEVENT,227,1,CH                                                       
PTRC_LOG_LOGOPT,232,1,CH                                                        
PTRC_LOG_SECL,237,1,CH                                                          
PTRC_LOG_COMPATM,242,1,CH                                                       
PTRC_LOG_APPLAUD,247,1,CH                                                       
PTRC_LOG_NONOMVS,252,1,CH                                                       
PTRC_LOG_OMVSNPRV,257,1,CH                                                      
PTRC_AUTH_OMVSSU,262,1,CH                                                       
PTRC_AUTH_OMVSSYS,267,1,CH                                                      
PTRC_USR_SECL,272,8,CH                                                          
PTRC_RACF_VERSION,281,4,CH                                                      
PTRC_CLASS,286,8,CH                                                             
PTRC_USER_NAME,295,20,CH                                                        
PTRC_UTK_ENCR,316,4,CH                                                          
PTRC_UTK_PRE19,321,4,CH                                                         
PTRC_UTK_VERPROF,326,4,CH                                                       
PTRC_UTK_NJEUNUSR,331,4,CH                                                      
PTRC_UTK_LOGUSR,336,4,CH                                                        
PTRC_UTK_SPECIAL,341,4,CH                                                       
PTRC_UTK_DEFAULT,346,4,CH                                                       
PTRC_UTK_UNKNUSR,351,4,CH                                                       
PTRC_UTK_ERROR,356,4,CH                                                         
PTRC_UTK_TRUSTED,361,4,CH                                                       
PTRC_UTK_SESSTYPE,366,8,CH                                                      
PTRC_UTK_SURROGAT,375,4,CH                                                      
PTRC_UTK_REMOTE,380,4,CH                                                        
PTRC_UTK_PRIV,385,4,CH                                                          
PTRC_UTK_SECL,390,8,CH                                                          
PTRC_UTK_EXECNODE,399,8,CH                                                      
PTRC_UTK_SUSER_ID,408,8,CH                                                      
PTRC_UTK_SNODE,417,8,CH                                                         
PTRC_UTK_SGRP_ID,426,8,CH                                                       
PTRC_UTK_SPOE,435,8,CH                                                          
PTRC_UTK_SPCLASS,444,8,CH                                                       
PTRC_UTK_USER_ID,453,8,CH                                                       
PTRC_UTK_GRP_ID,462,8,CH                                                        
PTRC_UTK_DFT_GRP,471,4,CH                                                       
PTRC_UTK_DFT_SECL,476,4,CH                                                      
PTRC_APPC_LINK,481,16,CH                                                        
PTRC_AUDIT_CODE,498,11,CH                                                       
PTRC_OLD_REAL_UID,510,10,CH                                                     
PTRC_OLD_EFF_UID,521,10,CH                                                      
PTRC_OLD_SAVED_UID,532,10,CH                                                    
PTRC_OLD_REAL_GID,543,10,CH                                                     
PTRC_OLD_EFF_GID,554,10,CH                                                      
PTRC_OLD_SAVED_GID,565,10,CH                                                    
PTRC_TGT_REAL_UID,576,10,CH                                                     
PTRC_TGT_EFF_UID,587,10,CH                                                      
PTRC_TGT_SAVED_UID,598,10,CH                                                    
PTRC_TGT_REAL_GID,609,10,CH                                                     
PTRC_TGT_EFF_GID,620,10,CH                                                      
PTRC_TGT_SAVED_GID,631,10,CH                                                    
PTRC_TGT_PID,642,10,CH                                                          
PTRC_DFLT_PROCESS,653,4,CH                                                      
PTRC_UTK_NETW,658,8,CH                                                          
*------------------------------------------------*                              
*                    RENAMEF                     *                              
*------------------------------------------------*                              
RENF_EVENT_TYPE,5,8,CH                                                          
RENF_EVENT_QUAL,14,8,CH                                                         
RENF_TIME_WRITTEN,23,8,CH                                                       
RENF_DATE_WRITTEN,32,10,CH                                                      
RENF_SYSTEM_SMFID,43,4,CH                                                       
RENF_VIOLATION,48,1,CH                                                          
RENF_USER_NDFND,53,1,CH                                                         
RENF_USER_WARNING,58,1,CH                                                       
RENF_EVT_USER_ID,63,8,CH                                                        
RENF_EVT_GRP_ID,72,8,CH                                                         
RENF_AUTH_NORMAL,81,1,CH                                                        
RENF_AUTH_SPECIAL,86,1,CH                                                       
RENF_AUTH_OPER,91,1,CH                                                          
RENF_AUTH_AUDIT,96,1,CH                                                         
RENF_AUTH_EXIT,101,1,CH                                                         
RENF_AUTH_FAILSFT,106,1,CH                                                      
RENF_AUTH_BYPASS,111,1,CH                                                       
RENF_AUTH_TRUSTED,116,1,CH                                                      
RENF_LOG_CLASS,121,1,CH                                                         
RENF_LOG_USER,126,1,CH                                                          
RENF_LOG_SPECIAL,131,1,CH                                                       
RENF_LOG_ACCESS,136,1,CH                                                        
RENF_LOG_RACINIT,141,1,CH                                                       
RENF_LOG_ALWAYS,146,1,CH                                                        
RENF_LOG_CMDVIOL,151,1,CH                                                       
RENF_LOG_GLOBAL,156,1,CH                                                        
RENF_TERM_LEVEL,161,3,CH                                                        
RENF_BACKOUT_FAIL,165,1,CH                                                      
RENF_PROF_SAME,170,1,CH                                                         
RENF_TERM,175,8,CH                                                              
RENF_JOB_NAME,184,8,CH                                                          
RENF_READ_TIME,193,8,CH                                                         
RENF_READ_DATE,202,10,CH                                                        
RENF_SMF_USER_ID,213,8,CH                                                       
RENF_LOG_LEVEL,222,1,CH                                                         
RENF_LOG_VMEVENT,227,1,CH                                                       
RENF_LOG_LOGOPT,232,1,CH                                                        
RENF_LOG_SECL,237,1,CH                                                          
RENF_LOG_COMPATM,242,1,CH                                                       
RENF_LOG_APPLAUD,247,1,CH                                                       
RENF_LOG_NONOMVS,252,1,CH                                                       
RENF_LOG_OMVSNPRV,257,1,CH                                                      
RENF_AUTH_OMVSSU,262,1,CH                                                       
RENF_AUTH_OMVSSYS,267,1,CH                                                      
RENF_USR_SECL,272,8,CH                                                          
RENF_RACF_VERSION,281,4,CH                                                      
RENF_CLASS,286,8,CH                                                             
RENF_USER_NAME,295,20,CH                                                        
RENF_UTK_ENCR,316,4,CH                                                          
RENF_UTK_PRE19,321,4,CH                                                         
RENF_UTK_VERPROF,326,4,CH                                                       
RENF_UTK_NJEUNUSR,331,4,CH                                                      
RENF_UTK_LOGUSR,336,4,CH                                                        
RENF_UTK_SPECIAL,341,4,CH                                                       
RENF_UTK_DEFAULT,346,4,CH                                                       
RENF_UTK_UNKNUSR,351,4,CH                                                       
RENF_UTK_ERROR,356,4,CH                                                         
RENF_UTK_TRUSTED,361,4,CH                                                       
RENF_UTK_SESSTYPE,366,8,CH                                                      
RENF_UTK_SURROGAT,375,4,CH                                                      
RENF_UTK_REMOTE,380,4,CH                                                        
RENF_UTK_PRIV,385,4,CH                                                          
RENF_UTK_SECL,390,8,CH                                                          
RENF_UTK_EXECNODE,399,8,CH                                                      
RENF_UTK_SUSER_ID,408,8,CH                                                      
RENF_UTK_SNODE,417,8,CH                                                         
RENF_UTK_SGRP_ID,426,8,CH                                                       
RENF_UTK_SPOE,435,8,CH                                                          
RENF_UTK_SPCLASS,444,8,CH                                                       
RENF_UTK_USER_ID,453,8,CH                                                       
RENF_UTK_GRP_ID,462,8,CH                                                        
RENF_UTK_DFT_GRP,471,4,CH                                                       
RENF_UTK_DFT_SECL,476,4,CH                                                      
RENF_APPC_LINK,481,16,CH                                                        
RENF_AUDIT_CODE,498,11,CH                                                       
RENF_OLD_REAL_UID,510,10,CH                                                     
RENF_OLD_EFF_UID,521,10,CH                                                      
RENF_OLD_SAVED_UID,532,10,CH                                                    
RENF_OLD_REAL_GID,543,10,CH                                                     
RENF_OLD_EFF_GID,554,10,CH                                                      
RENF_OLD_SAVED_GID,565,10,CH                                                    
RENF_PATH_NAME,576,1023,CH                                                      
RENF_FILE_ID,1600,32,CH                                                         
RENF_FILE_OWN_UID,1633,10,CH                                                    
RENF_FILE_OWN_GID,1644,10,CH                                                    
RENF_PATH2,1655,1023,CH                                                         
RENF_FILE_ID2,2679,32,CH                                                        
RENF_OWNER_UID,2712,10,CH                                                       
RENF_OWNER_GID,2723,10,CH                                                       
RENF_PATH_TYPE,2734,4,CH                                                        
RENF_LAST_DELETED,2739,4,CH                                                     
RENF_FILEPOOL,2744,8,CH                                                         
RENF_FILESPACE,2753,8,CH                                                        
RENF_INODE,2762,10,CH                                                           
RENF_SCID,2773,10,CH                                                            
RENF_FILEPOOL2,2784,8,CH                                                        
RENF_FILESPACE2,2793,8,CH                                                       
RENF_INODE2,2802,10,CH                                                          
RENF_SCID2,2813,10,CH                                                           
RENF_DCE_LINK,2824,16,CH                                                        
RENF_AUTH_TYPE,2841,13,CH                                                       
RENF_DFLT_PROCESS,2855,4,CH                                                     
RENF_UTK_NETW,2860,8,CH                                                         
*------------------------------------------------*                              
*                     RMDIR                      *                              
*------------------------------------------------*                              
RDIR_EVENT_TYPE,5,8,CH                                                          
RDIR_EVENT_QUAL,14,8,CH                                                         
RDIR_TIME_WRITTEN,23,8,CH                                                       
RDIR_DATE_WRITTEN,32,10,CH                                                      
RDIR_SYSTEM_SMFID,43,4,CH                                                       
RDIR_VIOLATION,48,1,CH                                                          
RDIR_USER_NDFND,53,1,CH                                                         
RDIR_USER_WARNING,58,1,CH                                                       
RDIR_EVT_USER_ID,63,8,CH                                                        
RDIR_EVT_GRP_ID,72,8,CH                                                         
RDIR_AUTH_NORMAL,81,1,CH                                                        
RDIR_AUTH_SPECIAL,86,1,CH                                                       
RDIR_AUTH_OPER,91,1,CH                                                          
RDIR_AUTH_AUDIT,96,1,CH                                                         
RDIR_AUTH_EXIT,101,1,CH                                                         
RDIR_AUTH_FAILSFT,106,1,CH                                                      
RDIR_AUTH_BYPASS,111,1,CH                                                       
RDIR_AUTH_TRUSTED,116,1,CH                                                      
RDIR_LOG_CLASS,121,1,CH                                                         
RDIR_LOG_USER,126,1,CH                                                          
RDIR_LOG_SPECIAL,131,1,CH                                                       
RDIR_LOG_ACCESS,136,1,CH                                                        
RDIR_LOG_RACINIT,141,1,CH                                                       
RDIR_LOG_ALWAYS,146,1,CH                                                        
RDIR_LOG_CMDVIOL,151,1,CH                                                       
RDIR_LOG_GLOBAL,156,1,CH                                                        
RDIR_TERM_LEVEL,161,3,CH                                                        
RDIR_BACKOUT_FAIL,165,1,CH                                                      
RDIR_PROF_SAME,170,1,CH                                                         
RDIR_TERM,175,8,CH                                                              
RDIR_JOB_NAME,184,8,CH                                                          
RDIR_READ_TIME,193,8,CH                                                         
RDIR_READ_DATE,202,10,CH                                                        
RDIR_SMF_USER_ID,213,8,CH                                                       
RDIR_LOG_LEVEL,222,1,CH                                                         
RDIR_LOG_VMEVENT,227,1,CH                                                       
RDIR_LOG_LOGOPT,232,1,CH                                                        
RDIR_LOG_SECL,237,1,CH                                                          
RDIR_LOG_COMPATM,242,1,CH                                                       
RDIR_LOG_APPLAUD,247,1,CH                                                       
RDIR_LOG_NONOMVS,252,1,CH                                                       
RDIR_LOG_OMVSNPRV,257,1,CH                                                      
RDIR_AUTH_OMVSSU,262,1,CH                                                       
RDIR_AUTH_OMVSSYS,267,1,CH                                                      
RDIR_USR_SECL,272,8,CH                                                          
RDIR_RACF_VERSION,281,4,CH                                                      
RDIR_CLASS,286,8,CH                                                             
RDIR_USER_NAME,295,20,CH                                                        
RDIR_UTK_ENCR,316,4,CH                                                          
RDIR_UTK_PRE19,321,4,CH                                                         
RDIR_UTK_VERPROF,326,4,CH                                                       
RDIR_UTK_NJEUNUSR,331,4,CH                                                      
RDIR_UTK_LOGUSR,336,4,CH                                                        
RDIR_UTK_SPECIAL,341,4,CH                                                       
RDIR_UTK_DEFAULT,346,4,CH                                                       
RDIR_UTK_UNKNUSR,351,4,CH                                                       
RDIR_UTK_ERROR,356,4,CH                                                         
RDIR_UTK_TRUSTED,361,4,CH                                                       
RDIR_UTK_SESSTYPE,366,8,CH                                                      
RDIR_UTK_SURROGAT,375,4,CH                                                      
RDIR_UTK_REMOTE,380,4,CH                                                        
RDIR_UTK_PRIV,385,4,CH                                                          
RDIR_UTK_SECL,390,8,CH                                                          
RDIR_UTK_EXECNODE,399,8,CH                                                      
RDIR_UTK_SUSER_ID,408,8,CH                                                      
RDIR_UTK_SNODE,417,8,CH                                                         
RDIR_UTK_SGRP_ID,426,8,CH                                                       
RDIR_UTK_SPOE,435,8,CH                                                          
RDIR_UTK_SPCLASS,444,8,CH                                                       
RDIR_UTK_USER_ID,453,8,CH                                                       
RDIR_UTK_GRP_ID,462,8,CH                                                        
RDIR_UTK_DFT_GRP,471,4,CH                                                       
RDIR_UTK_DFT_SECL,476,4,CH                                                      
RDIR_APPC_LINK,481,16,CH                                                        
RDIR_AUDIT_CODE,498,11,CH                                                       
RDIR_OLD_REAL_UID,510,10,CH                                                     
RDIR_OLD_EFF_UID,521,10,CH                                                      
RDIR_OLD_SAVED_UID,532,10,CH                                                    
RDIR_OLD_REAL_GID,543,10,CH                                                     
RDIR_OLD_EFF_GID,554,10,CH                                                      
RDIR_OLD_SAVED_GID,565,10,CH                                                    
RDIR_PATH_NAME,576,1023,CH                                                      
RDIR_FILE_ID,1600,32,CH                                                         
RDIR_FILE_OWN_UID,1633,10,CH                                                    
RDIR_FILE_OWN_GID,1644,10,CH                                                    
RDIR_FILEPOOL,1655,8,CH                                                         
RDIR_FILESPACE,1664,8,CH                                                        
RDIR_INODE,1673,10,CH                                                           
RDIR_SCID,1684,10,CH                                                            
RDIR_DCE_LINK,1695,16,CH                                                        
RDIR_AUTH_TYPE,1712,13,CH                                                       
RDIR_DFLT_PROCESS,1726,4,CH                                                     
RDIR_UTK_NETW,1731,8,CH                                                         
*------------------------------------------------*                              
*                    SETEGID                     *                              
*------------------------------------------------*                              
SEGI_EVENT_TYPE,5,8,CH                                                          
SEGI_EVENT_QUAL,14,8,CH                                                         
SEGI_TIME_WRITTEN,23,8,CH                                                       
SEGI_DATE_WRITTEN,32,10,CH                                                      
SEGI_SYSTEM_SMFID,43,4,CH                                                       
SEGI_VIOLATION,48,1,CH                                                          
SEGI_USER_NDFND,53,1,CH                                                         
SEGI_USER_WARNING,58,1,CH                                                       
SEGI_EVT_USER_ID,63,8,CH                                                        
SEGI_EVT_GRP_ID,72,8,CH                                                         
SEGI_AUTH_NORMAL,81,1,CH                                                        
SEGI_AUTH_SPECIAL,86,1,CH                                                       
SEGI_AUTH_OPER,91,1,CH                                                          
SEGI_AUTH_AUDIT,96,1,CH                                                         
SEGI_AUTH_EXIT,101,1,CH                                                         
SEGI_AUTH_FAILSFT,106,1,CH                                                      
SEGI_AUTH_BYPASS,111,1,CH                                                       
SEGI_AUTH_TRUSTED,116,1,CH                                                      
SEGI_LOG_CLASS,121,1,CH                                                         
SEGI_LOG_USER,126,1,CH                                                          
SEGI_LOG_SPECIAL,131,1,CH                                                       
SEGI_LOG_ACCESS,136,1,CH                                                        
SEGI_LOG_RACINIT,141,1,CH                                                       
SEGI_LOG_ALWAYS,146,1,CH                                                        
SEGI_LOG_CMDVIOL,151,1,CH                                                       
SEGI_LOG_GLOBAL,156,1,CH                                                        
SEGI_TERM_LEVEL,161,3,CH                                                        
SEGI_BACKOUT_FAIL,165,1,CH                                                      
SEGI_PROF_SAME,170,1,CH                                                         
SEGI_TERM,175,8,CH                                                              
SEGI_JOB_NAME,184,8,CH                                                          
SEGI_READ_TIME,193,8,CH                                                         
SEGI_READ_DATE,202,10,CH                                                        
SEGI_SMF_USER_ID,213,8,CH                                                       
SEGI_LOG_LEVEL,222,1,CH                                                         
SEGI_LOG_VMEVENT,227,1,CH                                                       
SEGI_LOG_LOGOPT,232,1,CH                                                        
SEGI_LOG_SECL,237,1,CH                                                          
SEGI_LOG_COMPATM,242,1,CH                                                       
SEGI_LOG_APPLAUD,247,1,CH                                                       
SEGI_LOG_NONOMVS,252,1,CH                                                       
SEGI_LOG_OMVSNPRV,257,1,CH                                                      
SEGI_AUTH_OMVSSU,262,1,CH                                                       
SEGI_AUTH_OMVSSYS,267,1,CH                                                      
SEGI_USR_SECL,272,8,CH                                                          
SEGI_RACF_VERSION,281,4,CH                                                      
SEGI_CLASS,286,8,CH                                                             
SEGI_USER_NAME,295,20,CH                                                        
SEGI_UTK_ENCR,316,4,CH                                                          
SEGI_UTK_PRE19,321,4,CH                                                         
SEGI_UTK_VERPROF,326,4,CH                                                       
SEGI_UTK_NJEUNUSR,331,4,CH                                                      
SEGI_UTK_LOGUSR,336,4,CH                                                        
SEGI_UTK_SPECIAL,341,4,CH                                                       
SEGI_UTK_DEFAULT,346,4,CH                                                       
SEGI_UTK_UNKNUSR,351,4,CH                                                       
SEGI_UTK_ERROR,356,4,CH                                                         
SEGI_UTK_TRUSTED,361,4,CH                                                       
SEGI_UTK_SESSTYPE,366,8,CH                                                      
SEGI_UTK_SURROGAT,375,4,CH                                                      
SEGI_UTK_REMOTE,380,4,CH                                                        
SEGI_UTK_PRIV,385,4,CH                                                          
SEGI_UTK_SECL,390,8,CH                                                          
SEGI_UTK_EXECNODE,399,8,CH                                                      
SEGI_UTK_SUSER_ID,408,8,CH                                                      
SEGI_UTK_SNODE,417,8,CH                                                         
SEGI_UTK_SGRP_ID,426,8,CH                                                       
SEGI_UTK_SPOE,435,8,CH                                                          
SEGI_UTK_SPCLASS,444,8,CH                                                       
SEGI_UTK_USER_ID,453,8,CH                                                       
SEGI_UTK_GRP_ID,462,8,CH                                                        
SEGI_UTK_DFT_GRP,471,4,CH                                                       
SEGI_UTK_DFT_SECL,476,4,CH                                                      
SEGI_APPC_LINK,481,16,CH                                                        
SEGI_AUDIT_CODE,498,11,CH                                                       
SEGI_OLD_REAL_UID,510,10,CH                                                     
SEGI_OLD_EFF_UID,521,10,CH                                                      
SEGI_OLD_SAVED_UID,532,10,CH                                                    
SEGI_OLD_REAL_GID,543,10,CH                                                     
SEGI_OLD_EFF_GID,554,10,CH                                                      
SEGI_OLD_SAVED_GID,565,10,CH                                                    
SEGI_NEW_REAL_GID,576,10,CH                                                     
SEGI_NEW_EFF_GID,587,10,CH                                                      
SEGI_NEW_SAVED_GID,598,10,CH                                                    
SEGI_GID,609,10,CH                                                              
SEGI_DFLT_PROCESS,620,4,CH                                                      
SEGI_UTK_NETW,625,8,CH                                                          
*------------------------------------------------*                              
*                    SETEUID                     *                              
*------------------------------------------------*                              
SEUI_EVENT_TYPE,5,8,CH                                                          
SEUI_EVENT_QUAL,14,8,CH                                                         
SEUI_TIME_WRITTEN,23,8,CH                                                       
SEUI_DATE_WRITTEN,32,10,CH                                                      
SEUI_SYSTEM_SMFID,43,4,CH                                                       
SEUI_VIOLATION,48,1,CH                                                          
SEUI_USER_NDFND,53,1,CH                                                         
SEUI_USER_WARNING,58,1,CH                                                       
SEUI_EVT_USER_ID,63,8,CH                                                        
SEUI_EVT_GRP_ID,72,8,CH                                                         
SEUI_AUTH_NORMAL,81,1,CH                                                        
SEUI_AUTH_SPECIAL,86,1,CH                                                       
SEUI_AUTH_OPER,91,1,CH                                                          
SEUI_AUTH_AUDIT,96,1,CH                                                         
SEUI_AUTH_EXIT,101,1,CH                                                         
SEUI_AUTH_FAILSFT,106,1,CH                                                      
SEUI_AUTH_BYPASS,111,1,CH                                                       
SEUI_AUTH_TRUSTED,116,1,CH                                                      
SEUI_LOG_CLASS,121,1,CH                                                         
SEUI_LOG_USER,126,1,CH                                                          
SEUI_LOG_SPECIAL,131,1,CH                                                       
SEUI_LOG_ACCESS,136,1,CH                                                        
SEUI_LOG_RACINIT,141,1,CH                                                       
SEUI_LOG_ALWAYS,146,1,CH                                                        
SEUI_LOG_CMDVIOL,151,1,CH                                                       
SEUI_LOG_GLOBAL,156,1,CH                                                        
SEUI_TERM_LEVEL,161,3,CH                                                        
SEUI_BACKOUT_FAIL,165,1,CH                                                      
SEUI_PROF_SAME,170,1,CH                                                         
SEUI_TERM,175,8,CH                                                              
SEUI_JOB_NAME,184,8,CH                                                          
SEUI_READ_TIME,193,8,CH                                                         
SEUI_READ_DATE,202,10,CH                                                        
SEUI_SMF_USER_ID,213,8,CH                                                       
SEUI_LOG_LEVEL,222,1,CH                                                         
SEUI_LOG_VMEVENT,227,1,CH                                                       
SEUI_LOG_LOGOPT,232,1,CH                                                        
SEUI_LOG_SECL,237,1,CH                                                          
SEUI_LOG_COMPATM,242,1,CH                                                       
SEUI_LOG_APPLAUD,247,1,CH                                                       
SEUI_LOG_NONOMVS,252,1,CH                                                       
SEUI_LOG_OMVSNPRV,257,1,CH                                                      
SEUI_AUTH_OMVSSU,262,1,CH                                                       
SEUI_AUTH_OMVSSYS,267,1,CH                                                      
SEUI_USR_SECL,272,8,CH                                                          
SEUI_RACF_VERSION,281,4,CH                                                      
SEUI_CLASS,286,8,CH                                                             
SEUI_USER_NAME,295,20,CH                                                        
SEUI_UTK_ENCR,316,4,CH                                                          
SEUI_UTK_PRE19,321,4,CH                                                         
SEUI_UTK_VERPROF,326,4,CH                                                       
SEUI_UTK_NJEUNUSR,331,4,CH                                                      
SEUI_UTK_LOGUSR,336,4,CH                                                        
SEUI_UTK_SPECIAL,341,4,CH                                                       
SEUI_UTK_DEFAULT,346,4,CH                                                       
SEUI_UTK_UNKNUSR,351,4,CH                                                       
SEUI_UTK_ERROR,356,4,CH                                                         
SEUI_UTK_TRUSTED,361,4,CH                                                       
SEUI_UTK_SESSTYPE,366,8,CH                                                      
SEUI_UTK_SURROGAT,375,4,CH                                                      
SEUI_UTK_REMOTE,380,4,CH                                                        
SEUI_UTK_PRIV,385,4,CH                                                          
SEUI_UTK_SECL,390,8,CH                                                          
SEUI_UTK_EXECNODE,399,8,CH                                                      
SEUI_UTK_SUSER_ID,408,8,CH                                                      
SEUI_UTK_SNODE,417,8,CH                                                         
SEUI_UTK_SGRP_ID,426,8,CH                                                       
SEUI_UTK_SPOE,435,8,CH                                                          
SEUI_UTK_SPCLASS,444,8,CH                                                       
SEUI_UTK_USER_ID,453,8,CH                                                       
SEUI_UTK_GRP_ID,462,8,CH                                                        
SEUI_UTK_DFT_GRP,471,4,CH                                                       
SEUI_UTK_DFT_SECL,476,4,CH                                                      
SEUI_APPC_LINK,481,16,CH                                                        
SEUI_AUDIT_CODE,498,11,CH                                                       
SEUI_OLD_REAL_UID,510,10,CH                                                     
SEUI_OLD_EFF_UID,521,10,CH                                                      
SEUI_OLD_SAVED_UID,532,10,CH                                                    
SEUI_OLD_REAL_GID,543,10,CH                                                     
SEUI_OLD_EFF_GID,554,10,CH                                                      
SEUI_OLD_SAVED_GID,565,10,CH                                                    
SEUI_NEW_REAL_UID,576,10,CH                                                     
SEUI_NEW_EFF_UID,587,10,CH                                                      
SEUI_NEW_SAVED_UID,598,10,CH                                                    
SEUI_UID,609,10,CH                                                              
SEUI_DFLT_PROCESS,620,4,CH                                                      
SEUI_UTK_NETW,625,8,CH                                                          
*------------------------------------------------*                              
*                     SETGID                     *                              
*------------------------------------------------*                              
SGI_EVENT_TYPE,5,8,CH                                                           
SGI_EVENT_QUAL,14,8,CH                                                          
SGI_TIME_WRITTEN,23,8,CH                                                        
SGI_DATE_WRITTEN,32,10,CH                                                       
SGI_SYSTEM_SMFID,43,4,CH                                                        
SGI_VIOLATION,48,1,CH                                                           
SGI_USER_NDFND,53,1,CH                                                          
SGI_USER_WARNING,58,1,CH                                                        
SGI_EVT_USER_ID,63,8,CH                                                         
SGI_EVT_GRP_ID,72,8,CH                                                          
SGI_AUTH_NORMAL,81,1,CH                                                         
SGI_AUTH_SPECIAL,86,1,CH                                                        
SGI_AUTH_OPER,91,1,CH                                                           
SGI_AUTH_AUDIT,96,1,CH                                                          
SGI_AUTH_EXIT,101,1,CH                                                          
SGI_AUTH_FAILSFT,106,1,CH                                                       
SGI_AUTH_BYPASS,111,1,CH                                                        
SGI_AUTH_TRUSTED,116,1,CH                                                       
SGI_LOG_CLASS,121,1,CH                                                          
SGI_LOG_USER,126,1,CH                                                           
SGI_LOG_SPECIAL,131,1,CH                                                        
SGI_LOG_ACCESS,136,1,CH                                                         
SGI_LOG_RACINIT,141,1,CH                                                        
SGI_LOG_ALWAYS,146,1,CH                                                         
SGI_LOG_CMDVIOL,151,1,CH                                                        
SGI_LOG_GLOBAL,156,1,CH                                                         
SGI_TERM_LEVEL,161,3,CH                                                         
SGI_BACKOUT_FAIL,165,1,CH                                                       
SGI_PROF_SAME,170,1,CH                                                          
SGI_TERM,175,8,CH                                                               
SGI_JOB_NAME,184,8,CH                                                           
SGI_READ_TIME,193,8,CH                                                          
SGI_READ_DATE,202,10,CH                                                         
SGI_SMF_USER_ID,213,8,CH                                                        
SGI_LOG_LEVEL,222,1,CH                                                          
SGI_LOG_VMEVENT,227,1,CH                                                        
SGI_LOG_LOGOPT,232,1,CH                                                         
SGI_LOG_SECL,237,1,CH                                                           
SGI_LOG_COMPATM,242,1,CH                                                        
SGI_LOG_APPLAUD,247,1,CH                                                        
SGI_LOG_NONOMVS,252,1,CH                                                        
SGI_LOG_OMVSNPRV,257,1,CH                                                       
SGI_AUTH_OMVSSU,262,1,CH                                                        
SGI_AUTH_OMVSSYS,267,1,CH                                                       
SGI_USR_SECL,272,8,CH                                                           
SGI_RACF_VERSION,281,4,CH                                                       
SGI_CLASS,286,8,CH                                                              
SGI_USER_NAME,295,20,CH                                                         
SGI_UTK_ENCR,316,4,CH                                                           
SGI_UTK_PRE19,321,4,CH                                                          
SGI_UTK_VERPROF,326,4,CH                                                        
SGI_UTK_NJEUNUSR,331,4,CH                                                       
SGI_UTK_LOGUSR,336,4,CH                                                         
SGI_UTK_SPECIAL,341,4,CH                                                        
SGI_UTK_DEFAULT,346,4,CH                                                        
SGI_UTK_UNKNUSR,351,4,CH                                                        
SGI_UTK_ERROR,356,4,CH                                                          
SGI_UTK_TRUSTED,361,4,CH                                                        
SGI_UTK_SESSTYPE,366,8,CH                                                       
SGI_UTK_SURROGAT,375,4,CH                                                       
SGI_UTK_REMOTE,380,4,CH                                                         
SGI_UTK_PRIV,385,4,CH                                                           
SGI_UTK_SECL,390,8,CH                                                           
SGI_UTK_EXECNODE,399,8,CH                                                       
SGI_UTK_SUSER_ID,408,8,CH                                                       
SGI_UTK_SNODE,417,8,CH                                                          
SGI_UTK_SGRP_ID,426,8,CH                                                        
SGI_UTK_SPOE,435,8,CH                                                           
SGI_UTK_SPCLASS,444,8,CH                                                        
SGI_UTK_USER_ID,453,8,CH                                                        
SGI_UTK_GRP_ID,462,8,CH                                                         
SGI_UTK_DFT_GRP,471,4,CH                                                        
SGI_UTK_DFT_SECL,476,4,CH                                                       
SGI_APPC_LINK,481,16,CH                                                         
SGI_AUDIT_CODE,498,11,CH                                                        
SGI_OLD_REAL_UID,510,10,CH                                                      
SGI_OLD_EFF_UID,521,10,CH                                                       
SGI_OLD_SAVED_UID,532,10,CH                                                     
SGI_OLD_REAL_GID,543,10,CH                                                      
SGI_OLD_EFF_GID,554,10,CH                                                       
SGI_OLD_SAVED_GID,565,10,CH                                                     
SGI_NEW_REAL_GID,576,10,CH                                                      
SGI_NEW_EFF_GID,587,10,CH                                                       
SGI_NEW_SAVED_GID,598,10,CH                                                     
SGI_GID,609,10,CH                                                               
SGI_DFLT_PROCESS,620,4,CH                                                       
SGI_UTK_NETW,625,8,CH                                                           
*------------------------------------------------*                              
*                     SETUID                     *                              
*------------------------------------------------*                              
SUI_EVENT_TYPE,5,8,CH                                                           
SUI_EVENT_QUAL,14,8,CH                                                          
SUI_TIME_WRITTEN,23,8,CH                                                        
SUI_DATE_WRITTEN,32,10,CH                                                       
SUI_SYSTEM_SMFID,43,4,CH                                                        
SUI_VIOLATION,48,1,CH                                                           
SUI_USER_NDFND,53,1,CH                                                          
SUI_USER_WARNING,58,1,CH                                                        
SUI_EVT_USER_ID,63,8,CH                                                         
SUI_EVT_GRP_ID,72,8,CH                                                          
SUI_AUTH_NORMAL,81,1,CH                                                         
SUI_AUTH_SPECIAL,86,1,CH                                                        
SUI_AUTH_OPER,91,1,CH                                                           
SUI_AUTH_AUDIT,96,1,CH                                                          
SUI_AUTH_EXIT,101,1,CH                                                          
SUI_AUTH_FAILSFT,106,1,CH                                                       
SUI_AUTH_BYPASS,111,1,CH                                                        
SUI_AUTH_TRUSTED,116,1,CH                                                       
SUI_LOG_CLASS,121,1,CH                                                          
SUI_LOG_USER,126,1,CH                                                           
SUI_LOG_SPECIAL,131,1,CH                                                        
SUI_LOG_ACCESS,136,1,CH                                                         
SUI_LOG_RACINIT,141,1,CH                                                        
SUI_LOG_ALWAYS,146,1,CH                                                         
SUI_LOG_CMDVIOL,151,1,CH                                                        
SUI_LOG_GLOBAL,156,1,CH                                                         
SUI_TERM_LEVEL,161,3,CH                                                         
SUI_BACKOUT_FAIL,165,1,CH                                                       
SUI_PROF_SAME,170,1,CH                                                          
SUI_TERM,175,8,CH                                                               
SUI_JOB_NAME,184,8,CH                                                           
SUI_READ_TIME,193,8,CH                                                          
SUI_READ_DATE,202,10,CH                                                         
SUI_SMF_USER_ID,213,8,CH                                                        
SUI_LOG_LEVEL,222,1,CH                                                          
SUI_LOG_VMEVENT,227,1,CH                                                        
SUI_LOG_LOGOPT,232,1,CH                                                         
SUI_LOG_SECL,237,1,CH                                                           
SUI_LOG_COMPATM,242,1,CH                                                        
SUI_LOG_APPLAUD,247,1,CH                                                        
SUI_LOG_NONOMVS,252,1,CH                                                        
SUI_LOG_OMVSNPRV,257,1,CH                                                       
SUI_AUTH_OMVSSU,262,1,CH                                                        
SUI_AUTH_OMVSSYS,267,1,CH                                                       
SUI_USR_SECL,272,8,CH                                                           
SUI_RACF_VERSION,281,4,CH                                                       
SUI_CLASS,286,8,CH                                                              
SUI_USER_NAME,295,20,CH                                                         
SUI_UTK_ENCR,316,4,CH                                                           
SUI_UTK_PRE19,321,4,CH                                                          
SUI_UTK_VERPROF,326,4,CH                                                        
SUI_UTK_NJEUNUSR,331,4,CH                                                       
SUI_UTK_LOGUSR,336,4,CH                                                         
SUI_UTK_SPECIAL,341,4,CH                                                        
SUI_UTK_DEFAULT,346,4,CH                                                        
SUI_UTK_UNKNUSR,351,4,CH                                                        
SUI_UTK_ERROR,356,4,CH                                                          
SUI_UTK_TRUSTED,361,4,CH                                                        
SUI_UTK_SESSTYPE,366,8,CH                                                       
SUI_UTK_SURROGAT,375,4,CH                                                       
SUI_UTK_REMOTE,380,4,CH                                                         
SUI_UTK_PRIV,385,4,CH                                                           
SUI_UTK_SECL,390,8,CH                                                           
SUI_UTK_EXECNODE,399,8,CH                                                       
SUI_UTK_SUSER_ID,408,8,CH                                                       
SUI_UTK_SNODE,417,8,CH                                                          
SUI_UTK_SGRP_ID,426,8,CH                                                        
SUI_UTK_SPOE,435,8,CH                                                           
SUI_UTK_SPCLASS,444,8,CH                                                        
SUI_UTK_USER_ID,453,8,CH                                                        
SUI_UTK_GRP_ID,462,8,CH                                                         
SUI_UTK_DFT_GRP,471,4,CH                                                        
SUI_UTK_DFT_SECL,476,4,CH                                                       
SUI_APPC_LINK,481,16,CH                                                         
SUI_AUDIT_CODE,498,11,CH                                                        
SUI_OLD_REAL_UID,510,10,CH                                                      
SUI_OLD_EFF_UID,521,10,CH                                                       
SUI_OLD_SAVED_UID,532,10,CH                                                     
SUI_OLD_REAL_GID,543,10,CH                                                      
SUI_OLD_EFF_GID,554,10,CH                                                       
SUI_OLD_SAVED_GID,565,10,CH                                                     
SUI_NEW_REAL_UID,576,10,CH                                                      
SUI_NEW_EFF_UID,587,10,CH                                                       
SUI_NEW_SAVED_UID,598,10,CH                                                     
SUI_UID,609,10,CH                                                               
SUI_DFLT_PROCESS,620,4,CH                                                       
SUI_UTK_NETW,625,8,CH                                                           
*------------------------------------------------*                              
*                    SYMLINK                     *                              
*------------------------------------------------*                              
SYML_EVENT_TYPE,5,8,CH                                                          
SYML_EVENT_QUAL,14,8,CH                                                         
SYML_TIME_WRITTEN,23,8,CH                                                       
SYML_DATE_WRITTEN,32,10,CH                                                      
SYML_SYSTEM_SMFID,43,4,CH                                                       
SYML_VIOLATION,48,1,CH                                                          
SYML_USER_NDFND,53,1,CH                                                         
SYML_USER_WARNING,58,1,CH                                                       
SYML_EVT_USER_ID,63,8,CH                                                        
SYML_EVT_GRP_ID,72,8,CH                                                         
SYML_AUTH_NORMAL,81,1,CH                                                        
SYML_AUTH_SPECIAL,86,1,CH                                                       
SYML_AUTH_OPER,91,1,CH                                                          
SYML_AUTH_AUDIT,96,1,CH                                                         
SYML_AUTH_EXIT,101,1,CH                                                         
SYML_AUTH_FAILSFT,106,1,CH                                                      
SYML_AUTH_BYPASS,111,1,CH                                                       
SYML_AUTH_TRUSTED,116,1,CH                                                      
SYML_LOG_CLASS,121,1,CH                                                         
SYML_LOG_USER,126,1,CH                                                          
SYML_LOG_SPECIAL,131,1,CH                                                       
SYML_LOG_ACCESS,136,1,CH                                                        
SYML_LOG_RACINIT,141,1,CH                                                       
SYML_LOG_ALWAYS,146,1,CH                                                        
SYML_LOG_CMDVIOL,151,1,CH                                                       
SYML_LOG_GLOBAL,156,1,CH                                                        
SYML_TERM_LEVEL,161,3,CH                                                        
SYML_BACKOUT_FAIL,165,1,CH                                                      
SYML_PROF_SAME,170,1,CH                                                         
SYML_TERM,175,8,CH                                                              
SYML_JOB_NAME,184,8,CH                                                          
SYML_READ_TIME,193,8,CH                                                         
SYML_READ_DATE,202,10,CH                                                        
SYML_SMF_USER_ID,213,8,CH                                                       
SYML_LOG_LEVEL,222,1,CH                                                         
SYML_LOG_VMEVENT,227,1,CH                                                       
SYML_LOG_LOGOPT,232,1,CH                                                        
SYML_LOG_SECL,237,1,CH                                                          
SYML_LOG_COMPATM,242,1,CH                                                       
SYML_LOG_APPLAUD,247,1,CH                                                       
SYML_LOG_NONOMVS,252,1,CH                                                       
SYML_LOG_OMVSNPRV,257,1,CH                                                      
SYML_AUTH_OMVSSU,262,1,CH                                                       
SYML_AUTH_OMVSSYS,267,1,CH                                                      
SYML_USR_SECL,272,8,CH                                                          
SYML_RACF_VERSION,281,4,CH                                                      
SYML_CLASS,286,8,CH                                                             
SYML_USER_NAME,295,20,CH                                                        
SYML_UTK_ENCR,316,4,CH                                                          
SYML_UTK_PRE19,321,4,CH                                                         
SYML_UTK_VERPROF,326,4,CH                                                       
SYML_UTK_NJEUNUSR,331,4,CH                                                      
SYML_UTK_LOGUSR,336,4,CH                                                        
SYML_UTK_SPECIAL,341,4,CH                                                       
SYML_UTK_DEFAULT,346,4,CH                                                       
SYML_UTK_UNKNUSR,351,4,CH                                                       
SYML_UTK_ERROR,356,4,CH                                                         
SYML_UTK_TRUSTED,361,4,CH                                                       
SYML_UTK_SESSTYPE,366,8,CH                                                      
SYML_UTK_SURROGAT,375,4,CH                                                      
SYML_UTK_REMOTE,380,4,CH                                                        
SYML_UTK_PRIV,385,4,CH                                                          
SYML_UTK_SECL,390,8,CH                                                          
SYML_UTK_EXECNODE,399,8,CH                                                      
SYML_UTK_SUSER_ID,408,8,CH                                                      
SYML_UTK_SNODE,417,8,CH                                                         
SYML_UTK_SGRP_ID,426,8,CH                                                       
SYML_UTK_SPOE,435,8,CH                                                          
SYML_UTK_SPCLASS,444,8,CH                                                       
SYML_UTK_USER_ID,453,8,CH                                                       
SYML_UTK_GRP_ID,462,8,CH                                                        
SYML_UTK_DFT_GRP,471,4,CH                                                       
SYML_UTK_DFT_SECL,476,4,CH                                                      
SYML_APPC_LINK,481,16,CH                                                        
SYML_AUDIT_CODE,498,11,CH                                                       
SYML_OLD_REAL_UID,510,10,CH                                                     
SYML_OLD_EFF_UID,521,10,CH                                                      
SYML_OLD_SAVED_UID,532,10,CH                                                    
SYML_OLD_REAL_GID,543,10,CH                                                     
SYML_OLD_EFF_GID,554,10,CH                                                      
SYML_OLD_SAVED_GID,565,10,CH                                                    
SYML_PATH_NAME,576,1023,CH                                                      
SYML_FILE_ID,1600,32,CH                                                         
SYML_FILE_OWN_UID,1633,10,CH                                                    
SYML_FILE_OWN_GID,1644,10,CH                                                    
SYML_SYMLINK_DATA,1655,1023,CH                                                  
SYML_FILEPOOL,2679,8,CH                                                         
SYML_FILESPACE,2688,8,CH                                                        
SYML_INODE,2697,10,CH                                                           
SYML_SCID,2708,10,CH                                                            
SYML_DFLT_PROCESS,2719,4,CH                                                     
SYML_UTK_NETW,2724,8,CH                                                         
*------------------------------------------------*                              
*                     UNLINK                     *                              
*------------------------------------------------*                              
UNL_EVENT_TYPE,5,8,CH                                                           
UNL_EVENT_QUAL,14,8,CH                                                          
UNL_TIME_WRITTEN,23,8,CH                                                        
UNL_DATE_WRITTEN,32,10,CH                                                       
UNL_SYSTEM_SMFID,43,4,CH                                                        
UNL_VIOLATION,48,1,CH                                                           
UNL_USER_NDFND,53,1,CH                                                          
UNL_USER_WARNING,58,1,CH                                                        
UNL_EVT_USER_ID,63,8,CH                                                         
UNL_EVT_GRP_ID,72,8,CH                                                          
UNL_AUTH_NORMAL,81,1,CH                                                         
UNL_AUTH_SPECIAL,86,1,CH                                                        
UNL_AUTH_OPER,91,1,CH                                                           
UNL_AUTH_AUDIT,96,1,CH                                                          
UNL_AUTH_EXIT,101,1,CH                                                          
UNL_AUTH_FAILSFT,106,1,CH                                                       
UNL_AUTH_BYPASS,111,1,CH                                                        
UNL_AUTH_TRUSTED,116,1,CH                                                       
UNL_LOG_CLASS,121,1,CH                                                          
UNL_LOG_USER,126,1,CH                                                           
UNL_LOG_SPECIAL,131,1,CH                                                        
UNL_LOG_ACCESS,136,1,CH                                                         
UNL_LOG_RACINIT,141,1,CH                                                        
UNL_LOG_ALWAYS,146,1,CH                                                         
UNL_LOG_CMDVIOL,151,1,CH                                                        
UNL_LOG_GLOBAL,156,1,CH                                                         
UNL_TERM_LEVEL,161,3,CH                                                         
UNL_BACKOUT_FAIL,165,1,CH                                                       
UNL_PROF_SAME,170,1,CH                                                          
UNL_TERM,175,8,CH                                                               
UNL_JOB_NAME,184,8,CH                                                           
UNL_READ_TIME,193,8,CH                                                          
UNL_READ_DATE,202,10,CH                                                         
UNL_SMF_USER_ID,213,8,CH                                                        
UNL_LOG_LEVEL,222,1,CH                                                          
UNL_LOG_VMEVENT,227,1,CH                                                        
UNL_LOG_LOGOPT,232,1,CH                                                         
UNL_LOG_SECL,237,1,CH                                                           
UNL_LOG_COMPATM,242,1,CH                                                        
UNL_LOG_APPLAUD,247,1,CH                                                        
UNL_LOG_NONOMVS,252,1,CH                                                        
UNL_LOG_OMVSNPRV,257,1,CH                                                       
UNL_AUTH_OMVSSU,262,1,CH                                                        
UNL_AUTH_OMVSSYS,267,1,CH                                                       
UNL_USR_SECL,272,8,CH                                                           
UNL_RACF_VERSION,281,4,CH                                                       
UNL_CLASS,286,8,CH                                                              
UNL_USER_NAME,295,20,CH                                                         
UNL_UTK_ENCR,316,4,CH                                                           
UNL_UTK_PRE19,321,4,CH                                                          
UNL_UTK_VERPROF,326,4,CH                                                        
UNL_UTK_NJEUNUSR,331,4,CH                                                       
UNL_UTK_LOGUSR,336,4,CH                                                         
UNL_UTK_SPECIAL,341,4,CH                                                        
UNL_UTK_DEFAULT,346,4,CH                                                        
UNL_UTK_UNKNUSR,351,4,CH                                                        
UNL_UTK_ERROR,356,4,CH                                                          
UNL_UTK_TRUSTED,361,4,CH                                                        
UNL_UTK_SESSTYPE,366,8,CH                                                       
UNL_UTK_SURROGAT,375,4,CH                                                       
UNL_UTK_REMOTE,380,4,CH                                                         
UNL_UTK_PRIV,385,4,CH                                                           
UNL_UTK_SECL,390,8,CH                                                           
UNL_UTK_EXECNODE,399,8,CH                                                       
UNL_UTK_SUSER_ID,408,8,CH                                                       
UNL_UTK_SNODE,417,8,CH                                                          
UNL_UTK_SGRP_ID,426,8,CH                                                        
UNL_UTK_SPOE,435,8,CH                                                           
UNL_UTK_SPCLASS,444,8,CH                                                        
UNL_UTK_USER_ID,453,8,CH                                                        
UNL_UTK_GRP_ID,462,8,CH                                                         
UNL_UTK_DFT_GRP,471,4,CH                                                        
UNL_UTK_DFT_SECL,476,4,CH                                                       
UNL_APPC_LINK,481,16,CH                                                         
UNL_AUDIT_CODE,498,11,CH                                                        
UNL_OLD_REAL_UID,510,10,CH                                                      
UNL_OLD_EFF_UID,521,10,CH                                                       
UNL_OLD_SAVED_UID,532,10,CH                                                     
UNL_OLD_REAL_GID,543,10,CH                                                      
UNL_OLD_EFF_GID,554,10,CH                                                       
UNL_OLD_SAVED_GID,565,10,CH                                                     
UNL_PATH_NAME,576,1023,CH                                                       
UNL_FILE_ID,1600,32,CH                                                          
UNL_FILE_OWN_UID,1633,10,CH                                                     
UNL_FILE_OWN_GID,1644,10,CH                                                     
UNL_LAST_DELETED,1655,4,CH                                                      
UNL_FILEPOOL,1660,8,CH                                                          
UNL_FILESPACE,1669,8,CH                                                         
UNL_INODE,1678,10,CH                                                            
UNL_SCID,1689,10,CH                                                             
UNL_DCE_LINK,1700,16,CH                                                         
UNL_AUTH_TYPE,1717,13,CH                                                        
UNL_DFLT_PROCESS,1731,4,CH                                                      
UNL_UTK_NETW,1736,8,CH                                                          
*------------------------------------------------*                              
*                    UMNTFSYS                    *                              
*------------------------------------------------*                              
UFS_EVENT_TYPE,5,8,CH                                                           
UFS_EVENT_QUAL,14,8,CH                                                          
UFS_TIME_WRITTEN,23,8,CH                                                        
UFS_DATE_WRITTEN,32,10,CH                                                       
UFS_SYSTEM_SMFID,43,4,CH                                                        
UFS_VIOLATION,48,1,CH                                                           
UFS_USER_NDFND,53,1,CH                                                          
UFS_USER_WARNING,58,1,CH                                                        
UFS_EVT_USER_ID,63,8,CH                                                         
UFS_EVT_GRP_ID,72,8,CH                                                          
UFS_AUTH_NORMAL,81,1,CH                                                         
UFS_AUTH_SPECIAL,86,1,CH                                                        
UFS_AUTH_OPER,91,1,CH                                                           
UFS_AUTH_AUDIT,96,1,CH                                                          
UFS_AUTH_EXIT,101,1,CH                                                          
UFS_AUTH_FAILSFT,106,1,CH                                                       
UFS_AUTH_BYPASS,111,1,CH                                                        
UFS_AUTH_TRUSTED,116,1,CH                                                       
UFS_LOG_CLASS,121,1,CH                                                          
UFS_LOG_USER,126,1,CH                                                           
UFS_LOG_SPECIAL,131,1,CH                                                        
UFS_LOG_ACCESS,136,1,CH                                                         
UFS_LOG_RACINIT,141,1,CH                                                        
UFS_LOG_ALWAYS,146,1,CH                                                         
UFS_LOG_CMDVIOL,151,1,CH                                                        
UFS_LOG_GLOBAL,156,1,CH                                                         
UFS_TERM_LEVEL,161,3,CH                                                         
UFS_BACKOUT_FAIL,165,1,CH                                                       
UFS_PROF_SAME,170,1,CH                                                          
UFS_TERM,175,8,CH                                                               
UFS_JOB_NAME,184,8,CH                                                           
UFS_READ_TIME,193,8,CH                                                          
UFS_READ_DATE,202,10,CH                                                         
UFS_SMF_USER_ID,213,8,CH                                                        
UFS_LOG_LEVEL,222,1,CH                                                          
UFS_LOG_VMEVENT,227,1,CH                                                        
UFS_LOG_LOGOPT,232,1,CH                                                         
UFS_LOG_SECL,237,1,CH                                                           
UFS_LOG_COMPATM,242,1,CH                                                        
UFS_LOG_APPLAUD,247,1,CH                                                        
UFS_LOG_NONOMVS,252,1,CH                                                        
UFS_LOG_OMVSNPRV,257,1,CH                                                       
UFS_AUTH_OMVSSU,262,1,CH                                                        
UFS_AUTH_OMVSSYS,267,1,CH                                                       
UFS_USR_SECL,272,8,CH                                                           
UFS_RACF_VERSION,281,4,CH                                                       
UFS_CLASS,286,8,CH                                                              
UFS_USER_NAME,295,20,CH                                                         
UFS_UTK_ENCR,316,4,CH                                                           
UFS_UTK_PRE19,321,4,CH                                                          
UFS_UTK_VERPROF,326,4,CH                                                        
UFS_UTK_NJEUNUSR,331,4,CH                                                       
UFS_UTK_LOGUSR,336,4,CH                                                         
UFS_UTK_SPECIAL,341,4,CH                                                        
UFS_UTK_DEFAULT,346,4,CH                                                        
UFS_UTK_UNKNUSR,351,4,CH                                                        
UFS_UTK_ERROR,356,4,CH                                                          
UFS_UTK_TRUSTED,361,4,CH                                                        
UFS_UTK_SESSTYPE,366,8,CH                                                       
UFS_UTK_SURROGAT,375,4,CH                                                       
UFS_UTK_REMOTE,380,4,CH                                                         
UFS_UTK_PRIV,385,4,CH                                                           
UFS_UTK_SECL,390,8,CH                                                           
UFS_UTK_EXECNODE,399,8,CH                                                       
UFS_UTK_SUSER_ID,408,8,CH                                                       
UFS_UTK_SNODE,417,8,CH                                                          
UFS_UTK_SGRP_ID,426,8,CH                                                        
UFS_UTK_SPOE,435,8,CH                                                           
UFS_UTK_SPCLASS,444,8,CH                                                        
UFS_UTK_USER_ID,453,8,CH                                                        
UFS_UTK_GRP_ID,462,8,CH                                                         
UFS_UTK_DFT_GRP,471,4,CH                                                        
UFS_UTK_DFT_SECL,476,4,CH                                                       
UFS_APPC_LINK,481,16,CH                                                         
UFS_AUDIT_CODE,498,11,CH                                                        
UFS_OLD_REAL_UID,510,10,CH                                                      
UFS_OLD_EFF_UID,521,10,CH                                                       
UFS_OLD_SAVED_UID,532,10,CH                                                     
UFS_OLD_REAL_GID,543,10,CH                                                      
UFS_OLD_EFF_GID,554,10,CH                                                       
UFS_OLD_SAVED_GID,565,10,CH                                                     
UFS_PATH_NAME,576,1023,CH                                                       
UFS_FILE_ID,1600,32,CH                                                          
UFS_FILE_OWN_UID,1633,10,CH                                                     
UFS_FILE_OWN_GID,1644,10,CH                                                     
UFS_HFS_DS_NAME,1655,44,CH                                                      
UFS_DCE_LINK,1700,16,CH                                                         
UFS_AUTH_TYPE,1717,13,CH                                                        
UFS_DFLT_PROCESS,1731,4,CH                                                      
UFS_UTK_NETW,1736,8,CH                                                          
*------------------------------------------------*                              
*                    CHKFOWN                     *                              
*------------------------------------------------*                              
CFOW_EVENT_TYPE,5,8,CH                                                          
CFOW_EVENT_QUAL,14,8,CH                                                         
CFOW_TIME_WRITTEN,23,8,CH                                                       
CFOW_DATE_WRITTEN,32,10,CH                                                      
CFOW_SYSTEM_SMFID,43,4,CH                                                       
CFOW_VIOLATION,48,1,CH                                                          
CFOW_USER_NDFND,53,1,CH                                                         
CFOW_USER_WARNING,58,1,CH                                                       
CFOW_EVT_USER_ID,63,8,CH                                                        
CFOW_EVT_GRP_ID,72,8,CH                                                         
CFOW_AUTH_NORMAL,81,1,CH                                                        
CFOW_AUTH_SPECIAL,86,1,CH                                                       
CFOW_AUTH_OPER,91,1,CH                                                          
CFOW_AUTH_AUDIT,96,1,CH                                                         
CFOW_AUTH_EXIT,101,1,CH                                                         
CFOW_AUTH_FAILSFT,106,1,CH                                                      
CFOW_AUTH_BYPASS,111,1,CH                                                       
CFOW_AUTH_TRUSTED,116,1,CH                                                      
CFOW_LOG_CLASS,121,1,CH                                                         
CFOW_LOG_USER,126,1,CH                                                          
CFOW_LOG_SPECIAL,131,1,CH                                                       
CFOW_LOG_ACCESS,136,1,CH                                                        
CFOW_LOG_RACINIT,141,1,CH                                                       
CFOW_LOG_ALWAYS,146,1,CH                                                        
CFOW_LOG_CMDVIOL,151,1,CH                                                       
CFOW_LOG_GLOBAL,156,1,CH                                                        
CFOW_TERM_LEVEL,161,3,CH                                                        
CFOW_BACKOUT_FAIL,165,1,CH                                                      
CFOW_PROF_SAME,170,1,CH                                                         
CFOW_TERM,175,8,CH                                                              
CFOW_JOB_NAME,184,8,CH                                                          
CFOW_READ_TIME,193,8,CH                                                         
CFOW_READ_DATE,202,10,CH                                                        
CFOW_SMF_USER_ID,213,8,CH                                                       
CFOW_LOG_LEVEL,222,1,CH                                                         
CFOW_LOG_VMEVENT,227,1,CH                                                       
CFOW_LOG_LOGOPT,232,1,CH                                                        
CFOW_LOG_SECL,237,1,CH                                                          
CFOW_LOG_COMPATM,242,1,CH                                                       
CFOW_LOG_APPLAUD,247,1,CH                                                       
CFOW_LOG_NONOMVS,252,1,CH                                                       
CFOW_LOG_OMVSNPRV,257,1,CH                                                      
CFOW_AUTH_OMVSSU,262,1,CH                                                       
CFOW_AUTH_OMVSSYS,267,1,CH                                                      
CFOW_USR_SECL,272,8,CH                                                          
CFOW_RACF_VERSION,281,4,CH                                                      
CFOW_CLASS,286,8,CH                                                             
CFOW_USER_NAME,295,20,CH                                                        
CFOW_UTK_ENCR,316,4,CH                                                          
CFOW_UTK_PRE19,321,4,CH                                                         
CFOW_UTK_VERPROF,326,4,CH                                                       
CFOW_UTK_NJEUNUSR,331,4,CH                                                      
CFOW_UTK_LOGUSR,336,4,CH                                                        
CFOW_UTK_SPECIAL,341,4,CH                                                       
CFOW_UTK_DEFAULT,346,4,CH                                                       
CFOW_UTK_UNKNUSR,351,4,CH                                                       
CFOW_UTK_ERROR,356,4,CH                                                         
CFOW_UTK_TRUSTED,361,4,CH                                                       
CFOW_UTK_SESSTYPE,366,8,CH                                                      
CFOW_UTK_SURROGAT,375,4,CH                                                      
CFOW_UTK_REMOTE,380,4,CH                                                        
CFOW_UTK_PRIV,385,4,CH                                                          
CFOW_UTK_SECL,390,8,CH                                                          
CFOW_UTK_EXECNODE,399,8,CH                                                      
CFOW_UTK_SUSER_ID,408,8,CH                                                      
CFOW_UTK_SNODE,417,8,CH                                                         
CFOW_UTK_SGRP_ID,426,8,CH                                                       
CFOW_UTK_SPOE,435,8,CH                                                          
CFOW_UTK_SPCLASS,444,8,CH                                                       
CFOW_UTK_USER_ID,453,8,CH                                                       
CFOW_UTK_GRP_ID,462,8,CH                                                        
CFOW_UTK_DFT_GRP,471,4,CH                                                       
CFOW_UTK_DFT_SECL,476,4,CH                                                      
CFOW_APPC_LINK,481,16,CH                                                        
CFOW_AUDIT_CODE,498,11,CH                                                       
CFOW_OLD_REAL_UID,510,10,CH                                                     
CFOW_OLD_EFF_UID,521,10,CH                                                      
CFOW_OLD_SAVED_UID,532,10,CH                                                    
CFOW_OLD_REAL_GID,543,10,CH                                                     
CFOW_OLD_EFF_GID,554,10,CH                                                      
CFOW_OLD_SAVED_GID,565,10,CH                                                    
CFOW_PATH_NAME,576,1023,CH                                                      
CFOW_FILE_ID,1600,32,CH                                                         
CFOW_FILE_OWN_UID,1633,10,CH                                                    
CFOW_FILE_OWN_GID,1644,10,CH                                                    
CFOW_FILEPOOL,1655,8,CH                                                         
CFOW_FILESPACE,1664,8,CH                                                        
CFOW_INODE,1673,10,CH                                                           
CFOW_SCID,1684,10,CH                                                            
CFOW_DCE_LINK,1695,16,CH                                                        
CFOW_AUTH_TYPE,1712,13,CH                                                       
CFOW_DFLT_PROCESS,1726,4,CH                                                     
CFOW_UTK_NETW,1731,8,CH                                                         
*------------------------------------------------*                              
*                    CHKPRIV                     *                              
*------------------------------------------------*                              
CPRV_EVENT_TYPE,5,8,CH                                                          
CPRV_EVENT_QUAL,14,8,CH                                                         
CPRV_TIME_WRITTEN,23,8,CH                                                       
CPRV_DATE_WRITTEN,32,10,CH                                                      
CPRV_SYSTEM_SMFID,43,4,CH                                                       
CPRV_VIOLATION,48,1,CH                                                          
CPRV_USER_NDFND,53,1,CH                                                         
CPRV_USER_WARNING,58,1,CH                                                       
CPRV_EVT_USER_ID,63,8,CH                                                        
CPRV_EVT_GRP_ID,72,8,CH                                                         
CPRV_AUTH_NORMAL,81,1,CH                                                        
CPRV_AUTH_SPECIAL,86,1,CH                                                       
CPRV_AUTH_OPER,91,1,CH                                                          
CPRV_AUTH_AUDIT,96,1,CH                                                         
CPRV_AUTH_EXIT,101,1,CH                                                         
CPRV_AUTH_FAILSFT,106,1,CH                                                      
CPRV_AUTH_BYPASS,111,1,CH                                                       
CPRV_AUTH_TRUSTED,116,1,CH                                                      
CPRV_LOG_CLASS,121,1,CH                                                         
CPRV_LOG_USER,126,1,CH                                                          
CPRV_LOG_SPECIAL,131,1,CH                                                       
CPRV_LOG_ACCESS,136,1,CH                                                        
CPRV_LOG_RACINIT,141,1,CH                                                       
CPRV_LOG_ALWAYS,146,1,CH                                                        
CPRV_LOG_CMDVIOL,151,1,CH                                                       
CPRV_LOG_GLOBAL,156,1,CH                                                        
CPRV_TERM_LEVEL,161,3,CH                                                        
CPRV_BACKOUT_FAIL,165,1,CH                                                      
CPRV_PROF_SAME,170,1,CH                                                         
CPRV_TERM,175,8,CH                                                              
CPRV_JOB_NAME,184,8,CH                                                          
CPRV_READ_TIME,193,8,CH                                                         
CPRV_READ_DATE,202,10,CH                                                        
CPRV_SMF_USER_ID,213,8,CH                                                       
CPRV_LOG_LEVEL,222,1,CH                                                         
CPRV_LOG_VMEVENT,227,1,CH                                                       
CPRV_LOG_LOGOPT,232,1,CH                                                        
CPRV_LOG_SECL,237,1,CH                                                          
CPRV_LOG_COMPATM,242,1,CH                                                       
CPRV_LOG_APPLAUD,247,1,CH                                                       
CPRV_LOG_NONOMVS,252,1,CH                                                       
CPRV_LOG_OMVSNPRV,257,1,CH                                                      
CPRV_AUTH_OMVSSU,262,1,CH                                                       
CPRV_AUTH_OMVSSYS,267,1,CH                                                      
CPRV_USR_SECL,272,8,CH                                                          
CPRV_RACF_VERSION,281,4,CH                                                      
CPRV_CLASS,286,8,CH                                                             
CPRV_USER_NAME,295,20,CH                                                        
CPRV_UTK_ENCR,316,4,CH                                                          
CPRV_UTK_PRE19,321,4,CH                                                         
CPRV_UTK_VERPROF,326,4,CH                                                       
CPRV_UTK_NJEUNUSR,331,4,CH                                                      
CPRV_UTK_LOGUSR,336,4,CH                                                        
CPRV_UTK_SPECIAL,341,4,CH                                                       
CPRV_UTK_DEFAULT,346,4,CH                                                       
CPRV_UTK_UNKNUSR,351,4,CH                                                       
CPRV_UTK_ERROR,356,4,CH                                                         
CPRV_UTK_TRUSTED,361,4,CH                                                       
CPRV_UTK_SESSTYPE,366,8,CH                                                      
CPRV_UTK_SURROGAT,375,4,CH                                                      
CPRV_UTK_REMOTE,380,4,CH                                                        
CPRV_UTK_PRIV,385,4,CH                                                          
CPRV_UTK_SECL,390,8,CH                                                          
CPRV_UTK_EXECNODE,399,8,CH                                                      
CPRV_UTK_SUSER_ID,408,8,CH                                                      
CPRV_UTK_SNODE,417,8,CH                                                         
CPRV_UTK_SGRP_ID,426,8,CH                                                       
CPRV_UTK_SPOE,435,8,CH                                                          
CPRV_UTK_SPCLASS,444,8,CH                                                       
CPRV_UTK_USER_ID,453,8,CH                                                       
CPRV_UTK_GRP_ID,462,8,CH                                                        
CPRV_UTK_DFT_GRP,471,4,CH                                                       
CPRV_UTK_DFT_SECL,476,4,CH                                                      
CPRV_APPC_LINK,481,16,CH                                                        
CPRV_AUDIT_CODE,498,11,CH                                                       
CPRV_OLD_REAL_UID,510,10,CH                                                     
CPRV_OLD_EFF_UID,521,10,CH                                                      
CPRV_OLD_SAVED_UID,532,10,CH                                                    
CPRV_OLD_REAL_GID,543,10,CH                                                     
CPRV_OLD_EFF_GID,554,10,CH                                                      
CPRV_OLD_SAVED_GID,565,10,CH                                                    
CPRV_DCE_LINK,576,16,CH                                                         
CPRV_AUTH_TYPE,593,13,CH                                                        
CPRV_DFLT_PROCESS,607,4,CH                                                      
CPRV_UTK_NETW,612,8,CH                                                          
*------------------------------------------------*                              
*                    OPENSTTY                    *                              
*------------------------------------------------*                              
OSTY_EVENT_TYPE,5,8,CH                                                          
OSTY_EVENT_QUAL,14,8,CH                                                         
OSTY_TIME_WRITTEN,23,8,CH                                                       
OSTY_DATE_WRITTEN,32,10,CH                                                      
OSTY_SYSTEM_SMFID,43,4,CH                                                       
OSTY_VIOLATION,48,1,CH                                                          
OSTY_USER_NDFND,53,1,CH                                                         
OSTY_USER_WARNING,58,1,CH                                                       
OSTY_EVT_USER_ID,63,8,CH                                                        
OSTY_EVT_GRP_ID,72,8,CH                                                         
OSTY_AUTH_NORMAL,81,1,CH                                                        
OSTY_AUTH_SPECIAL,86,1,CH                                                       
OSTY_AUTH_OPER,91,1,CH                                                          
OSTY_AUTH_AUDIT,96,1,CH                                                         
OSTY_AUTH_EXIT,101,1,CH                                                         
OSTY_AUTH_FAILSFT,106,1,CH                                                      
OSTY_AUTH_BYPASS,111,1,CH                                                       
OSTY_AUTH_TRUSTED,116,1,CH                                                      
OSTY_LOG_CLASS,121,1,CH                                                         
OSTY_LOG_USER,126,1,CH                                                          
OSTY_LOG_SPECIAL,131,1,CH                                                       
OSTY_LOG_ACCESS,136,1,CH                                                        
OSTY_LOG_RACINIT,141,1,CH                                                       
OSTY_LOG_ALWAYS,146,1,CH                                                        
OSTY_LOG_CMDVIOL,151,1,CH                                                       
OSTY_LOG_GLOBAL,156,1,CH                                                        
OSTY_TERM_LEVEL,161,3,CH                                                        
OSTY_BACKOUT_FAIL,165,1,CH                                                      
OSTY_PROF_SAME,170,1,CH                                                         
OSTY_TERM,175,8,CH                                                              
OSTY_JOB_NAME,184,8,CH                                                          
OSTY_READ_TIME,193,8,CH                                                         
OSTY_READ_DATE,202,10,CH                                                        
OSTY_SMF_USER_ID,213,8,CH                                                       
OSTY_LOG_LEVEL,222,1,CH                                                         
OSTY_LOG_VMEVENT,227,1,CH                                                       
OSTY_LOG_LOGOPT,232,1,CH                                                        
OSTY_LOG_SECL,237,1,CH                                                          
OSTY_LOG_COMPATM,242,1,CH                                                       
OSTY_LOG_APPLAUD,247,1,CH                                                       
OSTY_LOG_NONOMVS,252,1,CH                                                       
OSTY_LOG_OMVSNPRV,257,1,CH                                                      
OSTY_AUTH_OMVSSU,262,1,CH                                                       
OSTY_AUTH_OMVSSYS,267,1,CH                                                      
OSTY_USR_SECL,272,8,CH                                                          
OSTY_RACF_VERSION,281,4,CH                                                      
OSTY_CLASS,286,8,CH                                                             
OSTY_USER_NAME,295,20,CH                                                        
OSTY_UTK_ENCR,316,4,CH                                                          
OSTY_UTK_PRE19,321,4,CH                                                         
OSTY_UTK_VERPROF,326,4,CH                                                       
OSTY_UTK_NJEUNUSR,331,4,CH                                                      
OSTY_UTK_LOGUSR,336,4,CH                                                        
OSTY_UTK_SPECIAL,341,4,CH                                                       
OSTY_UTK_DEFAULT,346,4,CH                                                       
OSTY_UTK_UNKNUSR,351,4,CH                                                       
OSTY_UTK_ERROR,356,4,CH                                                         
OSTY_UTK_TRUSTED,361,4,CH                                                       
OSTY_UTK_SESSTYPE,366,8,CH                                                      
OSTY_UTK_SURROGAT,375,4,CH                                                      
OSTY_UTK_REMOTE,380,4,CH                                                        
OSTY_UTK_PRIV,385,4,CH                                                          
OSTY_UTK_SECL,390,8,CH                                                          
OSTY_UTK_EXECNODE,399,8,CH                                                      
OSTY_UTK_SUSER_ID,408,8,CH                                                      
OSTY_UTK_SNODE,417,8,CH                                                         
OSTY_UTK_SGRP_ID,426,8,CH                                                       
OSTY_UTK_SPOE,435,8,CH                                                          
OSTY_UTK_SPCLASS,444,8,CH                                                       
OSTY_UTK_USER_ID,453,8,CH                                                       
OSTY_UTK_GRP_ID,462,8,CH                                                        
OSTY_UTK_DFT_GRP,471,4,CH                                                       
OSTY_UTK_DFT_SECL,476,4,CH                                                      
OSTY_APPC_LINK,481,16,CH                                                        
OSTY_AUDIT_CODE,498,11,CH                                                       
OSTY_OLD_REAL_UID,510,10,CH                                                     
OSTY_OLD_EFF_UID,521,10,CH                                                      
OSTY_OLD_SAVED_UID,532,10,CH                                                    
OSTY_OLD_REAL_GID,543,10,CH                                                     
OSTY_OLD_EFF_GID,554,10,CH                                                      
OSTY_OLD_SAVED_GID,565,10,CH                                                    
OSTY_TGT_REAL_UID,576,10,CH                                                     
OSTY_TGT_EFF_UID,587,10,CH                                                      
OSTY_TGT_SAV_UID,598,10,CH                                                      
OSTY_TGT_PID,609,10,CH                                                          
OSTY_DFLT_PROCESS,620,4,CH                                                      
OSTY_UTK_NETW,625,8,CH                                                          
*------------------------------------------------*                              
*                    RACLINK                     *                              
*------------------------------------------------*                              
RACL_EVENT_TYPE,5,8,CH                                                          
RACL_EVENT_QUAL,14,8,CH                                                         
RACL_TIME_WRITTEN,23,8,CH                                                       
RACL_DATE_WRITTEN,32,10,CH                                                      
RACL_SYSTEM_SMFID,43,4,CH                                                       
RACL_VIOLATION,48,1,CH                                                          
RACL_USER_NDFND,53,1,CH                                                         
RACL_USER_WARNING,58,1,CH                                                       
RACL_EVT_USER_ID,63,8,CH                                                        
RACL_EVT_GRP_ID,72,8,CH                                                         
RACL_AUTH_NORMAL,81,1,CH                                                        
RACL_AUTH_SPECIAL,86,1,CH                                                       
RACL_AUTH_OPER,91,1,CH                                                          
RACL_AUTH_AUDIT,96,1,CH                                                         
RACL_AUTH_EXIT,101,1,CH                                                         
RACL_AUTH_FAILSFT,106,1,CH                                                      
RACL_AUTH_BYPASS,111,1,CH                                                       
RACL_AUTH_TRUSTED,116,1,CH                                                      
RACL_LOG_CLASS,121,1,CH                                                         
RACL_LOG_USER,126,1,CH                                                          
RACL_LOG_SPECIAL,131,1,CH                                                       
RACL_LOG_ACCESS,136,1,CH                                                        
RACL_LOG_RACINIT,141,1,CH                                                       
RACL_LOG_ALWAYS,146,1,CH                                                        
RACL_LOG_CMDVIOL,151,1,CH                                                       
RACL_LOG_GLOBAL,156,1,CH                                                        
RACL_TERM_LEVEL,161,3,CH                                                        
RACL_BACKOUT_FAIL,165,1,CH                                                      
RACL_PROF_SAME,170,1,CH                                                         
RACL_TERM,175,8,CH                                                              
RACL_JOB_NAME,184,8,CH                                                          
RACL_READ_TIME,193,8,CH                                                         
RACL_READ_DATE,202,10,CH                                                        
RACL_SMF_USER_ID,213,8,CH                                                       
RACL_LOG_LEVEL,222,1,CH                                                         
RACL_LOG_VMEVENT,227,1,CH                                                       
RACL_LOG_LOGOPT,232,1,CH                                                        
RACL_LOG_SECL,237,1,CH                                                          
RACL_LOG_COMPATM,242,1,CH                                                       
RACL_LOG_APPLAUD,247,1,CH                                                       
RACL_LOG_NONOMVS,252,1,CH                                                       
RACL_LOG_OMVSNPRV,257,1,CH                                                      
RACL_AUTH_OMVSSU,262,1,CH                                                       
RACL_AUTH_OMVSSYS,267,1,CH                                                      
RACL_USR_SECL,272,8,CH                                                          
RACL_RACF_VERSION,281,4,CH                                                      
RACL_USER_NAME,286,20,CH                                                        
RACL_UTK_ENCR,307,4,CH                                                          
RACL_UTK_PRE19,312,4,CH                                                         
RACL_UTK_VERPROF,317,4,CH                                                       
RACL_UTK_NJEUNUSR,322,4,CH                                                      
RACL_UTK_LOGUSR,327,4,CH                                                        
RACL_UTK_SPECIAL,332,4,CH                                                       
RACL_UTK_DEFAULT,337,4,CH                                                       
RACL_UTK_UNKNUSR,342,4,CH                                                       
RACL_UTK_ERROR,347,4,CH                                                         
RACL_UTK_TRUSTED,352,4,CH                                                       
RACL_UTK_SESSTYPE,357,8,CH                                                      
RACL_UTK_SURROGAT,366,4,CH                                                      
RACL_UTK_REMOTE,371,4,CH                                                        
RACL_UTK_PRIV,376,4,CH                                                          
RACL_UTK_SECL,381,8,CH                                                          
RACL_UTK_EXECNODE,390,8,CH                                                      
RACL_UTK_SUSER_ID,399,8,CH                                                      
RACL_UTK_SNODE,408,8,CH                                                         
RACL_UTK_SGRP_ID,417,8,CH                                                       
RACL_UTK_SPOE,426,8,CH                                                          
RACL_UTK_SPCLASS,435,8,CH                                                       
RACL_UTK_USER_ID,444,8,CH                                                       
RACL_UTK_GRP_ID,453,8,CH                                                        
RACL_UTK_DFT_GRP,462,4,CH                                                       
RACL_UTK_DFT_SECL,467,4,CH                                                      
RACL_PHASE,472,20,CH                                                            
RACL_ISSUE_NODE,493,8,CH                                                        
RACL_ISSUE_ID,502,8,CH                                                          
RACL_SOURCE_ID,511,8,CH                                                         
RACL_TGT_NODE,520,8,CH                                                          
RACL_TGT_ID,529,8,CH                                                            
RACL_TGT_AUTH_ID,538,8,CH                                                       
RACL_SOURCE_SMFID,547,4,CH                                                      
RACL_SOURCE_TIME,552,8,CH                                                       
RACL_SOURCE_DATE,561,10,CH                                                      
RACL_PWD_STATUS,572,8,CH                                                        
RACL_ASSOC_STATUS,581,8,CH                                                      
RACL_SPECIFIED,590,1024,CH                                                      
RACL_UTK_NETW,1615,8,CH                                                         
*------------------------------------------------*                              
*                     IPCCHK                     *                              
*------------------------------------------------*                              
ICHK_EVENT_TYPE,5,8,CH                                                          
ICHK_EVENT_QUAL,14,8,CH                                                         
ICHK_TIME_WRITTEN,23,8,CH                                                       
ICHK_DATE_WRITTEN,32,10,CH                                                      
ICHK_SYSTEM_SMFID,43,4,CH                                                       
ICHK_VIOLATION,48,1,CH                                                          
ICHK_USER_NDFND,53,1,CH                                                         
ICHK_USER_WARNING,58,1,CH                                                       
ICHK_EVT_USER_ID,63,8,CH                                                        
ICHK_EVT_GRP_ID,72,8,CH                                                         
ICHK_AUTH_NORMAL,81,1,CH                                                        
ICHK_AUTH_SPECIAL,86,1,CH                                                       
ICHK_AUTH_OPER,91,1,CH                                                          
ICHK_AUTH_AUDIT,96,1,CH                                                         
ICHK_AUTH_EXIT,101,1,CH                                                         
ICHK_AUTH_FAILSFT,106,1,CH                                                      
ICHK_AUTH_BYPASS,111,1,CH                                                       
ICHK_AUTH_TRUSTED,116,1,CH                                                      
ICHK_LOG_CLASS,121,1,CH                                                         
ICHK_LOG_USER,126,1,CH                                                          
ICHK_LOG_SPECIAL,131,1,CH                                                       
ICHK_LOG_ACCESS,136,1,CH                                                        
ICHK_LOG_RACINIT,141,1,CH                                                       
ICHK_LOG_ALWAYS,146,1,CH                                                        
ICHK_LOG_CMDVIOL,151,1,CH                                                       
ICHK_LOG_GLOBAL,156,1,CH                                                        
ICHK_TERM_LEVEL,161,3,CH                                                        
ICHK_BACKOUT_FAIL,165,1,CH                                                      
ICHK_PROF_SAME,170,1,CH                                                         
ICHK_TERM,175,8,CH                                                              
ICHK_JOB_NAME,184,8,CH                                                          
ICHK_READ_TIME,193,8,CH                                                         
ICHK_READ_DATE,202,10,CH                                                        
ICHK_SMF_USER_ID,213,8,CH                                                       
ICHK_LOG_LEVEL,222,1,CH                                                         
ICHK_LOG_VMEVENT,227,1,CH                                                       
ICHK_LOG_LOGOPT,232,1,CH                                                        
ICHK_LOG_SECL,237,1,CH                                                          
ICHK_LOG_COMPATM,242,1,CH                                                       
ICHK_LOG_APPLAUD,247,1,CH                                                       
ICHK_LOG_NONOMVS,252,1,CH                                                       
ICHK_LOG_OMVSNPRV,257,1,CH                                                      
ICHK_AUTH_OMVSSU,262,1,CH                                                       
ICHK_AUTH_OMVSSYS,267,1,CH                                                      
ICHK_USR_SECL,272,8,CH                                                          
ICHK_RACF_VERSION,281,4,CH                                                      
ICHK_CLASS,286,8,CH                                                             
ICHK_USER_NAME,295,20,CH                                                        
ICHK_UTK_ENCR,316,4,CH                                                          
ICHK_UTK_PRE19,321,4,CH                                                         
ICHK_UTK_VERPROF,326,4,CH                                                       
ICHK_UTK_NJEUNUSR,331,4,CH                                                      
ICHK_UTK_LOGUSR,336,4,CH                                                        
ICHK_UTK_SPECIAL,341,4,CH                                                       
ICHK_UTK_DEFAULT,346,4,CH                                                       
ICHK_UTK_UNKNUSR,351,4,CH                                                       
ICHK_UTK_ERROR,356,4,CH                                                         
ICHK_UTK_TRUSTED,361,4,CH                                                       
ICHK_UTK_SESSTYPE,366,8,CH                                                      
ICHK_UTK_SURROGAT,375,4,CH                                                      
ICHK_UTK_REMOTE,380,4,CH                                                        
ICHK_UTK_PRIV,385,4,CH                                                          
ICHK_UTK_SECL,390,8,CH                                                          
ICHK_UTK_EXECNODE,399,8,CH                                                      
ICHK_UTK_SUSER_ID,408,8,CH                                                      
ICHK_UTK_SNODE,417,8,CH                                                         
ICHK_UTK_SGRP_ID,426,8,CH                                                       
ICHK_UTK_SPOE,435,8,CH                                                          
ICHK_UTK_SPCLASS,444,8,CH                                                       
ICHK_UTK_USER_ID,453,8,CH                                                       
ICHK_UTK_GRP_ID,462,8,CH                                                        
ICHK_UTK_DFT_GRP,471,4,CH                                                       
ICHK_UTK_DFT_SECL,476,4,CH                                                      
ICHK_APPC_LINK,481,16,CH                                                        
ICHK_AUDIT_CODE,498,11,CH                                                       
ICHK_OLD_REAL_UID,510,10,CH                                                     
ICHK_OLD_EFF_UID,521,10,CH                                                      
ICHK_OLD_SAVED_UID,532,10,CH                                                    
ICHK_OLD_REAL_GID,543,10,CH                                                     
ICHK_OLD_EFF_GID,554,10,CH                                                      
ICHK_OLD_SAVED_GID,565,10,CH                                                    
ICHK_KEY_OWN_UID,576,10,CH                                                      
ICHK_KEY_OWN_GID,587,10,CH                                                      
ICHK_REQUEST_READ,598,4,CH                                                      
ICHK_REQUEST_WRITE,603,4,CH                                                     
ICHK_REQUEST_EXEC,608,4,CH                                                      
ICHK_RESERVED_01,613,4,CH                                                       
ICHK_ACCESS_TYPE,618,8,CH                                                       
ICHK_ALLOWED_READ,627,4,CH                                                      
ICHK_ALLOWED_WRITE,632,4,CH                                                     
ICHK_RESERVED_02,637,4,CH                                                       
ICHK_KEY,642,8,CH                                                               
ICHK_ID,651,10,CH                                                               
ICHK_CREATOR_UID,662,10,CH                                                      
ICHK_CREATOR_GID,673,10,CH                                                      
ICHK_DFLT_PROCESS,684,4,CH                                                      
ICHK_UTK_NETW,689,8,CH                                                          
*------------------------------------------------*                              
*                     IPCGET                     *                              
*------------------------------------------------*                              
IGET_EVENT_TYPE,5,8,CH                                                          
IGET_EVENT_QUAL,14,8,CH                                                         
IGET_TIME_WRITTEN,23,8,CH                                                       
IGET_DATE_WRITTEN,32,10,CH                                                      
IGET_SYSTEM_SMFID,43,4,CH                                                       
IGET_VIOLATION,48,1,CH                                                          
IGET_USER_NDFND,53,1,CH                                                         
IGET_USER_WARNING,58,1,CH                                                       
IGET_EVT_USER_ID,63,8,CH                                                        
IGET_EVT_GRP_ID,72,8,CH                                                         
IGET_AUTH_NORMAL,81,1,CH                                                        
IGET_AUTH_SPECIAL,86,1,CH                                                       
IGET_AUTH_OPER,91,1,CH                                                          
IGET_AUTH_AUDIT,96,1,CH                                                         
IGET_AUTH_EXIT,101,1,CH                                                         
IGET_AUTH_FAILSFT,106,1,CH                                                      
IGET_AUTH_BYPASS,111,1,CH                                                       
IGET_AUTH_TRUSTED,116,1,CH                                                      
IGET_LOG_CLASS,121,1,CH                                                         
IGET_LOG_USER,126,1,CH                                                          
IGET_LOG_SPECIAL,131,1,CH                                                       
IGET_LOG_ACCESS,136,1,CH                                                        
IGET_LOG_RACINIT,141,1,CH                                                       
IGET_LOG_ALWAYS,146,1,CH                                                        
IGET_LOG_CMDVIOL,151,1,CH                                                       
IGET_LOG_GLOBAL,156,1,CH                                                        
IGET_TERM_LEVEL,161,3,CH                                                        
IGET_BACKOUT_FAIL,165,1,CH                                                      
IGET_PROF_SAME,170,1,CH                                                         
IGET_TERM,175,8,CH                                                              
IGET_JOB_NAME,184,8,CH                                                          
IGET_READ_TIME,193,8,CH                                                         
IGET_READ_DATE,202,10,CH                                                        
IGET_SMF_USER_ID,213,8,CH                                                       
IGET_LOG_LEVEL,222,1,CH                                                         
IGET_LOG_VMEVENT,227,1,CH                                                       
IGET_LOG_LOGOPT,232,1,CH                                                        
IGET_LOG_SECL,237,1,CH                                                          
IGET_LOG_COMPATM,242,1,CH                                                       
IGET_LOG_APPLAUD,247,1,CH                                                       
IGET_LOG_NONOMVS,252,1,CH                                                       
IGET_LOG_OMVSNPRV,257,1,CH                                                      
IGET_AUTH_OMVSSU,262,1,CH                                                       
IGET_AUTH_OMVSSYS,267,1,CH                                                      
IGET_USR_SECL,272,8,CH                                                          
IGET_RACF_VERSION,281,4,CH                                                      
IGET_CLASS,286,8,CH                                                             
IGET_USER_NAME,295,20,CH                                                        
IGET_UTK_ENCR,316,4,CH                                                          
IGET_UTK_PRE19,321,4,CH                                                         
IGET_UTK_VERPROF,326,4,CH                                                       
IGET_UTK_NJEUNUSR,331,4,CH                                                      
IGET_UTK_LOGUSR,336,4,CH                                                        
IGET_UTK_SPECIAL,341,4,CH                                                       
IGET_UTK_DEFAULT,346,4,CH                                                       
IGET_UTK_UNKNUSR,351,4,CH                                                       
IGET_UTK_ERROR,356,4,CH                                                         
IGET_UTK_TRUSTED,361,4,CH                                                       
IGET_UTK_SESSTYPE,366,8,CH                                                      
IGET_UTK_SURROGAT,375,4,CH                                                      
IGET_UTK_REMOTE,380,4,CH                                                        
IGET_UTK_PRIV,385,4,CH                                                          
IGET_UTK_SECL,390,8,CH                                                          
IGET_UTK_EXECNODE,399,8,CH                                                      
IGET_UTK_SUSER_ID,408,8,CH                                                      
IGET_UTK_SNODE,417,8,CH                                                         
IGET_UTK_SGRP_ID,426,8,CH                                                       
IGET_UTK_SPOE,435,8,CH                                                          
IGET_UTK_SPCLASS,444,8,CH                                                       
IGET_UTK_USER_ID,453,8,CH                                                       
IGET_UTK_GRP_ID,462,8,CH                                                        
IGET_UTK_DFT_GRP,471,4,CH                                                       
IGET_UTK_DFT_SECL,476,4,CH                                                      
IGET_APPC_LINK,481,16,CH                                                        
IGET_AUDIT_CODE,498,11,CH                                                       
IGET_OLD_REAL_UID,510,10,CH                                                     
IGET_OLD_EFF_UID,521,10,CH                                                      
IGET_OLD_SAVED_UID,532,10,CH                                                    
IGET_OLD_REAL_GID,543,10,CH                                                     
IGET_OLD_EFF_GID,554,10,CH                                                      
IGET_OLD_SAVED_GID,565,10,CH                                                    
IGET_KEY_OWN_UID,576,10,CH                                                      
IGET_KEY_OWN_GID,587,10,CH                                                      
IGET_RESERVED_01,598,4,CH                                                       
IGET_RESERVED_02,603,4,CH                                                       
IGET_RESERVED_03,608,4,CH                                                       
IGET_REQ_OWN_READ,613,4,CH                                                      
IGET_REQ_OWN_WRITE,618,4,CH                                                     
IGET_REQ_OWN_EXEC,623,4,CH                                                      
IGET_REQ_GRP_READ,628,4,CH                                                      
IGET_REQ_GRP_WRITE,633,4,CH                                                     
IGET_REQ_GRP_EXEC,638,4,CH                                                      
IGET_REQ_OTH_READ,643,4,CH                                                      
IGET_REQ_OTH_WRITE,648,4,CH                                                     
IGET_REQ_OTH_EXEC,653,4,CH                                                      
IGET_KEY,658,8,CH                                                               
IGET_ID,667,10,CH                                                               
IGET_CREATOR_UID,678,10,CH                                                      
IGET_CREATOR_GID,689,10,CH                                                      
IGET_DFLT_PROCESS,700,4,CH                                                      
IGET_UTK_NETW,705,8,CH                                                          
*------------------------------------------------*                              
*                     IPCCTL                     *                              
*------------------------------------------------*                              
ICTL_EVENT_TYPE,5,8,CH                                                          
ICTL_EVENT_QUAL,14,8,CH                                                         
ICTL_TIME_WRITTEN,23,8,CH                                                       
ICTL_DATE_WRITTEN,32,10,CH                                                      
ICTL_SYSTEM_SMFID,43,4,CH                                                       
ICTL_VIOLATION,48,1,CH                                                          
ICTL_USER_NDFND,53,1,CH                                                         
ICTL_USER_WARNING,58,1,CH                                                       
ICTL_EVT_USER_ID,63,8,CH                                                        
ICTL_EVT_GRP_ID,72,8,CH                                                         
ICTL_AUTH_NORMAL,81,1,CH                                                        
ICTL_AUTH_SPECIAL,86,1,CH                                                       
ICTL_AUTH_OPER,91,1,CH                                                          
ICTL_AUTH_AUDIT,96,1,CH                                                         
ICTL_AUTH_EXIT,101,1,CH                                                         
ICTL_AUTH_FAILSFT,106,1,CH                                                      
ICTL_AUTH_BYPASS,111,1,CH                                                       
ICTL_AUTH_TRUSTED,116,1,CH                                                      
ICTL_LOG_CLASS,121,1,CH                                                         
ICTL_LOG_USER,126,1,CH                                                          
ICTL_LOG_SPECIAL,131,1,CH                                                       
ICTL_LOG_ACCESS,136,1,CH                                                        
ICTL_LOG_RACINIT,141,1,CH                                                       
ICTL_LOG_ALWAYS,146,1,CH                                                        
ICTL_LOG_CMDVIOL,151,1,CH                                                       
ICTL_LOG_GLOBAL,156,1,CH                                                        
ICTL_TERM_LEVEL,161,3,CH                                                        
ICTL_BACKOUT_FAIL,165,1,CH                                                      
ICTL_PROF_SAME,170,1,CH                                                         
ICTL_TERM,175,8,CH                                                              
ICTL_JOB_NAME,184,8,CH                                                          
ICTL_READ_TIME,193,8,CH                                                         
ICTL_READ_DATE,202,10,CH                                                        
ICTL_SMF_USER_ID,213,8,CH                                                       
ICTL_LOG_LEVEL,222,1,CH                                                         
ICTL_LOG_VMEVENT,227,1,CH                                                       
ICTL_LOG_LOGOPT,232,1,CH                                                        
ICTL_LOG_SECL,237,1,CH                                                          
ICTL_LOG_COMPATM,242,1,CH                                                       
ICTL_LOG_APPLAUD,247,1,CH                                                       
ICTL_LOG_NONOMVS,252,1,CH                                                       
ICTL_LOG_OMVSNPRV,257,1,CH                                                      
ICTL_AUTH_OMVSSU,262,1,CH                                                       
ICTL_AUTH_OMVSSYS,267,1,CH                                                      
ICTL_USR_SECL,272,8,CH                                                          
ICTL_RACF_VERSION,281,4,CH                                                      
ICTL_CLASS,286,8,CH                                                             
ICTL_USER_NAME,295,20,CH                                                        
ICTL_UTK_ENCR,316,4,CH                                                          
ICTL_UTK_PRE19,321,4,CH                                                         
ICTL_UTK_VERPROF,326,4,CH                                                       
ICTL_UTK_NJEUNUSR,331,4,CH                                                      
ICTL_UTK_LOGUSR,336,4,CH                                                        
ICTL_UTK_SPECIAL,341,4,CH                                                       
ICTL_UTK_DEFAULT,346,4,CH                                                       
ICTL_UTK_UNKNUSR,351,4,CH                                                       
ICTL_UTK_ERROR,356,4,CH                                                         
ICTL_UTK_TRUSTED,361,4,CH                                                       
ICTL_UTK_SESSTYPE,366,8,CH                                                      
ICTL_UTK_SURROGAT,375,4,CH                                                      
ICTL_UTK_REMOTE,380,4,CH                                                        
ICTL_UTK_PRIV,385,4,CH                                                          
ICTL_UTK_SECL,390,8,CH                                                          
ICTL_UTK_EXECNODE,399,8,CH                                                      
ICTL_UTK_SUSER_ID,408,8,CH                                                      
ICTL_UTK_SNODE,417,8,CH                                                         
ICTL_UTK_SGRP_ID,426,8,CH                                                       
ICTL_UTK_SPOE,435,8,CH                                                          
ICTL_UTK_SPCLASS,444,8,CH                                                       
ICTL_UTK_USER_ID,453,8,CH                                                       
ICTL_UTK_GRP_ID,462,8,CH                                                        
ICTL_UTK_DFT_GRP,471,4,CH                                                       
ICTL_UTK_DFT_SECL,476,4,CH                                                      
ICTL_APPC_LINK,481,16,CH                                                        
ICTL_AUDIT_CODE,498,11,CH                                                       
ICTL_OLD_REAL_UID,510,10,CH                                                     
ICTL_OLD_EFF_UID,521,10,CH                                                      
ICTL_OLD_SAVED_UID,532,10,CH                                                    
ICTL_OLD_REAL_GID,543,10,CH                                                     
ICTL_OLD_EFF_GID,554,10,CH                                                      
ICTL_OLD_SAVED_GID,565,10,CH                                                    
ICTL_KEY_OWN_UID,576,10,CH                                                      
ICTL_KEY_OWN_GID,587,10,CH                                                      
ICTL_UID,598,10,CH                                                              
ICTL_GID,609,10,CH                                                              
ICTL_RESERVED_01,620,4,CH                                                       
ICTL_RESERVED_02,625,4,CH                                                       
ICTL_RESERVED_03,630,4,CH                                                       
ICTL_OLD_OWN_READ,635,4,CH                                                      
ICTL_OLD_OWN_WRITE,640,4,CH                                                     
ICTL_OLD_OWN_EXEC,645,4,CH                                                      
ICTL_OLD_GRP_READ,650,4,CH                                                      
ICTL_OLD_GRP_WRITE,655,4,CH                                                     
ICTL_OLD_GRP_EXEC,660,4,CH                                                      
ICTL_OLD_OTH_READ,665,4,CH                                                      
ICTL_OLD_OTH_WRITE,670,4,CH                                                     
ICTL_OLD_OTH_EXEC,675,4,CH                                                      
ICTL_RESERVED_04,680,4,CH                                                       
ICTL_RESERVED_05,685,4,CH                                                       
ICTL_RESERVED_06,690,4,CH                                                       
ICTL_NEW_OWN_READ,695,4,CH                                                      
ICTL_NEW_OWN_WRITE,700,4,CH                                                     
ICTL_NEW_OWN_EXEC,705,4,CH                                                      
ICTL_NEW_GRP_READ,710,4,CH                                                      
ICTL_NEW_GRP_WRITE,715,4,CH                                                     
ICTL_NEW_GRP_EXEC,720,4,CH                                                      
ICTL_NEW_OTH_READ,725,4,CH                                                      
ICTL_NEW_OTH_WRITE,730,4,CH                                                     
ICTL_NEW_OTH_EXEC,735,4,CH                                                      
ICTL_SERVICE_CODE,740,11,CH                                                     
ICTL_RESERVED_07,752,4,CH                                                       
ICTL_RESERVED_08,757,4,CH                                                       
ICTL_RESERVED_09,762,4,CH                                                       
ICTL_REQ_OWN_READ,767,4,CH                                                      
ICTL_REQ_OWN_WRITE,772,4,CH                                                     
ICTL_REQ_OWN_EXEC,777,4,CH                                                      
ICTL_REQ_GRP_READ,782,4,CH                                                      
ICTL_REQ_GRP_WRITE,787,4,CH                                                     
ICTL_REQ_GRP_EXEC,792,4,CH                                                      
ICTL_REQ_OTH_READ,797,4,CH                                                      
ICTL_REQ_OTH_WRITE,802,4,CH                                                     
ICTL_REQ_OTH_EXEC,807,4,CH                                                      
ICTL_KEY,812,8,CH                                                               
ICTL_ID,821,10,CH                                                               
ICTL_CREATOR_UID,832,10,CH                                                      
ICTL_CREATOR_GID,843,10,CH                                                      
ICTL_DFLT_PROCESS,854,4,CH                                                      
ICTL_UTK_NETW,859,8,CH                                                          
*------------------------------------------------*                              
*                    SETGROUP                    *                              
*------------------------------------------------*                              
SETG_EVENT_TYPE,5,8,CH                                                          
SETG_EVENT_QUAL,14,8,CH                                                         
SETG_TIME_WRITTEN,23,8,CH                                                       
SETG_DATE_WRITTEN,32,10,CH                                                      
SETG_SYSTEM_SMFID,43,4,CH                                                       
SETG_VIOLATION,48,1,CH                                                          
SETG_USER_NDFND,53,1,CH                                                         
SETG_USER_WARNING,58,1,CH                                                       
SETG_EVT_USER_ID,63,8,CH                                                        
SETG_EVT_GRP_ID,72,8,CH                                                         
SETG_AUTH_NORMAL,81,1,CH                                                        
SETG_AUTH_SPECIAL,86,1,CH                                                       
SETG_AUTH_OPER,91,1,CH                                                          
SETG_AUTH_AUDIT,96,1,CH                                                         
SETG_AUTH_EXIT,101,1,CH                                                         
SETG_AUTH_FAILSFT,106,1,CH                                                      
SETG_AUTH_BYPASS,111,1,CH                                                       
SETG_AUTH_TRUSTED,116,1,CH                                                      
SETG_LOG_CLASS,121,1,CH                                                         
SETG_LOG_USER,126,1,CH                                                          
SETG_LOG_SPECIAL,131,1,CH                                                       
SETG_LOG_ACCESS,136,1,CH                                                        
SETG_LOG_RACINIT,141,1,CH                                                       
SETG_LOG_ALWAYS,146,1,CH                                                        
SETG_LOG_CMDVIOL,151,1,CH                                                       
SETG_LOG_GLOBAL,156,1,CH                                                        
SETG_TERM_LEVEL,161,3,CH                                                        
SETG_BACKOUT_FAIL,165,1,CH                                                      
SETG_PROF_SAME,170,1,CH                                                         
SETG_TERM,175,8,CH                                                              
SETG_JOB_NAME,184,8,CH                                                          
SETG_READ_TIME,193,8,CH                                                         
SETG_READ_DATE,202,10,CH                                                        
SETG_SMF_USER_ID,213,8,CH                                                       
SETG_LOG_LEVEL,222,1,CH                                                         
SETG_LOG_VMEVENT,227,1,CH                                                       
SETG_LOG_LOGOPT,232,1,CH                                                        
SETG_LOG_SECL,237,1,CH                                                          
SETG_LOG_COMPATM,242,1,CH                                                       
SETG_LOG_APPLAUD,247,1,CH                                                       
SETG_LOG_NONOMVS,252,1,CH                                                       
SETG_LOG_OMVSNPRV,257,1,CH                                                      
SETG_AUTH_OMVSSU,262,1,CH                                                       
SETG_AUTH_OMVSSYS,267,1,CH                                                      
SETG_USR_SECL,272,8,CH                                                          
SETG_RACF_VERSION,281,4,CH                                                      
SETG_CLASS,286,8,CH                                                             
SETG_USER_NAME,295,20,CH                                                        
SETG_UTK_ENCR,316,4,CH                                                          
SETG_UTK_PRE19,321,4,CH                                                         
SETG_UTK_VERPROF,326,4,CH                                                       
SETG_UTK_NJEUNUSR,331,4,CH                                                      
SETG_UTK_LOGUSR,336,4,CH                                                        
SETG_UTK_SPECIAL,341,4,CH                                                       
SETG_UTK_DEFAULT,346,4,CH                                                       
SETG_UTK_UNKNUSR,351,4,CH                                                       
SETG_UTK_ERROR,356,4,CH                                                         
SETG_UTK_TRUSTED,361,4,CH                                                       
SETG_UTK_SESSTYPE,366,8,CH                                                      
SETG_UTK_SURROGAT,375,4,CH                                                      
SETG_UTK_REMOTE,380,4,CH                                                        
SETG_UTK_PRIV,385,4,CH                                                          
SETG_UTK_SECL,390,8,CH                                                          
SETG_UTK_EXECNODE,399,8,CH                                                      
SETG_UTK_SUSER_ID,408,8,CH                                                      
SETG_UTK_SNODE,417,8,CH                                                         
SETG_UTK_SGRP_ID,426,8,CH                                                       
SETG_UTK_SPOE,435,8,CH                                                          
SETG_UTK_SPCLASS,444,8,CH                                                       
SETG_UTK_USER_ID,453,8,CH                                                       
SETG_UTK_GRP_ID,462,8,CH                                                        
SETG_UTK_DFT_GRP,471,4,CH                                                       
SETG_UTK_DFT_SECL,476,4,CH                                                      
SETG_APPC_LINK,481,16,CH                                                        
SETG_AUDIT_CODE,498,11,CH                                                       
SETG_OLD_REAL_UID,510,10,CH                                                     
SETG_OLD_EFF_UID,521,10,CH                                                      
SETG_OLD_SAVED_UID,532,10,CH                                                    
SETG_OLD_REAL_GID,543,10,CH                                                     
SETG_OLD_EFF_GID,554,10,CH                                                      
SETG_OLD_SAVED_GID,565,10,CH                                                    
SETG_DCE_LINK,576,16,CH                                                         
SETG_AUTH_TYPE,593,13,CH                                                        
SETG_DFLT_PROCESS,607,4,CH                                                      
SETG_UTK_NETW,612,8,CH                                                          
*------------------------------------------------*                              
*                     CKOWN2                     *                              
*------------------------------------------------*                              
CKO2_EVENT_TYPE,5,8,CH                                                          
CKO2_EVENT_QUAL,14,8,CH                                                         
CKO2_TIME_WRITTEN,23,8,CH                                                       
CKO2_DATE_WRITTEN,32,10,CH                                                      
CKO2_SYSTEM_SMFID,43,4,CH                                                       
CKO2_VIOLATION,48,1,CH                                                          
CKO2_USER_NDFND,53,1,CH                                                         
CKO2_USER_WARNING,58,1,CH                                                       
CKO2_EVT_USER_ID,63,8,CH                                                        
CKO2_EVT_GRP_ID,72,8,CH                                                         
CKO2_AUTH_NORMAL,81,1,CH                                                        
CKO2_AUTH_SPECIAL,86,1,CH                                                       
CKO2_AUTH_OPER,91,1,CH                                                          
CKO2_AUTH_AUDIT,96,1,CH                                                         
CKO2_AUTH_EXIT,101,1,CH                                                         
CKO2_AUTH_FAILSFT,106,1,CH                                                      
CKO2_AUTH_BYPASS,111,1,CH                                                       
CKO2_AUTH_TRUSTED,116,1,CH                                                      
CKO2_LOG_CLASS,121,1,CH                                                         
CKO2_LOG_USER,126,1,CH                                                          
CKO2_LOG_SPECIAL,131,1,CH                                                       
CKO2_LOG_ACCESS,136,1,CH                                                        
CKO2_LOG_RACINIT,141,1,CH                                                       
CKO2_LOG_ALWAYS,146,1,CH                                                        
CKO2_LOG_CMDVIOL,151,1,CH                                                       
CKO2_LOG_GLOBAL,156,1,CH                                                        
CKO2_TERM_LEVEL,161,3,CH                                                        
CKO2_BACKOUT_FAIL,165,1,CH                                                      
CKO2_PROF_SAME,170,1,CH                                                         
CKO2_TERM,175,8,CH                                                              
CKO2_JOB_NAME,184,8,CH                                                          
CKO2_READ_TIME,193,8,CH                                                         
CKO2_READ_DATE,202,10,CH                                                        
CKO2_SMF_USER_ID,213,8,CH                                                       
CKO2_LOG_LEVEL,222,1,CH                                                         
CKO2_LOG_VMEVENT,227,1,CH                                                       
CKO2_LOG_LOGOPT,232,1,CH                                                        
CKO2_LOG_SECL,237,1,CH                                                          
CKO2_LOG_COMPATM,242,1,CH                                                       
CKO2_LOG_APPLAUD,247,1,CH                                                       
CKO2_LOG_NONOMVS,252,1,CH                                                       
CKO2_LOG_OMVSNPRV,257,1,CH                                                      
CKO2_AUTH_OMVSSU,262,1,CH                                                       
CKO2_AUTH_OMVSSYS,267,1,CH                                                      
CKO2_USR_SECL,272,8,CH                                                          
CKO2_RACF_VERSION,281,4,CH                                                      
CKO2_CLASS,286,8,CH                                                             
CKO2_USER_NAME,295,20,CH                                                        
CKO2_UTK_ENCR,316,4,CH                                                          
CKO2_UTK_PRE19,321,4,CH                                                         
CKO2_UTK_VERPROF,326,4,CH                                                       
CKO2_UTK_NJEUNUSR,331,4,CH                                                      
CKO2_UTK_LOGUSR,336,4,CH                                                        
CKO2_UTK_SPECIAL,341,4,CH                                                       
CKO2_UTK_DEFAULT,346,4,CH                                                       
CKO2_UTK_UNKNUSR,351,4,CH                                                       
CKO2_UTK_ERROR,356,4,CH                                                         
CKO2_UTK_TRUSTED,361,4,CH                                                       
CKO2_UTK_SESSTYPE,366,8,CH                                                      
CKO2_UTK_SURROGAT,375,4,CH                                                      
CKO2_UTK_REMOTE,380,4,CH                                                        
CKO2_UTK_PRIV,385,4,CH                                                          
CKO2_UTK_SECL,390,8,CH                                                          
CKO2_UTK_EXECNODE,399,8,CH                                                      
CKO2_UTK_SUSER_ID,408,8,CH                                                      
CKO2_UTK_SNODE,417,8,CH                                                         
CKO2_UTK_SGRP_ID,426,8,CH                                                       
CKO2_UTK_SPOE,435,8,CH                                                          
CKO2_UTK_SPCLASS,444,8,CH                                                       
CKO2_UTK_USER_ID,453,8,CH                                                       
CKO2_UTK_GRP_ID,462,8,CH                                                        
CKO2_UTK_DFT_GRP,471,4,CH                                                       
CKO2_UTK_DFT_SECL,476,4,CH                                                      
CKO2_APPC_LINK,481,16,CH                                                        
CKO2_AUDIT_CODE,498,11,CH                                                       
CKO2_OLD_REAL_UID,510,10,CH                                                     
CKO2_OLD_EFF_UID,521,10,CH                                                      
CKO2_OLD_SAVED_UID,532,10,CH                                                    
CKO2_OLD_REAL_GID,543,10,CH                                                     
CKO2_OLD_EFF_GID,554,10,CH                                                      
CKO2_OLD_SAVED_GID,565,10,CH                                                    
CKO2_PATH_NAME,576,1023,CH                                                      
CKO2_FILE1_ID,1600,32,CH                                                        
CKO2_FILE1_OWN_UID,1633,10,CH                                                   
CKO2_FILE1_OWN_GID,1644,10,CH                                                   
CKO2_FILE2_ID,1655,32,CH                                                        
CKO2_FILE2_OWN_UID,1688,10,CH                                                   
CKO2_FILE2_OWN_GID,1699,10,CH                                                   
CKO2_DCE_LINK,1710,16,CH                                                        
CKO2_AUTH_TYPE,1727,13,CH                                                       
CKO2_DFLT_PROCESS,1741,4,CH                                                     
CKO2_UTK_NETW,1746,8,CH                                                         
*------------------------------------------------*                              
*                      ACCR                      *                              
*------------------------------------------------*                              
ACCR_EVENT_TYPE,5,8,CH                                                          
ACCR_EVENT_QUAL,14,8,CH                                                         
ACCR_TIME_WRITTEN,23,8,CH                                                       
ACCR_DATE_WRITTEN,32,10,CH                                                      
ACCR_SYSTEM_SMFID,43,4,CH                                                       
ACCR_VIOLATION,48,1,CH                                                          
ACCR_USER_NDFND,53,1,CH                                                         
ACCR_USER_WARNING,58,1,CH                                                       
ACCR_EVT_USER_ID,63,8,CH                                                        
ACCR_EVT_GRP_ID,72,8,CH                                                         
ACCR_AUTH_NORMAL,81,1,CH                                                        
ACCR_AUTH_SPECIAL,86,1,CH                                                       
ACCR_AUTH_OPER,91,1,CH                                                          
ACCR_AUTH_AUDIT,96,1,CH                                                         
ACCR_AUTH_EXIT,101,1,CH                                                         
ACCR_AUTH_FAILSFT,106,1,CH                                                      
ACCR_AUTH_BYPASS,111,1,CH                                                       
ACCR_AUTH_TRUSTED,116,1,CH                                                      
ACCR_LOG_CLASS,121,1,CH                                                         
ACCR_LOG_USER,126,1,CH                                                          
ACCR_LOG_SPECIAL,131,1,CH                                                       
ACCR_LOG_ACCESS,136,1,CH                                                        
ACCR_LOG_RACINIT,141,1,CH                                                       
ACCR_LOG_ALWAYS,146,1,CH                                                        
ACCR_LOG_CMDVIOL,151,1,CH                                                       
ACCR_LOG_GLOBAL,156,1,CH                                                        
ACCR_TERM_LEVEL,161,3,CH                                                        
ACCR_BACKOUT_FAIL,165,1,CH                                                      
ACCR_PROF_SAME,170,1,CH                                                         
ACCR_TERM,175,8,CH                                                              
ACCR_JOB_NAME,184,8,CH                                                          
ACCR_READ_TIME,193,8,CH                                                         
ACCR_READ_DATE,202,10,CH                                                        
ACCR_SMF_USER_ID,213,8,CH                                                       
ACCR_LOG_LEVEL,222,1,CH                                                         
ACCR_LOG_VMEVENT,227,1,CH                                                       
ACCR_LOG_LOGOPT,232,1,CH                                                        
ACCR_LOG_SECL,237,1,CH                                                          
ACCR_LOG_COMPATM,242,1,CH                                                       
ACCR_LOG_APPLAUD,247,1,CH                                                       
ACCR_LOG_NONOMVS,252,1,CH                                                       
ACCR_LOG_OMVSNPRV,257,1,CH                                                      
ACCR_AUTH_OMVSSU,262,1,CH                                                       
ACCR_AUTH_OMVSSYS,267,1,CH                                                      
ACCR_USR_SECL,272,8,CH                                                          
ACCR_RACF_VERSION,281,4,CH                                                      
ACCR_CLASS,286,8,CH                                                             
ACCR_USER_NAME,295,20,CH                                                        
ACCR_UTK_ENCR,316,4,CH                                                          
ACCR_UTK_PRE19,321,4,CH                                                         
ACCR_UTK_VERPROF,326,4,CH                                                       
ACCR_UTK_NJEUNUSR,331,4,CH                                                      
ACCR_UTK_LOGUSR,336,4,CH                                                        
ACCR_UTK_SPECIAL,341,4,CH                                                       
ACCR_UTK_DEFAULT,346,4,CH                                                       
ACCR_UTK_UNKNUSR,351,4,CH                                                       
ACCR_UTK_ERROR,356,4,CH                                                         
ACCR_UTK_TRUSTED,361,4,CH                                                       
ACCR_UTK_SESSTYPE,366,8,CH                                                      
ACCR_UTK_SURROGAT,375,4,CH                                                      
ACCR_UTK_REMOTE,380,4,CH                                                        
ACCR_UTK_PRIV,385,4,CH                                                          
ACCR_UTK_SECL,390,8,CH                                                          
ACCR_UTK_EXECNODE,399,8,CH                                                      
ACCR_UTK_SUSER_ID,408,8,CH                                                      
ACCR_UTK_SNODE,417,8,CH                                                         
ACCR_UTK_SGRP_ID,426,8,CH                                                       
ACCR_UTK_SPOE,435,8,CH                                                          
ACCR_UTK_SPCLASS,444,8,CH                                                       
ACCR_UTK_USER_ID,453,8,CH                                                       
ACCR_UTK_GRP_ID,462,8,CH                                                        
ACCR_UTK_DFT_GRP,471,4,CH                                                       
ACCR_UTK_DFT_SECL,476,4,CH                                                      
ACCR_APPC_LINK,481,16,CH                                                        
ACCR_AUDIT_CODE,498,11,CH                                                       
ACCR_OLD_REAL_UID,510,10,CH                                                     
ACCR_OLD_EFF_UID,521,10,CH                                                      
ACCR_OLD_SAVED_UID,532,10,CH                                                    
ACCR_OLD_REAL_GID,543,10,CH                                                     
ACCR_OLD_EFF_GID,554,10,CH                                                      
ACCR_OLD_SAVED_GID,565,10,CH                                                    
ACCR_PATH_NAME,576,1023,CH                                                      
ACCR_FILE1_ID,1600,32,CH                                                        
ACCR_DFLT_PROCESS,1633,4,CH                                                     
ACCR_UTK_NETW,1638,8,CH                                                         
*------------------------------------------------*                              
*                    RACDCERT                    *                              
*------------------------------------------------*                              
RACD_EVENT_TYPE,5,8,CH                                                          
RACD_EVENT_QUAL,14,8,CH                                                         
RACD_TIME_WRITTEN,23,8,CH                                                       
RACD_DATE_WRITTEN,32,10,CH                                                      
RACD_SYSTEM_SMFID,43,4,CH                                                       
RACD_VIOLATION,48,1,CH                                                          
RACD_USER_NDFND,53,1,CH                                                         
RACD_USER_WARNING,58,1,CH                                                       
RACD_EVT_USER_ID,63,8,CH                                                        
RACD_EVT_GRP_ID,72,8,CH                                                         
RACD_AUTH_NORMAL,81,1,CH                                                        
RACD_AUTH_SPECIAL,86,1,CH                                                       
RACD_AUTH_OPER,91,1,CH                                                          
RACD_AUTH_AUDIT,96,1,CH                                                         
RACD_AUTH_EXIT,101,1,CH                                                         
RACD_AUTH_FAILSFT,106,1,CH                                                      
RACD_AUTH_BYPASS,111,1,CH                                                       
RACD_AUTH_TRUSTED,116,1,CH                                                      
RACD_LOG_CLASS,121,1,CH                                                         
RACD_LOG_USER,126,1,CH                                                          
RACD_LOG_SPECIAL,131,1,CH                                                       
RACD_LOG_ACCESS,136,1,CH                                                        
RACD_LOG_RACINIT,141,1,CH                                                       
RACD_LOG_ALWAYS,146,1,CH                                                        
RACD_LOG_CMDVIOL,151,1,CH                                                       
RACD_LOG_GLOBAL,156,1,CH                                                        
RACD_TERM_LEVEL,161,3,CH                                                        
RACD_BACKOUT_FAIL,165,1,CH                                                      
RACD_PROF_SAME,170,1,CH                                                         
RACD_TERM,175,8,CH                                                              
RACD_JOB_NAME,184,8,CH                                                          
RACD_READ_TIME,193,8,CH                                                         
RACD_READ_DATE,202,10,CH                                                        
RACD_SMF_USER_ID,213,8,CH                                                       
RACD_LOG_LEVEL,222,1,CH                                                         
RACD_LOG_VMEVENT,227,1,CH                                                       
RACD_LOG_LOGOPT,232,1,CH                                                        
RACD_LOG_SECL,237,1,CH                                                          
RACD_LOG_COMPATM,242,1,CH                                                       
RACD_LOG_APPLAUD,247,1,CH                                                       
RACD_LOG_NONOMVS,252,1,CH                                                       
RACD_LOG_OMVSNPRV,257,1,CH                                                      
RACD_AUTH_OMVSSU,262,1,CH                                                       
RACD_AUTH_OMVSSYS,267,1,CH                                                      
RACD_USR_SECL,272,8,CH                                                          
RACD_RACF_VERSION,281,4,CH                                                      
RACD_USER_NAME,286,20,CH                                                        
RACD_UTK_ENCR,307,4,CH                                                          
RACD_UTK_PRE19,312,4,CH                                                         
RACD_UTK_VERPROF,317,4,CH                                                       
RACD_UTK_NJEUNUSR,322,4,CH                                                      
RACD_UTK_LOGUSR,327,4,CH                                                        
RACD_UTK_SPECIAL,332,4,CH                                                       
RACD_UTK_DEFAULT,337,4,CH                                                       
RACD_UTK_UNKNUSR,342,4,CH                                                       
RACD_UTK_ERROR,347,4,CH                                                         
RACD_UTK_TRUSTED,352,4,CH                                                       
RACD_UTK_SESSTYPE,357,8,CH                                                      
RACD_UTK_SURROGAT,366,4,CH                                                      
RACD_UTK_REMOTE,371,4,CH                                                        
RACD_UTK_PRIV,376,4,CH                                                          
RACD_UTK_SECL,381,8,CH                                                          
RACD_UTK_EXECNODE,390,8,CH                                                      
RACD_UTK_SUSER_ID,399,8,CH                                                      
RACD_UTK_SNODE,408,8,CH                                                         
RACD_UTK_SGRP_ID,417,8,CH                                                       
RACD_UTK_SPOE,426,8,CH                                                          
RACD_UTK_SPCLASS,435,8,CH                                                       
RACD_UTK_USER_ID,444,8,CH                                                       
RACD_UTK_GRP_ID,453,8,CH                                                        
RACD_UTK_DFT_GRP,462,4,CH                                                       
RACD_UTK_DFT_SECL,467,4,CH                                                      
RACD_SERIAL_NUMBER,472,255,CH                                                   
RACD_ISSUERS_DN,728,255,CH                                                      
RACD_CERT_DS,984,44,CH                                                          
RACD_SPECIFIED,1029,1024,CH                                                     
RACD_UTK_NETW,2054,8,CH                                                         
*------------------------------------------------*                              
*                    INITACEE                    *                              
*------------------------------------------------*                              
INTA_EVENT_TYPE,5,8,CH                                                          
INTA_EVENT_QUAL,14,8,CH                                                         
INTA_TIME_WRITTEN,23,8,CH                                                       
INTA_DATE_WRITTEN,32,10,CH                                                      
INTA_SYSTEM_SMFID,43,4,CH                                                       
INTA_VIOLATION,48,1,CH                                                          
INTA_USER_NDFND,53,1,CH                                                         
INTA_USER_WARNING,58,1,CH                                                       
INTA_EVT_USER_ID,63,8,CH                                                        
INTA_EVT_GRP_ID,72,8,CH                                                         
INTA_AUTH_NORMAL,81,1,CH                                                        
INTA_AUTH_SPECIAL,86,1,CH                                                       
INTA_AUTH_OPER,91,1,CH                                                          
INTA_AUTH_AUDIT,96,1,CH                                                         
INTA_AUTH_EXIT,101,1,CH                                                         
INTA_AUTH_FAILSFT,106,1,CH                                                      
INTA_AUTH_BYPASS,111,1,CH                                                       
INTA_AUTH_TRUSTED,116,1,CH                                                      
INTA_LOG_CLASS,121,1,CH                                                         
INTA_LOG_USER,126,1,CH                                                          
INTA_LOG_SPECIAL,131,1,CH                                                       
INTA_LOG_ACCESS,136,1,CH                                                        
INTA_LOG_RACINIT,141,1,CH                                                       
INTA_LOG_ALWAYS,146,1,CH                                                        
INTA_LOG_CMDVIOL,151,1,CH                                                       
INTA_LOG_GLOBAL,156,1,CH                                                        
INTA_TERM_LEVEL,161,3,CH                                                        
INTA_BACKOUT_FAIL,165,1,CH                                                      
INTA_PROF_SAME,170,1,CH                                                         
INTA_TERM,175,8,CH                                                              
INTA_JOB_NAME,184,8,CH                                                          
INTA_READ_TIME,193,8,CH                                                         
INTA_READ_DATE,202,10,CH                                                        
INTA_SMF_USER_ID,213,8,CH                                                       
INTA_LOG_LEVEL,222,1,CH                                                         
INTA_LOG_VMEVENT,227,1,CH                                                       
INTA_LOG_LOGOPT,232,1,CH                                                        
INTA_LOG_SECL,237,1,CH                                                          
INTA_LOG_COMPATM,242,1,CH                                                       
INTA_LOG_APPLAUD,247,1,CH                                                       
INTA_LOG_NONOMVS,252,1,CH                                                       
INTA_LOG_OMVSNPRV,257,1,CH                                                      
INTA_AUTH_OMVSSU,262,1,CH                                                       
INTA_AUTH_OMVSSYS,267,1,CH                                                      
INTA_USR_SECL,272,8,CH                                                          
INTA_RACF_VERSION,281,4,CH                                                      
INTA_USER_NAME,286,20,CH                                                        
INTA_UTK_ENCR,307,4,CH                                                          
INTA_UTK_PRE19,312,4,CH                                                         
INTA_UTK_VERPROF,317,4,CH                                                       
INTA_UTK_NJEUNUSR,322,4,CH                                                      
INTA_UTK_LOGUSR,327,4,CH                                                        
INTA_UTK_SPECIAL,332,4,CH                                                       
INTA_UTK_DEFAULT,337,4,CH                                                       
INTA_UTK_UNKNUSR,342,4,CH                                                       
INTA_UTK_ERROR,347,4,CH                                                         
INTA_UTK_TRUSTED,352,4,CH                                                       
INTA_UTK_SESSTYPE,357,8,CH                                                      
INTA_UTK_SURROGAT,366,4,CH                                                      
INTA_UTK_REMOTE,371,4,CH                                                        
INTA_UTK_PRIV,376,4,CH                                                          
INTA_UTK_SECL,381,8,CH                                                          
INTA_UTK_EXECNODE,390,8,CH                                                      
INTA_UTK_SUSER_ID,399,8,CH                                                      
INTA_UTK_SNODE,408,8,CH                                                         
INTA_UTK_SGRP_ID,417,8,CH                                                       
INTA_UTK_SPOE,426,8,CH                                                          
INTA_UTK_SPCLASS,435,8,CH                                                       
INTA_UTK_USER_ID,444,8,CH                                                       
INTA_UTK_GRP_ID,453,8,CH                                                        
INTA_UTK_DFT_GRP,462,4,CH                                                       
INTA_UTK_DFT_SECL,467,4,CH                                                      
INTA_SERIAL_NUMBER,472,255,CH                                                   
INTA_ISSUERS_DN,728,255,CH                                                      
INTA_UTK_NETW,984,8,CH                                                          
*------------------------------------------------*                              
*                    RACFINIT                    *                              
*------------------------------------------------*                              
RINI_EVENT_TYPE,5,8,CH                                                          
RINI_RESERVED_01,14,8,CH                                                        
RINI_TIME_WRITTEN,23,8,CH                                                       
RINI_DATE_WRITTEN,32,10,CH                                                      
RINI_SYSTEM_SMFID,43,4,CH                                                       
RINI_DATASET_NAME,48,44,CH                                                      
RINI_DATASET_VOL,93,6,CH                                                        
RINI_DATASET_UNIT,100,3,CH                                                      
RINI_UADS_NAME,104,44,CH                                                        
RINI_UADS_VOL,149,6,CH                                                          
RINI_RACINIT_STATS,156,4,CH                                                     
RINI_DATASET_STATS,161,4,CH                                                     
RINI_RACINIT_PRE,166,4,CH                                                       
RINI_RACHECK_PRE,171,4,CH                                                       
RINI_RACDEF_PRE,176,4,CH                                                        
RINI_RACINIT_POST,181,4,CH                                                      
RINI_RACHECK_POST,186,4,CH                                                      
RINI_NEW_PWD_EXIT,191,4,CH                                                      
RINI_TAPEVOL_STATS,196,4,CH                                                     
RINI_DASD_STATS,201,4,CH                                                        
RINI_TERM_STATS,206,4,CH                                                        
RINI_CMD_EXIT,211,4,CH                                                          
RINI_DEL_CMD_EXIT,216,4,CH                                                      
RINI_ADSP,221,4,CH                                                              
RINI_ENCRYPT_EXIT,226,4,CH                                                      
RINI_NAMING_CONV,231,4,CH                                                       
RINI_TAPEVOL,236,4,CH                                                           
RINI_DUP_DSNS,241,4,CH                                                          
RINI_DASD,246,4,CH                                                              
RINI_FRACHECK_PRE,251,4,CH                                                      
RINI_RACLIST_PRE,256,4,CH                                                       
RINI_RACLIST_SEL,261,4,CH                                                       
RINI_RACDEF_POST,266,4,CH                                                       
RINI_AUDIT_USER,271,4,CH                                                        
RINI_AUDIT_GROUP,276,4,CH                                                       
RINI_AUDIT_DATASET,281,4,CH                                                     
RINI_AUDIT_TAPEVOL,286,4,CH                                                     
RINI_AUDIT_DASDVOL,291,4,CH                                                     
RINI_AUDIT_TERM,296,4,CH                                                        
RINI_AUDIT_CMDVIOL,301,4,CH                                                     
RINI_AUDIT_SPECIAL,306,4,CH                                                     
RINI_AUDIT_OPER,311,4,CH                                                        
RINI_AUDIT_LEVEL,316,4,CH                                                       
RINI_ACEE_COMPRESS,321,4,CH                                                     
RINI_FASTAUTH_PRE,326,4,CH                                                      
RINI_FASTAUTH_POST,331,4,CH                                                     
RINI_TERM,336,4,CH                                                              
RINI_TERM_NONE,341,4,CH                                                         
RINI_REALDSN,346,4,CH                                                           
RINI_XBMALLRACF,351,4,CH                                                        
RINI_EARLYVERIFY,356,4,CH                                                       
RINI_BATCHALLRACF,361,4,CH                                                      
RINI_FRACHECK_POST,366,4,CH                                                     
RINI_PWD_INT,371,3,CH                                                           
RINI_SINGLE_DSN,375,8,CH                                                        
RINI_TAPEDSN,384,4,CH                                                           
RINI_PROTECTALL,389,4,CH                                                        
RINI_PROTECTALL_W,394,4,CH                                                      
RINI_ERASE,399,4,CH                                                             
RINI_ERASE_LEVEL,404,4,CH                                                       
RINI_ERASE_ALL,409,4,CH                                                         
RINI_EGN,414,4,CH                                                               
RINI_WHEN_PROGRAM,419,4,CH                                                      
RINI_RETENTION,424,5,CH                                                         
RINI_LEVEL_ERASE,430,5,CH                                                       
RINI_LEVEL_AUDIT,436,5,CH                                                       
RINI_SECL_CTRL,442,4,CH                                                         
RINI_CATDSNS,447,4,CH                                                           
RINI_MLQUIET,452,4,CH                                                           
RINI_MLSTABLE,457,4,CH                                                          
RINI_MLS,462,4,CH                                                               
RINI_MLACTIVE,467,4,CH                                                          
RINI_GENERIC_OWNER,472,4,CH                                                     
RINI_SECL_AUDIT,477,4,CH                                                        
RINI_SESSION_INT,482,5,CH                                                       
RINI_NJE_NAME_ID,488,8,CH                                                       
RINI_NJE_UDFND_ID,497,8,CH                                                      
RINI_COMPATMODE,506,4,CH                                                        
RINI_CATDSNS_FAIL,511,4,CH                                                      
RINI_MLS_FAIL,516,4,CH                                                          
RINI_MLACTIVE_FAIL,521,4,CH                                                     
RINI_APPLAUD,526,4,CH                                                           
RINI_DFT_PRI,531,3,CH                                                           
RINI_DFT_SEC,535,3,CH                                                           
RINI_RESERVED_02,539,4,CH                                                       
RINI_ALL_CMD_EXIT,544,4,CH                                                      
RINI_ADDCREATOR,549,4,CH                                                        
RINI_ACEE_COMP_XM,554,4,CH                                                      
RINI_ENCRYPT_EXIT2,559,4,CH                                                     
*------------------------------------------------*                              
*                    CLASNAME                    *                              
*------------------------------------------------*                              
RINC_EVENT_TYPE,5,8,CH                                                          
RINC_RESERVED_01,14,8,CH                                                        
RINC_TIME_WRITTEN,23,8,CH                                                       
RINC_DATE_WRITTEN,32,10,CH                                                      
RINC_SYSTEM_SMFID,43,4,CH                                                       
RINC_CLASS_NAME,48,8,CH                                                         
RINC_STATS,57,4,CH                                                              
RINC_AUDIT,62,4,CH                                                              
RINC_ACTIVE,67,4,CH                                                             
RINC_GENERIC,72,4,CH                                                            
RINC_GENCMD,77,4,CH                                                             
RINC_GLOBAL,82,4,CH                                                             
RINC_RACLIST,87,4,CH                                                            
RINC_GENLIST,92,4,CH                                                            
RINC_LOG_OPTIONS,97,8,CH                                                        
*------------------------------------------------*                              
*                      DSAF                      *                              
*------------------------------------------------*                              
DSAF_EVENT_TYPE,5,8,CH                                                          
DSAF_RESERVED_01,14,8,CH                                                        
DSAF_TIME_WRITTEN,23,8,CH                                                       
DSAF_DATE_WRITTEN,32,10,CH                                                      
DSAF_SYSTEM_SMFID,43,4,CH                                                       
DSAF_SECL_LINK,48,16,CH                                                         
DSAF_VIOLATION,65,4,CH                                                          
DSAF_USER_NDFND,70,4,CH                                                         
DSAF_USER_WARNING,75,4,CH                                                       
DSAF_EVT_USER_ID,80,8,CH                                                        
DSAF_EVT_GRP_ID,89,8,CH                                                         
DSAF_AUTH_NORMAL,98,4,CH                                                        
DSAF_AUTH_SPECIAL,103,4,CH                                                      
DSAF_AUTH_OPER,108,4,CH                                                         
DSAF_AUTH_AUDIT,113,4,CH                                                        
DSAF_AUTH_EXIT,118,4,CH                                                         
DSAF_AUTH_FAILSFT,123,4,CH                                                      
DSAF_AUTH_BYPASS,128,4,CH                                                       
DSAF_AUTH_TRUSTED,133,4,CH                                                      
DSAF_LOG_CLASS,138,4,CH                                                         
DSAF_LOG_USER,143,4,CH                                                          
DSAF_LOG_SPECIAL,148,4,CH                                                       
DSAF_LOG_ACCESS,153,4,CH                                                        
DSAF_LOG_RACINIT,158,4,CH                                                       
DSAF_LOG_ALWAYS,163,4,CH                                                        
DSAF_LOG_CMDVIOL,168,4,CH                                                       
DSAF_LOG_GLOBAL,173,4,CH                                                        
DSAF_TERM_LEVEL,178,3,CH                                                        
DSAF_BACKOUT_FAIL,182,4,CH                                                      
DSAF_PROF_SAME,187,4,CH                                                         
DSAF_TERM,192,8,CH                                                              
DSAF_JOB_NAME,201,8,CH                                                          
DSAF_READ_TIME,210,8,CH                                                         
DSAF_READ_DATE,219,10,CH                                                        
DSAF_SMF_USER_ID,230,8,CH                                                       
DSAF_LOG_LEVEL,239,4,CH                                                         
DSAF_LOG_LOGOPT,244,4,CH                                                        
DSAF_LOG_SECL,249,4,CH                                                          
DSAF_LOG_COMPATM,254,4,CH                                                       
DSAF_LOG_APPLAUD,259,4,CH                                                       
DSAF_USR_SECL,264,8,CH                                                          
DSAF_DATA_SET,273,44,CH                                                         
./   ADD  NAME=DBUSYMBL                                                         
GPBD_RECORD_TYPE,5,4,CH                                                 00010006
GPBD_NAME,10,8,CH                                                       00011006
GPBD_SUPGRP_ID,19,8,CH                                                  00020004
GPBD_CREATE_DATE,28,10,CH                                               00030004
GPBD_OWNER_ID,39,8,CH                                                   00040004
GPBD_UACC,48,8,CH                                                       00050004
GPBD_NOTERMUACC,57,1,CH                                                 00060004
GPBD_INSTALL_DATA,62,254,CH                                             00070004
GPBD_MODEL,318,44,CH                                                    00080004
GPSGRP_RECORD_TYPE,5,4,CH                                               00081006
GPSGRP_NAME,10,8,CH                                                     00090004
GPSGRP_SUBGRP_ID,19,8,CH                                                00100004
GPMEM_RECORD_TYPE,5,4,CH                                                00101006
GPMEM_NAME,10,8,CH                                                      00110004
GPMEM_MEMBER_ID,19,8,CH                                                 00120004
GPMEM_AUTH,28,8,CH                                                      00130004
GPINSTD_RECORD_TYPE,5,4,CH                                              00131006
GPINSTD_NAME,10,8,CH                                                    00140004
GPINSTD_USR_NAME,19,8,CH                                                00150004
GPINSTD_USR_DATA,28,254,CH                                              00160004
GPINSTD_USR_FLAG,284,8,CH                                               00170004
GPDFP_NAME,10,8,CH                                                      00180004
GPDFP_RECORD_TYPE,5,4,CH                                                00181006
GPDFP_DATAAPPL,19,8,CH                                                  00190004
GPDFP_DATACLAS,28,8,CH                                                  00200004
GPDFP_MGMTCLAS,37,8,CH                                                  00210004
GPDFP_STORCLAS,46,8,CH                                                  00220004
GPOMVS_RECORD_TYPE,5,4,CH                                               00221006
GPOMVS_NAME,10,8,CH                                                     00230004
GPOMVS_GID,19,10,CH                                                     00240004
GPOVM_RECORD_TYPE,5,4,CH                                                00241006
GPOVM_NAME,10,8,CH                                                      00250004
GPOVM_GID,19,10,CH                                                      00260004
GPTME_RECORD_TYPE,5,4,CH                                                00261006
GPTME_NAME,10,8,CH                                                      00270004
GPTME_ROLE,19,246,CH                                                    00280004
USBD_RECORD_TYPE,5,4,CH                                                 00281006
USBD_NAME,10,8,CH                                                       00290004
USBD_CREATE_DATE,19,10,CH                                               00300004
USBD_OWNER_ID,30,8,CH                                                   00310004
USBD_ADSP,39,1,CH                                                       00320004
USBD_SPECIAL,44,1,CH                                                    00330004
USBD_OPER,49,1,CH                                                       00340004
USBD_REVOKE,54,1,CH                                                     00350004
USBD_GRPACC,59,1,CH                                                     00360004
USBD_PWD_INTERVAL,64,3,CH                                               00370004
USBD_PWD_DATE,68,10,CH                                                  00380004
USBD_PROGRAMMER,79,20,CH                                                00390004
USBD_DEFGRP_ID,100,8,CH                                                 00400004
USBD_LASTJOB_TIME,109,8,CH                                              00410004
USBD_LASTJOB_DATE,118,10,CH                                             00420004
USBD_INSTALL_DATA,129,254,CH                                            00430004
USBD_UAUDIT,385,1,CH                                                    00440004
USBD_AUDITOR,390,1,CH                                                   00450004
USBD_NOPWD,395,1,CH                                                     00460004
USBD_OIDCARD,400,1,CH                                                   00470004
USBD_PWD_GEN,405,3,CH                                                   00480004
USBD_REVOKE_CNT,409,3,CH                                                00490004
USBD_MODEL,413,44,CH                                                    00500004
USBD_SECLEVEL,458,3,CH                                                  00510004
USBD_REVOKE_DATE,462,10,CH                                              00520004
USBD_RESUME_DATE,473,10,CH                                              00530004
USBD_ACCESS_SUN,484,1,CH                                                00540004
USBD_ACCESS_MON,489,1,CH                                                00550004
USBD_ACCESS_TUE,494,1,CH                                                00560004
USBD_ACCESS_WED,499,1,CH                                                00570004
USBD_ACCESS_THU,504,1,CH                                                00580004
USBD_ACCESS_FRI,509,1,CH                                                00590004
USBD_ACCESS_SAT,514,1,CH                                                00600004
USBD_START_TIME,519,8,CH                                                00610004
USBD_END_TIME,528,8,CH                                                  00620004
USBD_SECLABEL,537,8,CH                                                  00630004
USCAT_RECORD_TYPE,5,4,CH                                                00631006
USCAT_NAME,10,8,CH                                                      00640004
USCAT_CATEGORY,19,5,CH                                                  00650004
USCLA_RECORD_TYPE,5,4,CH                                                00651006
USCLA_NAME,10,8,CH                                                      00660004
USCLA_CLASS,19,8,CH                                                     00670004
USGCON_RECORD_TYPE,5,4,CH                                               00671006
USGCON_NAME,10,8,CH                                                     00680004
USGCON_GRP_ID,19,8,CH                                                   00690004
USINSTD_RECORD_TYPE,5,4,CH                                              00691006
USINSTD_NAME,10,8,CH                                                    00700004
USINSTD_USR_NAME,19,8,CH                                                00710004
USINSTD_USR_DATA,28,254,CH                                              00720004
USINSTD_USR_FLAG,284,8,CH                                               00730004
USCON_RECORD_TYPE,5,4,CH                                                00731006
USCON_NAME,10,8,CH                                                      00740004
USCON_GRP_ID,19,8,CH                                                    00750004
USCON_CONNECT_DATE,28,10,CH                                             00760004
USCON_OWNER_ID,39,8,CH                                                  00770004
USCON_LASTCON_TIME,48,8,CH                                              00780004
USCON_LASTCON_DATE,57,10,CH                                             00790004
USCON_UACC,68,8,CH                                                      00800004
USCON_INIT_CNT,77,5,CH                                                  00810004
USCON_GRP_ADSP,83,1,CH                                                  00820004
USCON_GRP_SPECIAL,88,1,CH                                               00830004
USCON_GRP_OPER,93,1,CH                                                  00840004
USCON_REVOKE,98,1,CH                                                    00850004
USCON_GRP_ACC,103,1,CH                                                  00860004
USCON_NOTERMUACC,108,1,CH                                               00870004
USCON_GRP_AUDIT,113,1,CH                                                00880004
USCON_REVOKE_DATE,118,10,CH                                             00890004
USCON_RESUME_DATE,129,10,CH                                             00900004
USRSF_RECORD_TYPE,5,4,CH                                                00901006
USRSF_NAME,10,8,CH                                                      00910004
USRSF_TARG_NODE,19,8,CH                                                 00920004
USRSF_TARG_USER_ID,28,8,CH                                              00930004
USRSF_VERSION,37,3,CH                                                   00940004
USRSF_PEER,41,1,CH                                                      00950004
USRSF_MANAGING,46,1,CH                                                  00960004
USRSF_MANAGED,51,1,CH                                                   00970004
USRSF_REMOTE_PEND,56,1,CH                                               00980004
USRSF_LOCAL_PEND,61,1,CH                                                00990004
USRSF_PWD_SYNC,66,1,CH                                                  01000004
USRSF_REM_REFUSAL,71,1,CH                                               01010004
USRSF_DEFINE_DATE,76,10,CH                                              01020004
USRSF_DEFINE_TIME,87,8,CH                                               01030004
USRSF_ACCEPT_DATE,103,10,CH                                             01040004
USRSF_ACCEPT_TIME,114,8,CH                                              01050004
USRSF_CREATOR_ID,130,8,CH                                               01060004
USCERT_RECORD_TYPE,5,4,CH                                               01061006
USCERT_NAME,10,8,CH                                                     01070004
USCERT_CERT_NAME,19,246,CH                                              01080004
USCERT_CERTLABL,266,32,CH                                               01090004
USDFP_RECORD_TYPE,5,4,CH                                                01091006
USDFP_NAME,10,8,CH                                                      01100004
USDFP_DATAAPPL,19,8,CH                                                  01110004
USDFP_DATACLAS,28,8,CH                                                  01120004
USDFP_MGMTCLAS,37,8,CH                                                  01130004
USDFP_STORCLAS,46,8,CH                                                  01140004
USTSO_RECORD_TYPE,5,4,CH                                                01141006
USTSO_NAME,10,8,CH                                                      01150004
USTSO_ACCOUNT,19,40,CH                                                  01160004
USTSO_COMMAND,60,80,CH                                                  01170004
USTSO_DEST,141,8,CH                                                     01180004
USTSO_HOLD_CLASS,150,1,CH                                               01190004
USTSO_JOB_CLASS,152,1,CH                                                01200004
USTSO_LOGON_PROC,154,8,CH                                               01210004
USTSO_LOGON_SIZE,163,10,CH                                              01220004
USTSO_MSG_CLASS,174,1,CH                                                01230004
USTSO_LOGON_MAX,176,10,CH                                               01240004
USTSO_PERF_GROUP,187,10,CH                                              01250004
USTSO_SYSOUT_CLASS,198,1,CH                                             01260004
USTSO_USER_DATA,200,8,CH                                                01270004
USTSO_UNIT_NAME,209,8,CH                                                01280004
USTSO_SECLABEL,218,8,CH                                                 01290004
USCICS_RECORD_TYPE,5,4,CH                                               01291006
USCICS_NAME,10,8,CH                                                     01300004
USCICS_OPIDENT,19,3,CH                                                  01310004
USCICS_OPPRTY,23,5,CH                                                   01320004
USCICS_NOFORCE,29,1,CH                                                  01330004
USCICS_TIMEOUT,34,5,CH                                                  01340004
USCOPC_RECORD_TYPE,5,4,CH                                               01341006
USCOPC_NAME,10,8,CH                                                     01350004
USCOPC_OPCLASS,19,3,CH                                                  01360004
USLAN_RECORD_TYPE,5,4,CH                                                01361006
USLAN_NAME,10,8,CH                                                      01370004
USLAN_PRIMARY,19,3,CH                                                   01380004
USLAN_SECONDARY,23,3,CH                                                 01390004
USOPR_RECORD_TYPE,5,4,CH                                                01391006
USOPR_NAME,10,8,CH                                                      01400004
USOPR_STORAGE,19,5,CH                                                   01410004
USOPR_MASTERAUTH,25,1,CH                                                01420004
USOPR_ALLAUTH,30,1,CH                                                   01430004
USOPR_SYSAUTH,35,1,CH                                                   01440004
USOPR_IOAUTH,40,1,CH                                                    01450004
USOPR_CONSAUTH,45,1,CH                                                  01460004
USOPR_INFOAUTH,50,1,CH                                                  01470004
USOPR_TIMESTAMP,55,1,CH                                                 01480004
USOPR_SYSTEMID,60,1,CH                                                  01490004
USOPR_JOBID,65,1,CH                                                     01500004
USOPR_MSGID,70,1,CH                                                     01510004
USOPR_X,75,1,CH                                                         01520004
USOPR_WTOR,80,1,CH                                                      01530004
USOPR_IMMEDIATE,85,1,CH                                                 01540004
USOPR_CRITICAL,90,1,CH                                                  01550004
USOPR_EVENTUAL,95,1,CH                                                  01560004
USOPR_INFO,100,1,CH                                                     01570004
USOPR_NOBRODCAST,105,1,CH                                               01580004
USOPR_ALL,110,1,CH                                                      01590004
USOPR_JOBNAMES,115,1,CH                                                 01600004
USOPR_JOBNAMEST,120,1,CH                                                01610004
USOPR_SESS,125,1,CH                                                     01620004
USOPR_SESST,130,1,CH                                                    01630004
USOPR_STATUS,135,1,CH                                                   01640004
USOPR_ROUTECODE001,140,1,CH                                             01650004
USOPR_ROUTECODE002,145,1,CH                                             01660004
USOPR_ROUTECODE003,150,1,CH                                             01670004
USOPR_ROUTECODE004,155,1,CH                                             01680004
USOPR_ROUTECODE005,160,1,CH                                             01690004
USOPR_ROUTECODE006,165,1,CH                                             01700004
USOPR_ROUTECODE007,170,1,CH                                             01710004
USOPR_ROUTECODE008,175,1,CH                                             01720004
USOPR_ROUTECODE009,180,1,CH                                             01730004
USOPR_ROUTECODE010,185,1,CH                                             01740004
USOPR_ROUTECODE011,190,1,CH                                             01750004
USOPR_ROUTECODE012,195,1,CH                                             01760004
USOPR_ROUTECODE013,200,1,CH                                             01770004
USOPR_ROUTECODE014,205,1,CH                                             01780004
USOPR_ROUTECODE015,210,1,CH                                             01790004
USOPR_ROUTECODE016,215,1,CH                                             01800004
USOPR_ROUTECODE017,220,1,CH                                             01810004
USOPR_ROUTECODE018,225,1,CH                                             01820004
USOPR_ROUTECODE019,230,1,CH                                             01830004
USOPR_ROUTECODE020,235,1,CH                                             01840004
USOPR_ROUTECODE021,240,1,CH                                             01850004
USOPR_ROUTECODE022,245,1,CH                                             01860004
USOPR_ROUTECODE023,250,1,CH                                             01870004
USOPR_ROUTECODE024,255,1,CH                                             01880004
USOPR_ROUTECODE025,260,1,CH                                             01890004
USOPR_ROUTECODE026,265,1,CH                                             01900004
USOPR_ROUTECODE027,270,1,CH                                             01910004
USOPR_ROUTECODE028,275,1,CH                                             01920004
USOPR_ROUTECODE029,280,1,CH                                             01930004
USOPR_ROUTECODE030,285,1,CH                                             01940004
USOPR_ROUTECODE031,290,1,CH                                             01950004
USOPR_ROUTECODE032,295,1,CH                                             01960004
USOPR_ROUTECODE033,300,1,CH                                             01970004
USOPR_ROUTECODE034,305,1,CH                                             01980004
USOPR_ROUTECODE035,310,1,CH                                             01990004
USOPR_ROUTECODE036,315,1,CH                                             02000004
USOPR_ROUTECODE037,320,1,CH                                             02010004
USOPR_ROUTECODE038,325,1,CH                                             02020004
USOPR_ROUTECODE039,330,1,CH                                             02030004
USOPR_ROUTECODE040,335,1,CH                                             02040004
USOPR_ROUTECODE041,340,1,CH                                             02050004
USOPR_ROUTECODE042,345,1,CH                                             02060004
USOPR_ROUTECODE043,350,1,CH                                             02070004
USOPR_ROUTECODE044,355,1,CH                                             02080004
USOPR_ROUTECODE045,360,1,CH                                             02090004
USOPR_ROUTECODE046,365,1,CH                                             02100004
USOPR_ROUTECODE047,370,1,CH                                             02110004
USOPR_ROUTECODE048,375,1,CH                                             02120004
USOPR_ROUTECODE049,380,1,CH                                             02130004
USOPR_ROUTECODE050,385,1,CH                                             02140004
USOPR_ROUTECODE051,390,1,CH                                             02150004
USOPR_ROUTECODE052,395,1,CH                                             02160004
USOPR_ROUTECODE053,400,1,CH                                             02170004
USOPR_ROUTECODE054,405,1,CH                                             02180004
USOPR_ROUTECODE055,410,1,CH                                             02190004
USOPR_ROUTECODE056,415,1,CH                                             02200004
USOPR_ROUTECODE057,420,1,CH                                             02210004
USOPR_ROUTECODE058,425,1,CH                                             02220004
USOPR_ROUTECODE059,430,1,CH                                             02230004
USOPR_ROUTECODE060,435,1,CH                                             02240004
USOPR_ROUTECODE061,440,1,CH                                             02250004
USOPR_ROUTECODE062,445,1,CH                                             02260004
USOPR_ROUTECODE063,450,1,CH                                             02270004
USOPR_ROUTECODE064,455,1,CH                                             02280004
USOPR_ROUTECODE065,460,1,CH                                             02290004
USOPR_ROUTECODE066,465,1,CH                                             02300004
USOPR_ROUTECODE067,470,1,CH                                             02310004
USOPR_ROUTECODE068,475,1,CH                                             02320004
USOPR_ROUTECODE069,480,1,CH                                             02330004
USOPR_ROUTECODE070,485,1,CH                                             02340004
USOPR_ROUTECODE071,490,1,CH                                             02350004
USOPR_ROUTECODE072,495,1,CH                                             02360004
USOPR_ROUTECODE073,500,1,CH                                             02370004
USOPR_ROUTECODE074,505,1,CH                                             02380004
USOPR_ROUTECODE075,510,1,CH                                             02390004
USOPR_ROUTECODE076,515,1,CH                                             02400004
USOPR_ROUTECODE077,520,1,CH                                             02410004
USOPR_ROUTECODE078,525,1,CH                                             02420004
USOPR_ROUTECODE079,530,1,CH                                             02430004
USOPR_ROUTECODE080,535,1,CH                                             02440004
USOPR_ROUTECODE081,540,1,CH                                             02450004
USOPR_ROUTECODE082,545,1,CH                                             02460004
USOPR_ROUTECODE083,550,1,CH                                             02470004
USOPR_ROUTECODE084,555,1,CH                                             02480004
USOPR_ROUTECODE085,560,1,CH                                             02490004
USOPR_ROUTECODE086,565,1,CH                                             02500004
USOPR_ROUTECODE087,570,1,CH                                             02510004
USOPR_ROUTECODE088,575,1,CH                                             02520004
USOPR_ROUTECODE089,580,1,CH                                             02530004
USOPR_ROUTECODE090,585,1,CH                                             02540004
USOPR_ROUTECODE091,590,1,CH                                             02550004
USOPR_ROUTECODE092,595,1,CH                                             02560004
USOPR_ROUTECODE093,600,1,CH                                             02570004
USOPR_ROUTECODE094,605,1,CH                                             02580004
USOPR_ROUTECODE095,610,1,CH                                             02590004
USOPR_ROUTECODE096,615,1,CH                                             02600004
USOPR_ROUTECODE097,620,1,CH                                             02610004
USOPR_ROUTECODE098,625,1,CH                                             02620004
USOPR_ROUTECODE099,630,1,CH                                             02630004
USOPR_ROUTECODE100,635,1,CH                                             02640004
USOPR_ROUTECODE101,640,1,CH                                             02650004
USOPR_ROUTECODE102,645,1,CH                                             02660004
USOPR_ROUTECODE103,650,1,CH                                             02670004
USOPR_ROUTECODE104,655,1,CH                                             02680004
USOPR_ROUTECODE105,660,1,CH                                             02690004
USOPR_ROUTECODE106,665,1,CH                                             02700004
USOPR_ROUTECODE107,670,1,CH                                             02710004
USOPR_ROUTECODE108,675,1,CH                                             02720004
USOPR_ROUTECODE109,680,1,CH                                             02730004
USOPR_ROUTECODE110,685,1,CH                                             02740004
USOPR_ROUTECODE111,690,1,CH                                             02750004
USOPR_ROUTECODE112,695,1,CH                                             02760004
USOPR_ROUTECODE113,700,1,CH                                             02770004
USOPR_ROUTECODE114,705,1,CH                                             02780004
USOPR_ROUTECODE115,710,1,CH                                             02790004
USOPR_ROUTECODE116,715,1,CH                                             02800004
USOPR_ROUTECODE117,720,1,CH                                             02810004
USOPR_ROUTECODE118,725,1,CH                                             02820004
USOPR_ROUTECODE119,730,1,CH                                             02830004
USOPR_ROUTECODE120,735,1,CH                                             02840004
USOPR_ROUTECODE121,740,1,CH                                             02850004
USOPR_ROUTECODE122,745,1,CH                                             02860004
USOPR_ROUTECODE123,750,1,CH                                             02870004
USOPR_ROUTECODE124,755,1,CH                                             02880004
USOPR_ROUTECODE125,760,1,CH                                             02890004
USOPR_ROUTECODE126,765,1,CH                                             02900004
USOPR_ROUTECODE127,770,1,CH                                             02910004
USOPR_ROUTECODE128,775,1,CH                                             02920004
USOPR_LOGCMDRESP,780,8,CH                                               02930004
USOPR_MIGRATIONID,789,1,CH                                              02940004
USOPR_DELOPERMSG,794,8,CH                                               02950004
USOPR_RETRIEVE_KEY,803,8,CH                                             02960004
USOPR_CMDSYS,812,8,CH                                                   02970004
USOPR_UD,821,1,CH                                                       02980004
USOPR_ALTGRP_ID,826,8,CH                                                02990004
USOPR_AUTO,835,1,CH                                                     03000004
USOPRP_RECORD_TYPE,5,4,CH                                               03001006
USOPRP_NAME,10,8,CH                                                     03010004
USOPRP_SYSTEM,19,8,CH                                                   03020004
USWRK_RECORD_TYPE,5,4,CH                                                03021006
USWRK_NAME,10,8,CH                                                      03030004
USWRK_AREA_NAME,19,60,CH                                                03040004
USWRK_BUILDING,80,60,CH                                                 03050004
USWRK_DEPARTMENT,141,60,CH                                              03060004
USWRK_ROOM,202,60,CH                                                    03070004
USWRK_ADDR_LINE1,263,60,CH                                              03080004
USWRK_ADDR_LINE2,324,60,CH                                              03090004
USWRK_ADDR_LINE3,385,60,CH                                              03100004
USWRK_ADDR_LINE4,446,60,CH                                              03110004
USWRK_ACCOUNT,507,254,CH                                                03120004
USOMVS_RECORD_TYPE,5,4,CH                                               03121006
USOMVS_NAME,10,8,CH                                                     03130004
USOMVS_UID,19,10,CH                                                     03140004
USOMVS_HOME_PATH,30,1023,CH                                             03150004
USOMVS_PROG_NAME,1054,1023,CH                                           03160004
USNETV_RECORD_TYPE,5,4,CH                                               03161006
USNETV_NAME,10,8,CH                                                     03170004
USNETV_IC,19,254,CH                                                     03180004
USNETV_CONSNAME,275,8,CH                                                03190004
USNETV_CTL,284,8,CH                                                     03200004
USNETV_MSGRECVR,293,1,CH                                                03210004
USNETV_NGMFADMN,298,1,CH                                                03220004
USNETV_NGMFVSPN,303,8,CH                                                03230004
USNOPC_RECORD_TYPE,5,4,CH                                               03231006
USNOPC_NAME,10,8,CH                                                     03240004
USNOPC_OPCLASS,19,5,CH                                                  03250004
USNDOM_RECORD_TYPE,5,4,CH                                               03251006
USNDOM_NAME,10,8,CH                                                     03260004
USNDOM_DOMAINS,19,5,CH                                                  03270004
USDCE_RECORD_TYPE,5,4,CH                                                03271006
USDCE_NAME,10,8,CH                                                      03280004
USDCE_UUID,19,36,CH                                                     03290004
USDCE_DCE_NAME,56,1023,CH                                               03300004
USDCE_HOMECELL,1080,1023,CH                                             03310004
USDCE_HOMEUUID,2104,36,CH                                               03320004
USDCE_AUTOLOGIN,2141,1,CH                                               03330004
USOVM_RECORD_TYPE,5,4,CH                                                03331006
USOVM_NAME,10,8,CH                                                      03340004
USOVM_UID,19,10,CH                                                      03350004
USOVM_HOME_PATH,30,1023,CH                                              03360004
USOVM_PROGRAM,1054,1023,CH                                              03370004
USOVM_FSROOT,2078,1023,CH                                               03380004
DSBD_RECORD_TYPE,5,4,CH                                                 03381006
DSBD_NAME,10,44,CH                                                      03390004
DSBD_VOL,55,6,CH                                                        03400004
DSBD_GENERIC,62,1,CH                                                    03410004
DSBD_CREATE_DATE,67,10,CH                                               03420004
DSBD_OWNER_ID,78,8,CH                                                   03430004
DSBD_LASTREF_DATE,87,10,CH                                              03440004
DSBD_LASTCHG_DATE,98,10,CH                                              03450004
DSBD_ALTER_CNT,109,5,CH                                                 03460004
DSBD_CONTROL_CNT,115,5,CH                                               03470004
DSBD_UPDATE_CNT,121,5,CH                                                03480004
DSBD_READ_CNT,127,5,CH                                                  03490004
DSBD_UACC,133,8,CH                                                      03500004
DSBD_GRPDS,142,1,CH                                                     03510004
DSBD_AUDIT_LEVEL,147,8,CH                                               03520004
DSBD_GRP_ID,156,8,CH                                                    03530004
DSBD_DS_TYPE,165,8,CH                                                   03540004
DSBD_LEVEL,174,3,CH                                                     03550004
DSBD_DEVICE_NAME,178,8,CH                                               03560004
DSBD_GAUDIT_LEVEL,187,8,CH                                              03570004
DSBD_INSTALL_DATA,196,254,CH                                            03580004
DSBD_AUDIT_OKQUAL,452,8,CH                                              03590004
DSBD_AUDIT_FAQUAL,461,8,CH                                              03600004
DSBD_GAUDIT_OKQUAL,470,8,CH                                             03610004
DSBD_GAUDIT_FAQUAL,479,8,CH                                             03620004
DSBD_WARNING,488,1,CH                                                   03630004
DSBD_SECLEVEL,493,3,CH                                                  03640004
DSBD_NOTIFY_ID,497,8,CH                                                 03650004
DSBD_RETENTION,506,5,CH                                                 03660004
DSBD_ERASE,512,1,CH                                                     03670004
DSBD_SECLABEL,517,8,CH                                                  03680004
DSCAT_RECORD_TYPE,5,4,CH                                                03681006
DSCAT_NAME,10,44,CH                                                     03690004
DSCAT_VOL,55,6,CH                                                       03700004
DSCAT_CATEGORY,62,5,CH                                                  03710004
DSCACC_RECORD_TYPE,5,4,CH                                               03711006
DSCACC_NAME,10,44,CH                                                    03720004
DSCACC_VOL,55,6,CH                                                      03730004
DSCACC_CATYPE,62,8,CH                                                   03740004
DSCACC_CANAME,71,8,CH                                                   03750004
DSCACC_AUTH_ID,80,8,CH                                                  03760004
DSCACC_ACCESS,89,8,CH                                                   03770004
DSCACC_ACCESS_CNT,98,5,CH                                               03780004
DSVOL_RECORD_TYPE,5,4,CH                                                03781006
DSVOL_NAME,10,44,CH                                                     03790004
DSVOL_VOL,55,6,CH                                                       03800004
DSVOL_VOL_NAME,62,6,CH                                                  03810004
DSACC_RECORD_TYPE,5,4,CH                                                03811006
DSACC_NAME,10,44,CH                                                     03820004
DSACC_VOL,55,6,CH                                                       03830004
DSACC_AUTH_ID,62,8,CH                                                   03840004
DSACC_ACCESS,71,8,CH                                                    03850004
DSACC_ACCESS_CNT,80,5,CH                                                03860004
DSINSTD_RECORD_TYPE,5,4,CH                                              03861006
DSINSTD_NAME,10,44,CH                                                   03870004
DSINSTD_VOL,55,6,CH                                                     03880004
DSINSTD_USR_NAME,62,8,CH                                                03890004
DSINSTD_USR_DATA,71,254,CH                                              03900004
DSINSTD_USR_FLAG,327,8,CH                                               03910004
DSDFP_RECORD_TYPE,5,4,CH                                                03911006
DSDFP_NAME,10,44,CH                                                     03920004
DSDFP_VOL,55,6,CH                                                       03930004
DSDFP_RESOWNER_ID,62,8,CH                                               03940004
DSTME_RECORD_TYPE,5,4,CH                                                03941006
DSTME_NAME,10,44,CH                                                     03950004
DSTME_VOL,55,6,CH                                                       03960004
DSTME_ROLE_NAME,62,246,CH                                               03970004
DSTME_ACCESS_AUTH,309,8,CH                                              03980004
DSTME_COND_CLASS,318,8,CH                                               03990004
DSTME_COND_PROF,327,246,CH                                              04000004
GRBD_RECORD_TYPE,5,4,CH                                                 04001006
GRBD_NAME,10,246,CH                                                     04010004
GRBD_CLASS_NAME,257,8,CH                                                04020004
GRBD_GENERIC,266,1,CH                                                   04030004
GRBD_CLASS,271,3,CH                                                     04040004
GRBD_CREATE_DATE,275,10,CH                                              04050004
GRBD_OWNER_ID,286,8,CH                                                  04060004
GRBD_LASTREF_DATE,295,10,CH                                             04070004
GRBD_LASTCHG_DATE,306,10,CH                                             04080004
GRBD_ALTER_CNT,317,5,CH                                                 04090004
GRBD_CONTROL_CNT,323,5,CH                                               04100004
GRBD_UPDATE_CNT,329,5,CH                                                04110004
GRBD_READ_CNT,335,5,CH                                                  04120004
GRBD_UACC,341,8,CH                                                      04130004
GRBD_AUDIT_LEVEL,350,8,CH                                               04140004
GRBD_LEVEL,359,3,CH                                                     04150004
GRBD_GAUDIT_LEVEL,363,8,CH                                              04160004
GRBD_INSTALL_DATA,372,254,CH                                            04170004
GRBD_AUDIT_OKQUAL,628,8,CH                                              04180004
GRBD_AUDIT_FAQUAL,637,8,CH                                              04190004
GRBD_GAUDIT_OKQUAL,646,8,CH                                             04200004
GRBD_GAUDIT_FAQUAL,655,8,CH                                             04210004
GRBD_WARNING,664,1,CH                                                   04220004
GRBD_SINGLEDS,669,1,CH                                                  04230004
GRBD_AUTO,674,1,CH                                                      04240004
GRBD_TVTOC,679,1,CH                                                     04250004
GRBD_NOTIFY_ID,684,8,CH                                                 04260004
GRBD_ACCESS_SUN,693,1,CH                                                04270004
GRBD_ACCESS_MON,698,1,CH                                                04280004
GRBD_ACCESS_TUE,703,1,CH                                                04290004
GRBD_ACCESS_WED,708,1,CH                                                04300004
GRBD_ACCESS_THU,713,1,CH                                                04310004
GRBD_ACCESS_FRI,718,1,CH                                                04320004
GRBD_ACCESS_SAT,723,1,CH                                                04330004
GRBD_START_TIME,728,8,CH                                                04340004
GRBD_END_TIME,737,8,CH                                                  04350004
GRBD_ZONE_OFFSET,746,5,CH                                               04360004
GRBD_ZONE_DIRECT,752,1,CH                                               04370004
GRBD_SECLEVEL,754,3,CH                                                  04380004
GRBD_APPL_DATA,758,254,CH                                               04390004
GRBD_SECLABEL,1014,8,CH                                                 04400004
GRTVOL_RECORD_TYPE,5,4,CH                                               04401006
GRTVOL_NAME,10,246,CH                                                   04410004
GRTVOL_CLASS_NAME,257,8,CH                                              04420004
GRTVOL_SEQUENCE,266,5,CH                                                04430004
GRTVOL_CREATE_DATE,272,10,CH                                            04440004
GRTVOL_DISCRETE,283,1,CH                                                04450004
GRTVOL_INTERN_NAME,288,44,CH                                            04460004
GRTVOL_INTERN_VOLS,333,254,CH                                           04470004
GRTVOL_CREATE_NAME,589,44,CH                                            04480004
GRCAT_RECORD_TYPE,5,4,CH                                                04481006
GRCAT_NAME,10,246,CH                                                    04490004
GRCAT_CLASS_NAME,257,8,CH                                               04500004
GRCAT_CATEGORY,266,5,CH                                                 04510004
GRMEM_RECORD_TYPE,5,4,CH                                                04511006
GRMEM_NAME,10,246,CH                                                    04520004
GRMEM_CLASS_NAME,257,8,CH                                               04530004
GRMEM_MEMBER,266,254,CH                                                 04540004
GRMEM_GLOBAL_ACC,522,8,CH                                               04550004
GRMEM_PADS_DATA,531,8,CH                                                04560004
GRMEM_VOL_NAME,540,6,CH                                                 04570004
GRMEM_VMEVENT_DATA,547,5,CH                                             04580004
GRMEM_SECLEVEL,553,5,CH                                                 04590004
GRMEM_CATEGORY,559,5,CH                                                 04600004
GRVOL_RECORD_TYPE,5,4,CH                                                04601006
GRVOL_NAME,10,246,CH                                                    04610004
GRVOL_CLASS_NAME,257,8,CH                                               04620004
GRVOL_VOL_NAME,266,6,CH                                                 04630004
GRACC_NAME,10,246,CH                                                    04640004
GRACC_CLASS_NAME,257,8,CH                                               04650004
GRACC_AUTH_ID,266,8,CH                                                  04660004
GRACC_ACCESS,275,8,CH                                                   04670004
GRACC_ACCESS_CNT,284,5,CH                                               04680004
GRINSTD_RECORD_TYPE,5,4,CH                                              04681006
GRINSTD_NAME,10,246,CH                                                  04690004
GRINSTD_CLASS_NAME,257,8,CH                                             04700004
GRINSTD_USR_NAME,266,8,CH                                               04710004
GRINSTD_USR_DATA,275,254,CH                                             04720004
GRINSTD_USR_FLAG,531,8,CH                                               04730004
GRCACC_RECORD_TYPE,5,4,CH                                               04731006
GRCACC_NAME,10,246,CH                                                   04740004
GRCACC_CLASS_NAME,257,8,CH                                              04750004
GRCACC_CATYPE,266,8,CH                                                  04760004
GRCACC_CANAME,275,8,CH                                                  04770004
GRCACC_AUTH_ID,284,8,CH                                                 04780004
GRCACC_ACCESS,293,8,CH                                                  04790004
GRCACC_ACCESS_CNT,302,5,CH                                              04800004
GRSES_RECORD_TYPE,5,4,CH                                                04801006
GRSES_NAME,10,246,CH                                                    04810004
GRSES_CLASS_NAME,257,8,CH                                               04820004
GRSES_SESSION_KEY,266,8,CH                                              04830004
GRSES_LOCKED,275,1,CH                                                   04840004
GRSES_KEY_DATE,280,10,CH                                                04850004
GRSES_KEY_INTERVAL,291,5,CH                                             04860004
GRSES_SLS_FAIL,297,5,CH                                                 04870004
GRSES_MAX_FAIL,303,5,CH                                                 04880004
GRSES_CONVSEC,309,8,CH                                                  04890004
GRSESE_RECORD_TYPE,5,4,CH                                               04891006
GRSESE_NAME,10,246,CH                                                   04900004
GRSESE_CLASS_NAME,257,8,CH                                              04910004
GRSESE_ENTITY_NAME,266,35,CH                                            04920004
GRSESE_FAIL_CNT,302,5,CH                                                04930004
GRDLF_RECORD_TYPE,5,4,CH                                                04931006
GRDLF_NAME,10,246,CH                                                    04940004
GRDLF_CLASS_NAME,257,8,CH                                               04950004
GRDLF_RETAIN,266,1,CH                                                   04960004
GRDLFJ_RECORD_TYPE,5,4,CH                                               04961006
GRDLFJ_NAME,10,246,CH                                                   04970004
GRDLFJ_CLASS_NAME,257,8,CH                                              04980004
GRDLFJ_JOB_NAME,266,8,CH                                                04990004
GRST_NAME,10,246,CH                                                     05000004
GRST_CLASS_NAME,257,8,CH                                                05010004
GRST_USER_ID,266,8,CH                                                   05020004
GRST_GROUP_ID,275,8,CH                                                  05030004
GRST_TRUSTED,284,1,CH                                                   05040004
GRST_PRIVILEGED,289,1,CH                                                05050004
GRST_TRACE,294,1,CH                                                     05060004
GRSV_RECORD_TYPE,5,4,CH                                                 05061006
GRSV_NAME,10,246,CH                                                     05070004
GRSV_CLASS_NAME,257,8,CH                                                05080004
GRSV_SCRIPT_NAME,266,8,CH                                               05090004
GRSV_PARM_NAME,275,8,CH                                                 05100004
GRTME_NAME,10,246,CH                                                    05110004
GRTME_CLASS_NAME,257,8,CH                                               05120004
GRTME_PARENT,266,246,CH                                                 05130004
GRTMEC_RECORD_TYPE,5,4,CH                                               05131006
GRTMEC_NAME,10,246,CH                                                   05140004
GRTMEC_CLASS_NAME,257,8,CH                                              05150004
GRTMEC_CHILDREN,266,246,CH                                              05160004
GRTMER_RECORD_TYPE,5,4,CH                                               05161006
GRTMER_NAME,10,246,CH                                                   05170004
GRTMER_CLASS_NAME,257,8,CH                                              05180004
GRTMER_ORIGIN_ROLE,266,246,CH                                           05190004
GRTMER_PROF_CLASS,513,8,CH                                              05200004
GRTMER_PROF_NAME,522,246,CH                                             05210004
GRTMER_ACCESS_AUTH,769,8,CH                                             05220004
GRTMER_COND_CLASS,778,8,CH                                              05230004
GRTMER_COND_PROF,787,246,CH                                             05240005
GRTMEG_RECORD_TYPE,5,4,CH                                               05241006
GRTMEG_NAME,10,246,CH                                                   05250004
GRTMEG_CLASS_NAME,257,8,CH                                              05260004
GRTMEG_GROUP,266,8,CH                                                   05270004
GRTMEE_RECORD_TYPE,5,4,CH                                               05271006
GRTMEE_NAME,10,246,CH                                                   05280004
GRTMEE_CLASS_NAME,257,8,CH                                              05290004
GRTMEE_ROLE_NAME,266,246,CH                                             05300004
GRTMEE_ACCESS_AUTH,513,8,CH                                             05310004
GRTMEE_COND_CLASS,522,8,CH                                              05320004
GRTMEE_COND_PROF,531,246,CH                                             05330004
./   ADD  NAME=SELU                                                             
**********************************************************************          
* Name: SELU                                                         *          
*                                                                    *          
* Find all of the records which are applicable to a specific         *          
* user ID.                                                           *          
*                                                                    *          
* The DFSORT "INCLUDE" statement is used to select the user ID.      *          
* The DFSORT control statements are pointed to by the ICETOOL        *          
* "USING" keyword.                                                   *          
**********************************************************************          
 COPY    FROM(ADUDATA) TO(TEMP0001) USING(RACF)                                 
 DISPLAY FROM(TEMP0001) LIST(PRINT) -                                           
         PAGE -                                                                 
         TITLE('Events Associated with a Specific User')-                       
         DATE(YMD/) -                                                           
         TIME(12:)  -                                                           
         BLANK -                                                                
         ON(63,8,CH)  HEADER('User ID') -                                       
         ON(5,8,CH)   HEADER('Event') -                                         
         ON(14,8,CH)  HEADER('Qualifier') -                                     
         ON(23,8,CH)  HEADER('Time') -                                          
         ON(32,10,CH) HEADER('Date') -                                          
         ON(43,4,CH)  HEADER('System') -                                        
         ON(175,8,CH) HEADER('Terminal') -                                      
         ON(184,8,CH) HEADER('Jobname')                                         
./   ADD  NAME=SELUCNTL                                                         
 INCLUDE COND=(63,8,CH,EQ,C'IBMUSER')                                           
 OPTION   VLSHRT                                                                
./   ENDUP                                                                      
