000100*/**************************************************************/
000102*/* LICENSED UNDER THE APACHE LICENSE, VERSION 2.0 (THE        */
000103*/* "LICENSE"); YOU MAY NOT USE THIS FILE EXCEPT IN COMPLIANCE */
000104*/* WITH THE LICENSE. YOU MAY OBTAIN A COPY OF THE LICENSE AT  */
000105*/*                                                            */
000106*/* HTTP://WWW.APACHE.ORG/LICENSES/LICENSE-2.0                 */
000107*/*                                                            */
000108*/* UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING, */
000109*/* SOFTWARE DISTRIBUTED UNDER THE LICENSE IS DISTRIBUTED ON AN*/
000110*/* "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY     */
000111*/* KIND, EITHER EXPRESS OR IMPLIED.  SEE THE LICENSE FOR THE  */
000112*/* SPECIFIC LANGUAGE GOVERNING PERMISSIONS AND LIMITATIONS    */
000113*/* UNDER THE LICENSE.                                         */
000114*/*------------------------------------------------------------*/
000115*/*                                                            */
000116*/*   COPYRIGHT (C) 1993,2007 IBM CORPORATION                  */
000120*/*   COPYRIGHT (C) 2007,2018 RICOH COMPANY, LTD               */
000130*/*                                                            */
000140*/*   PERMISSION TO USE, COPY, MODIFY, AND DISTRIBUTE          */
000150*/*   THIS SOFTWARE FOR ANY PURPOSE WITH OR WITHOUT FEE        */
000160*/*   IS HEREBY GRANTED, PROVIDED THAT THE ABOVE               */
000170*/*   COPYRIGHT NOTICES APPEAR IN ALL COPIES.                  */
000171*/*                                                            */
000180*/*   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY       */
000190*/*   OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT       */
000191*/*   LIMITED TO THE WARRANTIES OF MERCHANTABILITY,            */
000192*/*   FITNESS FOR A PARTICULAR PURPOSE AND                     */
000193*/*   NONINFRINGEMENT.  IN NO EVENT SHALL RICOH, RICOH         */
000194*/*   SUBSIDIARIES, ANY OF ITS SUPPLIERS OR ANY OF THE         */
000195*/*   OTHER COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,         */
000196*/*   DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF      */
000197*/*   CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF        */
000198*/*   OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR         */
000199*/*   OTHER DEALINGS IN THE SOFTWARE.                          */
000200*/**************************************************************/
002400 01  STRUCTURED-FIELDS    GLOBAL.
002500*----------------------------------------------------------------*
002600* COBOL DEFINITIONS FOR STRUCTURED FIELD IDENTIFIERS AND         *
002700* COMPOSED-TEXT CONTROLS. SEE DATA STREAM & OBJECT ARCHITECTURES *
002800* MODCA REFERENCE, SC31-6802-02.                                 *
002900* THESE DEFINITIONS ARE COMPATIBLE WITH VS COBOL II, RELEASE 3   *
003000* OR LATER ONLY.                                                 *
003100* LAST UPDATE ON 15 APR 2004 AT 11:58:22 BY  HOWARDT VERSION 01   *
003200* ADDED IDENTIFIERS FOR COMMON TRIPLETS                          *
003300* * LAST UPDATE ON  5 MAR 1993 AT 16:38:03 BY VEND789 VERSION 04**
003400* INDEXING STRUCTURED FIELDS AND TRIPLETS.                       *
003500* * LAST UPDATE ON 16 MAR 2004 AT 09:45:04 BY HOWARDT VERSION 05**
003600* NEW TEXT CONTROLS AND STRUCTURED FIELDS.                   @05A*
003700* LAST UPDATE ON 14 APR 2004 AT 14:12:03 BY  HOWARDT VERSION 01   *
003800* ADD FQN TYPES, TRIPLETS, CONSTANTS.                        @06A*
003900*----------------------------------------------------------------*
004000   03  SF-CC             PIC X    VALUE X'5A'.                    !@05A
004100   03  SF-NAMES.
004200* SYMBOLS FOR STRUCTURED FIELD IDENTIFIERS:
004300     05  SF-BAG          PIC XXX  VALUE X'D3A8C9'.
004400     05  SFN-BAG         PIC XXX  VALUE 'BAG'.
004500*               BEGIN ACTIVE ENVIRON .
004600     05  SF-BBC          PIC XXX  VALUE X'D3A8EB'.
004700     05  SFN-BBC         PIC XXX  VALUE 'BBC'.
004800*               BEGIN BAR CODE OBJECT.
004900     05  SF-BCA          PIC XXX  VALUE X'D3A877'.
005000     05  SFN-BCA         PIC XXX  VALUE 'BCA'.
005100*               COLOR ATTRIBUTE TABLE .
005200     05  SF-BCF          PIC XXX  VALUE X'D3A88A'.
005300     05  SFN-BCF         PIC XXX  VALUE 'BCF'.
005400*               BEGIN CODED FONT .
005500     05  SF-BCP          PIC XXX  VALUE X'D3A887'.
005600     05  SFN-BCP         PIC XXX  VALUE 'BCP'.
005700*               BEGIN CODE PAGE .
005800     05  SF-BCT          PIC XXX  VALUE X'D3A89B'.
005900     05  SFN-BCT         PIC XXX  VALUE 'BCT'.
006000*               BEGIN COMPOSED-TEXT .
006100     05  SF-BDA          PIC XXX  VALUE X'D3EEEB'.
006200     05  SFN-BDA         PIC XXX  VALUE 'BDA'.
006300*               BAR CODE DATA.
006400     05  SF-BDD          PIC XXX  VALUE X'D3A6EB'.
006500     05  SFN-BDD         PIC XXX  VALUE 'BDD'.
006600*               BAR CODE DATA DESCRIPTOR.
006700     05  SF-BDG          PIC XXX  VALUE X'D3A8C4'.
006800     05  SFN-BDG         PIC XXX  VALUE 'BDG'.
006900*               BEGIN DOC ENVIRON GROUP .
007000     05  SF-BDI          PIC XXX  VALUE X'D3A8A7'.
007100     05  SFN-BDI         PIC XXX  VALUE 'BDI'.
007200*               BEGIN DOC INDEX.
007300     05  SF-BDM          PIC XXX  VALUE X'D3A8CA'.
007400     05  SFN-BDM         PIC XXX  VALUE 'BDM'.
007500*               BEGIN DATA MAP .
007600     05  SF-BDT          PIC XXX  VALUE X'D3A8A8'.
007700     05  SFN-BDT         PIC XXX  VALUE 'BDT'.
007800*               BEGIN DOCUMENT .
007900     05  SF-BDX          PIC XXX  VALUE X'D3A8E3'.
008000     05  SFN-BDX         PIC XXX  VALUE 'BDX'.
008100*               BEGIN DATA MAP XMIT SUBCASE .
008200     05  SF-BFG          PIC XXX  VALUE X'D3A8C5'.
008300     05  SFN-BFG         PIC XXX  VALUE 'BFG'.
008400*               BEGIN FORM ENVIRONMENT GRP .
008500     05  SF-BFM          PIC XXX  VALUE X'D3A8CD'.
008600     05  SFN-BFM         PIC XXX  VALUE 'BFM'.
008700*               BEGIN FORM MAP        .
008800     05  SF-BFN          PIC XXX  VALUE X'D3A889'.
008900     05  SFN-BFN         PIC XXX  VALUE 'BFN'.
009000*               BEGIN FONT            .
009100     05  SF-BGR          PIC XXX  VALUE X'D3A8BB'.
009200     05  SFN-BGR         PIC XXX  VALUE 'BGR'.
009300*               BEGIN GRAPHICS OBJECT.
009400     05  SF-BII          PIC XXX  VALUE X'D3A87B'.
009500     05  SFN-BII         PIC XXX  VALUE 'BII'.
009600*               BEGIN IMAGE OBJECT IM.
009700     05  SF-BIM          PIC XXX  VALUE X'D3A8FB'.
009800     05  SFN-BIM         PIC XXX  VALUE 'BIM'.
009900*               BEGIN IMAGE OBJECT IO.
010000     05  SF-BMM          PIC XXX  VALUE X'D3A8CC'.
010100     05  SFN-BMM         PIC XXX  VALUE 'BMM'.
010200*               BEGIN MEDIUM MAP .
010300     05  SF-BMO          PIC XXX  VALUE X'D3A8DF'.
010400     05  SFN-BMO         PIC XXX  VALUE 'BMO'.
010500*               BEGIN MEDIUM OVERLAY .
010600     05  SF-BNG          PIC XXX  VALUE X'D3A8AD'.
010700     05  SFN-BNG         PIC XXX  VALUE 'BNG'.
010800*               BEGIN NAMED GROUP.
010900     05  SF-BOC          PIC XXX  VALUE X'D3A892'.
011000     05  SFN-BOC         PIC XXX  VALUE 'BOC'.
011100*               BEGIN OBJECT CONTAINER.                           !@05C
011200     05  SF-BOG          PIC XXX  VALUE X'D3A8C7'.
011300     05  SFN-BOG         PIC XXX  VALUE 'BOG'.
011400*               BEGIN OBJECT ENVIRONMENT GROUP.
011500     05  SF-BPG          PIC XXX  VALUE X'D3A8AF'.
011600     05  SFN-BPG         PIC XXX  VALUE 'BPG'.
011700*               BEGIN PAGE     .
011800     05  SF-BPM          PIC XXX  VALUE X'D3A8CB'.
011900     05  SFN-BPM         PIC XXX  VALUE 'BPM'.
012000*               BEGIN PAGE MAP .
012100     05  SF-BPS          PIC XXX  VALUE X'D3A85F'.
012200     05  SFN-BPS         PIC XXX  VALUE 'BPS'.
012300*               BEGIN PAGE SEGMENT .
012400     05  SF-BPT          PIC XXX  VALUE X'D3A89B'.
012500     05  SFN-BPT         PIC XXX  VALUE 'BPT'.
012600*               BEGIN PRESENTATION TEXT .
012700     05  SF-BRS          PIC XXX  VALUE X'D3A8CE'.
012800     05  SFN-BRS         PIC XXX  VALUE 'BRS'.
012900*               BEGIN RESOURCE .                                  !@05C
013000     05  SF-BRG          PIC XXX  VALUE X'D3A8C6'.
013100     05  SFN-BRG         PIC XXX  VALUE 'BRG'.
013200*               BEGIN RESOURCE GROUP .
013300     05  SF-CAT          PIC XXX  VALUE X'D3B077'.
013400     05  SFN-CCP         PIC XXX  VALUE 'CAT'.
013500*               COLOR ATTRIBUTE TABLE .
013600     05  SF-CCP          PIC XXX  VALUE X'D3A7CA'.
013700     05  SFN-CCP         PIC XXX  VALUE 'CCP'.
013800*               CONDITIONAL PROC CNT .
013900     05  SF-CDD          PIC XXX  VALUE X'D3A692'.
014000     05  SFN-CDD         PIC XXX  VALUE 'CDD'.
014100*               CONTAINER DATA DESCR .
014200     05  SF-CFC          PIC XXX  VALUE X'D3A78A'.
014300     05  SFN-CFC         PIC XXX  VALUE 'CFC'.
014400*               CODED FONT CONTROL .
014500     05  SF-CFI          PIC XXX  VALUE X'D38C8A'.
014600     05  SFN-CFI         PIC XXX  VALUE 'CFI'.
014700*               CODED FONT INDEX .
014800     05  SF-CPC          PIC XXX  VALUE X'D3A787'.
014900     05  SFN-CPC         PIC XXX  VALUE 'CPC'.
015000*               CODED PAGE CONTROL .
015100     05  SF-CPD          PIC XXX  VALUE X'D3A687'.
015200     05  SFN-CPD         PIC XXX  VALUE 'CPD'.
015300*               CODED PAGE DESCRIPTO .
015400     05  SF-CPI          PIC XXX  VALUE X'D3AC87'.
015500     05  SFN-CPI         PIC XXX  VALUE 'CPI'.
015600*               CODED PAGE INDEX .
015700     05  SF-CTC          PIC XXX  VALUE X'D3A79B'.
015800     05  SFN-CTC         PIC XXX  VALUE 'CTC'.
015900*               COMPOSED TEXT CONTRO .
016000     05  SF-CTD          PIC XXX  VALUE X'D3A69B'.
016100     05  SFN-CTD         PIC XXX  VALUE 'CTD'.
016200*               COMPOSED TEXT DESCR. .
016300     05  SF-CTX          PIC XXX  VALUE X'D3EE9B'.
016400     05  SFN-CTX         PIC XXX  VALUE 'CTX'.
016500*               COMPOSED TEXT DATA .
016600     05  SF-DXD          PIC XXX  VALUE X'D3A6E3'.
016700     05  SFN-DXD         PIC XXX  VALUE 'DXD'.
016800*               DATA MAP SUBCASE DES .
016900     05  SF-DCF          PIC XXX  VALUE X'D33930'.
017000     05  SFN-DCF         PIC XXX  VALUE 'DCF'.
017100*               DCFINDEX             .
017200     05  SF-EAG          PIC XXX  VALUE X'D3A9C9'.
017300     05  SFN-EAG         PIC XXX  VALUE 'EAG'.
017400*               END ACTIVE ENVIR GRP .
017500     05  SF-EBC          PIC XXX  VALUE X'D3A9EB'.
017600     05  SFN-EBC         PIC XXX  VALUE 'EBC'.
017700*               END BAR CODE OBJECT.
017800     05  SF-ECA          PIC XXX  VALUE X'D3A977'.
017900     05  SFN-ECA         PIC XXX  VALUE 'ECA'.
018000*               END COLOR ATTRIB. TBL .
018100     05  SF-ECF          PIC XXX  VALUE X'D3A98A'.
018200     05  SFN-ECF         PIC XXX  VALUE 'ECF'.
018300*               END CODED FONT .
018400     05  SF-ECP          PIC XXX  VALUE X'D3A987'.
018500     05  SFN-ECP         PIC XXX  VALUE 'ECP'.
018600*               END CODED PAGE .
018700     05  SF-ECT          PIC XXX  VALUE X'D3A99B'.
018800     05  SFN-ECT         PIC XXX  VALUE 'ECT'.
018900*               END COMPOSED TEXT BL .
019000     05  SF-EDG          PIC XXX  VALUE X'D3A9C4'.
019100     05  SFN-EDG         PIC XXX  VALUE 'EDG'.
019200*               END DOC ENVIRN GROUP .
019300     05  SF-EDI          PIC XXX  VALUE X'D3A9A7'.
019400     05  SFN-EDI         PIC XXX  VALUE 'EDI'.
019500*               END DOC INDEX.
019600     05  SF-EDM          PIC XXX  VALUE X'D3A9CA'.
019700     05  SFN-EDM         PIC XXX  VALUE 'EDM'.
019800*               END DATA MAP   .
019900     05  SF-EDT          PIC XXX  VALUE X'D3A9A8'.
020000     05  SFN-EDT         PIC XXX  VALUE 'EDT'.
020100*               END OF DOCUMENT .
020200     05  SF-EDX          PIC XXX  VALUE X'D3A9E3'.
020300     05  SFN-EDX         PIC XXX  VALUE 'EDX'.
020400*               END DATA MAP XMIT SU .
020500     05  SF-EFG          PIC XXX  VALUE X'D3A9C5'.
020600     05  SFN-EFG         PIC XXX  VALUE 'EFG'.
020700*               END FORM ENVIRON GRP .
020800     05  SF-EFM          PIC XXX  VALUE X'D3A9CD'.
020900     05  SFN-EFM         PIC XXX  VALUE 'EFM'.
021000*               END FORM MAP   .
021100     05  SF-EFN          PIC XXX  VALUE X'D3A989'.
021200     05  SFN-EFN         PIC XXX  VALUE 'EFN'.
021300*               END FONT       .
021400     05  SF-EGR          PIC XXX  VALUE X'D3A9BB'.
021500     05  SFN-EGR         PIC XXX  VALUE 'EGR'.
021600*               END GRAPHICS OBJECT.
021700     05  SF-EII          PIC XXX  VALUE X'D3A97B'.
021800     05  SFN-EII         PIC XXX  VALUE 'EII'.
021900*               END IMAGE BLOCK IM.
022000     05  SF-EIM          PIC XXX  VALUE X'D3A9FB'.
022100     05  SFN-EIM         PIC XXX  VALUE 'EIM'.
022200*               END IMAGE BLOCK IO.
022300     05  SF-EMM          PIC XXX  VALUE X'D3A9CC'.
022400     05  SFN-EMM         PIC XXX  VALUE 'EMM'.
022500*               END MEDIUM MAP .
022600     05  SF-EMO          PIC XXX  VALUE X'D3A9DF'.
022700     05  SFN-EMO         PIC XXX  VALUE 'EMO'.
022800*               END MEDIUM OVERLAY .
022900     05  SF-ENG          PIC XXX  VALUE X'D3A9AD'.
023000     05  SFN-ENG         PIC XXX  VALUE 'ENG'.
023100*               END NAMED GROUP.
023200     05  SF-EOC          PIC XXX  VALUE X'D3A992'.
023300     05  SFN-EOC         PIC XXX  VALUE 'EOC'.
023400*               END OBJECT CONTAINER.                             !@05C
023500     05  SF-EOG          PIC XXX  VALUE X'D3A9C7'.
023600     05  SFN-EOG         PIC XXX  VALUE 'EOG'.
023700*               END OBJECT ENVIRONMENT GROUP.
023800     05  SF-EPG          PIC XXX  VALUE X'D3A9AF'.
023900     05  SFN-EPG         PIC XXX  VALUE 'EPG'.
024000*               END PAGE       .
024100     05  SF-EPM          PIC XXX  VALUE X'D3A9CB'.
024200     05  SFN-EPM         PIC XXX  VALUE 'EPM'.
024300*               END PAGE MAP   .
024400     05  SF-EPS          PIC XXX  VALUE X'D3A95F'.
024500     05  SFN-EPS         PIC XXX  VALUE 'EPS'.
024600*               END PAGE SEGMENT .
024700     05  SF-EPT          PIC XXX  VALUE X'D3A99B'.
024800     05  SFN-EPT         PIC XXX  VALUE 'EPT'.
024900*               END PRESENTATION TEXT .
025000     05  SF-ER           PIC XXX  VALUE X'D3A9CE'.
025100     05  SFN-ER          PIC XXX  VALUE 'ER '.
025200*               END RESOURCE   .
025300     05  SF-ERG          PIC XXX  VALUE X'D3A9C6'.
025400     05  SFN-ERG         PIC XXX  VALUE 'ERG'.
025500*               END RESOURCE GROUP .
025600     05  SF-FDS          PIC XXX  VALUE X'D3AAEC'.
025700     05  SFN-FDS         PIC XXX  VALUE 'FDS'.
025800*               FIXED DATA SIZE .
025900     05  SF-FDX          PIC XXX  VALUE X'D3EEEC'.
026000     05  SFN-FDX         PIC XXX  VALUE 'FDX'.
026100*               FIXED DATA TEXT .
026200     05  SF-FGD          PIC XXX  VALUE X'D3A6C5'.
026300     05  SFN-FGD         PIC XXX  VALUE 'FGD'.
026400*               FORM ENVIRN GRP DESC .
026500     05  SF-FNC          PIC XXX  VALUE X'D3A789'.
026600     05  SFN-FNC         PIC XXX  VALUE 'FNC'.
026700*               FONT CONTROL   .
026800     05  SF-FND          PIC XXX  VALUE X'D3A689'.
026900     05  SFN-FND         PIC XXX  VALUE 'FND'.
027000*               FONT DESCRIPTOR .
027100     05  SF-FNG          PIC XXX  VALUE X'D3EE89'.
027200     05  SFN-FNG         PIC XXX  VALUE 'FNG'.
027300*               FONT PATTERNS  .
027400     05  SF-FNI          PIC XXX  VALUE X'D38C89'.
027500     05  SFN-FNI         PIC XXX  VALUE 'FNI'.
027600*               FONT INDEX     .
027700     05  SF-FNM          PIC XXX  VALUE X'D3A289'.
027800     05  SFN-FNM         PIC XXX  VALUE 'FNM'.
027900*               FONT PATTERNS MAP .
028000     05  SF-FNO          PIC XXX  VALUE X'D3AE89'.
028100     05  SFN-FNO         PIC XXX  VALUE 'FNO'.
028200*               FONT ORIENTATION .
028300     05  SF-FNP          PIC XXX  VALUE X'D3AC89'.
028400     05  SFN-FNP         PIC XXX  VALUE 'FNP'.
028500*               FONT POSITION  .
028600     05  SF-GAD          PIC XXX  VALUE X'D3EEBB'.
028700     05  SFN-GAD         PIC XXX  VALUE 'GAD'.
028800*               GRAPHICS DATA.
028900     05  SF-GDD          PIC XXX  VALUE X'D3A6BB'.
029000     05  SFN-GDD         PIC XXX  VALUE 'GDD'.
029100*               GRAPHICS DATA DESCRIPTOR.
029200     05  SF-ICP          PIC XXX  VALUE X'D3AC7B'.
029300     05  SFN-ICP         PIC XXX  VALUE 'ICP'.
029400*               IMAGE CELL POSITION .
029500     05  SF-IDD          PIC XXX  VALUE X'D3A6FB'.
029600     05  SFN-IDD         PIC XXX  VALUE 'IDD'.
029700*               IMAGE DATA DESCRIPTOR IO.
029800     05  SF-IDM          PIC XXX  VALUE X'D3ABCA'.
029900     05  SFN-IDM         PIC XXX  VALUE 'IDM'.
030000*               INVOKE DATA MAP .
030100     05  SF-IEL          PIC XXX  VALUE X'D3B2A7'.
030200     05  SFN-IEL         PIC XXX  VALUE 'IEL'.
030300*               INDEX ELEMENT.
030400     05  SF-IID          PIC XXX  VALUE X'D3A67B'.
030500     05  SFN-IID         PIC XXX  VALUE 'IID'.
030600*               IMAGE INPUT DESCRIPTOR IM.
030700     05  SF-IMM          PIC XXX  VALUE X'D3ABCC'.
030800     05  SFN-IMM         PIC XXX  VALUE 'IMM'.
030900*               IMAGE MEDIUM MAP .
031000     05  SF-IOB          PIC XXX  VALUE X'D3AFC3'.
031100     05  SFN-IOB         PIC XXX  VALUE 'IOB'.
031200*               INCLUDE OBJECT       .
031300     05  SF-IOC          PIC XXX  VALUE X'D3A77B'.
031400     05  SFN-IOC         PIC XXX  VALUE 'IOC'.
031500*               IMAGE OUTPUT CONTROL .
031600     05  SF-IPD          PIC XXX  VALUE X'D3EEFB'.
031700     05  SFN-IPD         PIC XXX  VALUE 'IPD'.
031800*               IMAGE PICTURE DATA IO.
031900     05  SF-IPO          PIC XXX  VALUE X'D3AFD8'.
032000     05  SFN-IPO         PIC XXX  VALUE 'IPO'.
032100*               INCLUDE PAGE OVERLAY .
032200     05  SF-IPS          PIC XXX  VALUE X'D3AF5F'.
032300     05  SFN-IPS         PIC XXX  VALUE 'IPS'.
032400*               INCLUDE PAGE SEGMENT .
032500     05  SF-IRD          PIC XXX  VALUE X'D3EE7B'.
032600     05  SFN-IRD         PIC XXX  VALUE 'IRD'.
032700*               IMAGE RASTER DATA .
032800     05  SF-LLE          PIC XXX  VALUE X'D3B490'.
032900     05  SFN-LLE         PIC XXX  VALUE 'LLE'.
033000*               LINK LOGICAL ELEMENT .
033100     05  SF-LNC          PIC XXX  VALUE X'D3AAE7'.
033200     05  SFN-LNC         PIC XXX  VALUE 'LNC'.
033300*               LINE DESCRIPTOR COUN .
033400     05  SF-LND          PIC XXX  VALUE X'D3A6E7'.
033500     05  SFN-LND         PIC XXX  VALUE 'LND'.
033600*               LINE DESCRIPTOR .
033700     05  SF-MBC          PIC XXX  VALUE X'D3ABEB'.
033800     05  SFN-MBC         PIC XXX  VALUE 'MBC'.
033900*               MAP BAR CODE.
034000     05  SF-MCA          PIC XXX  VALUE X'D3AB77'.
034100     05  SFN-MCA         PIC XXX  VALUE 'MCA'.
034200*               MAP COLOR ATTRIB. TABLE.
034300     05  SF-MCC          PIC XXX  VALUE X'D3A288'.
034400     05  SFN-MCC         PIC XXX  VALUE 'MCC'.
034500*               MEDIUM COPY COUNT .
034600     05  SF-MCF          PIC XXX  VALUE X'D3B18A'.
034700     05  SFN-MCF         PIC XXX  VALUE 'MCF'.
034800*               MAP CODED FONT (FORMAT 1).
034900     05  SF-MCF2         PIC XXX  VALUE X'D3AB8A'.
035000     05  SFN-MCF2        PIC XXX  VALUE 'MCF'.
035100*               MAP CODED FONT (FORMAT 2).
035200     05  SF-MDD          PIC XXX  VALUE X'D3A688'.
035300     05  SFN-MDD         PIC XXX  VALUE 'MDD'.
035400*               MEDIUM DESCRIPTOR .
035500     05  SF-MDR          PIC XXX  VALUE X'D3ABC3'.
035600     05  SFN-MDR         PIC XXX  VALUE 'MDR'.
035700*               MAP DATA RESOURCE .
035800     05  SF-MFC          PIC XXX  VALUE X'D3A088'.
035900     05  SFN-MFC         PIC XXX  VALUE 'MFC'.
036000*               MEDIUM FINISHING CONTROL.                         !@05C
036100     05  SF-MGO          PIC XXX  VALUE X'D3ABBB'.
036200     05  SFN-MGO         PIC XXX  VALUE 'MGO'.
036300*               MAP GRAPHICS OBJECT.
036400     05  SF-MIO          PIC XXX  VALUE X'D3ABFB'.
036500     05  SFN-MIO         PIC XXX  VALUE 'MIO'.
036600*               MAP IO IMAGE OBJECT.
036700     05  SF-MMC          PIC XXX  VALUE X'D3A788'.
036800     05  SFN-MMC         PIC XXX  VALUE 'MMC'.
036900*               MEDIUM MODIFICATION .
037000     05  SF-MMO          PIC XXX  VALUE X'D3B1DF'.
037100     05  SFN-MMO         PIC XXX  VALUE 'MMO'.
037200*               MAP MEDIUM OVERLAY .
037300     05  SF-MMT          PIC XXX  VALUE X'D3AB88'.
037400     05  SFN-MMT         PIC XXX  VALUE 'MMT'.
037500*               MAP MEDIA TYPE.                                   !@05C
037600     05  SF-MPO          PIC XXX  VALUE X'D3ABD8'.
037700     05  SFN-MPO         PIC XXX  VALUE 'MPO'.
037800*               MAP PAGE OVERLAY .
037900     05  SF-MPG          PIC XXX  VALUE X'D3ABAF'.
038000     05  SFN-MPG         PIC XXX  VALUE 'MPG'.                    !@05C
038100*               MAP PAGE .
038200     05  SF-MPS          PIC XXX  VALUE X'D3B15F'.
038300     05  SFN-MPS         PIC XXX  VALUE 'MPS'.
038400*               MAP PAGE SEGMENT .
038500     05  SF-MSU          PIC XXX  VALUE X'D3ABEA'.
038600     05  SFN-MSU         PIC XXX  VALUE 'MSU'.
038700*               MAP SUPPRESSION .
038800     05  SF-NOP          PIC XXX  VALUE X'D3EEEE'.
038900     05  SFN-NOP         PIC XXX  VALUE 'NOP'.
039000*               NO OPERATION   .
039100     05  SF-OBD          PIC XXX  VALUE X'D3A66B'.
039200     05  SFN-OBD         PIC XXX  VALUE 'OBD'.
039300*               OBJECT AREA DESCRIPTOR.
039400     05  SF-OBP          PIC XXX  VALUE X'D3AC6B'.
039500     05  SFN-OBP         PIC XXX  VALUE 'OBP'.
039600*               OBJECT AREA POSITION.
039700     05  SF-OCD          PIC XXX  VALUE X'D33392'.
039800     05  SFN-OCD         PIC XXX  VALUE 'OCD'.
039900*               OBJECT CONTAINER DATA .
040000     05  SF-PFC          PIC XXX  VALUE X'D3B288'.
040100     05  SFN-PFC         PIC XXX  VALUE 'PFD'.
040200*               PRESENTATION FIDELITY CONTROL .                   !@05C
040300     05  SF-PGD          PIC XXX  VALUE X'D3A6AF'.
040400     05  SFN-PGD         PIC XXX  VALUE 'PGD'.
040500*               PAGE DESCRIPTOR .
040600     05  SF-PGP          PIC XXX  VALUE X'D3ACAF'.
040700     05  SFN-PGP         PIC XXX  VALUE 'PGP'.
040800*               PAGE POSITION  .
040900     05  SF-PGP2         PIC XXX  VALUE X'D3B1AF'.
041000     05  SFN-PGP2        PIC XXX  VALUE 'PGP'.
041100*               PAGE POSITION (FORMAT 2).
041200     05  SF-PMC          PIC XXX  VALUE X'D3A7AF'.
041300     05  SFN-PMC         PIC XXX  VALUE 'PMC'.
041400*               PAGE MODIFICATION CONTROL .
041500     05  SF-PPO          PIC XXX  VALUE X'D3ADC3'.
041600     05  SFN-PPO         PIC XXX  VALUE 'PPO'.
041700*               PREPROCESS PRESENTATION CONTROL .                 !@05C
041800     05  SF-PTD          PIC XXX  VALUE X'D3A69B'.
041900     05  SFN-PTD         PIC XXX  VALUE 'PTD'.
042000*               PRESENTATION TEXT DESCRIPTOR (FORMAT 1).
042100     05  SF-PTD2         PIC XXX  VALUE X'D3B19B'.
042200     05  SFN-PTD2        PIC XXX  VALUE 'PTD'.
042300*               PRESENTATION TEXT DESCRIPTOR (FORMAT 2).
042400     05  SF-PTX          PIC XXX  VALUE X'D3EE9B'.
042500     05  SFN-PTX         PIC XXX  VALUE 'PTX'.
042600*               PRESENTATION TEXT DESCRIPTOR (FORMAT 2).
042700     05  SF-TLE          PIC XXX  VALUE X'D3A090'.
042800     05  SFN-TLE         PIC XXX  VALUE 'TLE'.
042900*               TAG LOGICAL ELEMENT.
043000   03  SF-TABLE          REDEFINES SF-NAMES,
043100                         OCCURS 129,
043200                         ASCENDING KEY SF-ID,
043300                         INDEXED BY SF-ID-INDX.
043400     05  SF-VALUE        PIC XXX.
043500     05  SF-ID           PIC XXX.
043600*
043700*               PRESENTATION TEXT DATA .
043800*--------------------------------------------------------------*
043900* COMPOSED TEXT CONTROL SEQUENCES.                             *
044000* TEXT CONTROLS ARE DESCRIBED AS FOLLOWS:                      *
044100* BYTE 1: LENGTH. ZERO REPRESENTS A VARIABLE LENGTH CODE.      *
044200* BYTE 2: TEXT-CONTROL CODE, UNCHAINED. (EVEN VALUES)          *
044300*         CHAINED CONTROL CODES ARE REPRESENTED BY THE HIGH-OR *
044400*         BIT TURNED ON (ODD VALUES).                          *
044500*--------------------------------------------------------------*
044600   03  TC-NAMES.
044700     05  TC-AMB          PIC XX   VALUE X'04D2'.
044800     05  TC-AMB-C        PIC XX   VALUE X'04D3'.
044900     05  TCN-AMB         PIC XXX  VALUE 'AMB'.
045000*               ABSOLUTE MOVE BASELINE.
045100     05  TC-AMI          PIC XX   VALUE X'04C6'.
045200     05  TC-AMI-C        PIC XX   VALUE X'04C7'.
045300     05  TCN-AMI         PIC XXX  VALUE 'AMI'.
045400*               ABSOLUTE MOVE INLINE .
045500     05  TC-BLN          PIC XX   VALUE X'02D8'.
045600     05  TC-BLN-C        PIC XX   VALUE X'02D9'.
045700     05  TCN-BLN         PIC XXX  VALUE 'BLN'.
045800*               BEGIN LINE     .
045900     05  TC-BSU          PIC XX   VALUE X'03F2'.
046000     05  TC-BSU-C        PIC XX   VALUE X'03F3'.
046100     05  TCN-BSU         PIC XXX  VALUE 'BSU'.
046200*               BEGIN SUPPRESSION .
046300     05  TC-CCTL         PIC XX  VALUE X'0001'.
046400     05  TC-CCTL-C       PIC XX  VALUE X'0001'.
046500     05  TCN-CCT         PIC XXX  VALUE 'CCT'.
046600*               CHAINED CONTROL FLAG .
046700     05  TC-DBR          PIC XX   VALUE X'07E6'.
046800     05  TC-DBR-C        PIC XX   VALUE X'07E7'.
046900     05  TCN-DBR         PIC XXX  VALUE 'DBR'.
047000*               DRAW BASELINE RULE .
047100     05  TC-DIR          PIC XX   VALUE X'07E4'.
047200     05  TC-DIR-C        PIC XX   VALUE X'07E5'.
047300     05  TCN-DIR         PIC XXX  VALUE 'DIR'.
047400*               DRAW INLINE RULE .
047500     05  TC-ESC          PIC XX   VALUE X'2BD3'.
047600     05  TC-ESC-C        PIC XX   VALUE X'2BD3'.
047700     05  TCN-ESC         PIC XXX  VALUE 'ESC'.
047800*               ESCAPE SEQUENCE .
047900     05  TC-ESU          PIC XX   VALUE X'03F4'.
048000     05  TC-ESU-C        PIC XX   VALUE X'03F5'.
048100     05  TCN-ESU         PIC XXX  VALUE 'ESU'.
048200*               END SUPPRESSION .
048300     05  TC-NOP          PIC XX   VALUE X'00F8'.
048400     05  TC-NOP-C        PIC XX   VALUE X'00F9'.
048500     05  TCN-NOP         PIC XXX  VALUE 'NOP'.
048600*               NO OPERATION   .
048700     05  TC-OVS          PIC XX   VALUE X'0572'.
048800     05  TC-OVS-C        PIC XX   VALUE X'0573'.
048900     05  TCN-OVS         PIC XXX  VALUE 'OVS'.
049000*               OVERSTRIKE.
049100     05  TC-RMB          PIC XX   VALUE X'04D4'.
049200     05  TC-RMB-C        PIC XX   VALUE X'04D5'.
049300     05  TCN-RMB         PIC XXX  VALUE 'RMB'.
049400*               RELATIVE MOVE BASELINE.
049500     05  TC-RMI          PIC XX   VALUE X'04C8'.
049600     05  TC-RMI-C        PIC XX   VALUE X'04C9'.
049700     05  TCN-RMI         PIC XXX  VALUE 'RMI'.
049800*               RELATIVE MOVE INLINE .
049900     05  TC-RPS          PIC XX   VALUE X'00EE'.
050000     05  TC-RPS-C        PIC XX   VALUE X'00EF'.
050100     05  TCN-RPS         PIC XXX  VALUE 'RPS'.
050200*               REPEAT STRING  .
050300     05  TC-SBI          PIC XX   VALUE X'04D0'.
050400     05  TC-SBI-C        PIC XX   VALUE X'04D1'.
050500     05  TCN-SBI         PIC XXX  VALUE 'SBI'.
050600*               SET BASELINE INCREMENT.
050700     05  TC-SCFL          PIC XX  VALUE X'03F0'.
050800     05  TC-SCFL-C        PIC XX  VALUE X'03F1'.
050900     05  TCN-SCFL         PIC XXX VALUE 'SCF'.
051000*               SET CODED FONT LOCAL .
051100     05  TC-SEC          PIC XX   VALUE X'0080'.
051200     05  TC-SEC-C        PIC XX   VALUE X'0081'.
051300     05  TCN-SEC         PIC XXX  VALUE 'SEC'.
051400*               SET EXTENDED TEXT COLOR.                          !@05C
051500     05  TC-SIA          PIC XX   VALUE X'04C2'.
051600     05  TC-SIA-C        PIC XX   VALUE X'04C3'.
051700     05  TCN-SIA         PIC XXX  VALUE 'SIA'.
051800*               SET INTERCHARACTER ADJUSTMENT.
051900     05  TC-SIM          PIC XX   VALUE X'04C0'.
052000     05  TC-SIM-C        PIC XX   VALUE X'04C1'.
052100     05  TCN-SIM         PIC XXX  VALUE 'SIM'.
052200*               SET INLINE MARGIN .
052300     05  TC-STC          PIC XX   VALUE X'05F6'.
052400     05  TC-STC-C        PIC XX   VALUE X'05F7'.
052500     05  TCN-STC         PIC XXX  VALUE 'STC'.
052600*               SET TEXT COLOR.
052700     05  TC-STO          PIC XX   VALUE X'06F6'.
052800     05  TC-STO-C        PIC XX   VALUE X'06F7'.
052900     05  TCN-STO         PIC XXX  VALUE 'STO'.
053000*               SET TEXT ORIENTATION .
053100     05  TC-SVI          PIC XX   VALUE X'04C4'.
053200     05  TC-SVI-C        PIC XX   VALUE X'04C5'.
053300     05  TCN-SVI         PIC XXX  VALUE 'SVI'.
053400*               SET VAR SPC CHAR INCREMENT.
053500     05  TC-TRN          PIC XX   VALUE X'00DA'.
053600     05  TC-TRN-C        PIC XX   VALUE X'00DB'.
053700     05  TCN-TRN         PIC XXX  VALUE 'TRN'.
053800*               TRANSPARENT DATA .
053900     05  TC-USC          PIC XX   VALUE X'0376'.
054000     05  TC-USC-C        PIC XX   VALUE X'0377'.
054100     05  TCN-USC         PIC XXX  VALUE 'USC'.
054200*               UNDERSCORE.
054300   03  TC-TABLE          REDEFINES TC-NAMES
054400                         OCCURS 24,
054500                         ASCENDING KEY TC-ID,
054600                         INDEXED BY TC-ID-INDX.
054700     05  TC-LENGTH       PIC X.
054800     05  TC-VALUE        PIC X.
054900     05  TC-LENGTH-C     PIC X.
055000     05  TC-VALUE-C      PIC X.
055100     05  TC-ID           PIC XXX.
055200*
055300*               GRAPHICS DRAWING ORDERS.
055400*--------------------------------------------------------------*
055500* GOCA GRAPHICS DRAWING ORDERS.                                *
055600* NAMING FOLLOWS CONVENTIONS IN GOCA REFERENCE, SC31-6804.     *
055700* ORDERS ARE FOR DR2 SUBSET, VERSION 0.                        *
055800* BYTE 1: DRAWING ORDER.                                       *
055900* BYTE 2: ORDER LENGTH: 0=VARIABLE LENGTH,                     *
056000*         X'FF'=1 OR 2 BYTE ORDER,                             *
056100*         OTHER VALUES REPRESENT FIXED LENGTH.                 *
056200*--------------------------------------------------------------*
056300   03  GR-NAMES.
056400     05  GRBSI           PIC XX   VALUE X'700C'.
056500     05  GRN-GRBSI       PIC X(6) VALUE 'GRBSI'.
056600*               BEGIN SEGMENT INTRODUCER.
056700     05  GBAR            PIC XX   VALUE X'68FF'.
056800     05  GRN-GBAR        PIC X(6) VALUE 'GBAR '.
056900*               BEGIN AREA.
057000     05  GBIMG           PIC XX   VALUE X'D10A'.
057100     05  GRN-GBIMG       PIC X(6) VALUE 'GBIMG'.
057200*               BEGIN IMAGE.
057300     05  GBCIMG          PIC XX   VALUE X'9106'.
057400     05  GRN-GBCIMG      PIC X(6) VALUE 'GCBIMG'.
057500*               BEGIN IMAGE AT CURRENT POSITION.
057600     05  GBOX            PIC XX   VALUE X'C000'.
057700     05  GRN-GBOX        PIC X(6) VALUE 'GBOX '.
057800*               BOX AT GIVEN POSITION.                            !@05C
057900     05  GCBOX           PIC XX   VALUE X'8000'.
058000     05  GRN-GCBOX       PIC X(6) VALUE 'GCBOX'.
058100*               BOX AT CURRENT POSITION.                          !@05C
058200     05  GCHST           PIC XX   VALUE X'C300'.
058300     05  GRN-GCHST       PIC X(6) VALUE 'GCHST '.
058400*               CHARACTER STRING.
058500     05  GCCHST          PIC XX   VALUE X'8300'.
058600     05  GRN-GCCHST      PIC X(6) VALUE 'GCCHST'.
058700*               CHARACTER STRING AT CURRENT POSITION.
058800     05  GCOMT           PIC XX   VALUE X'0100'.
058900     05  GRN-GCOMT       PIC X(6) VALUE 'GCOMT '.
059000*               COMMENT.
059100     05  GEAR            PIC XX   VALUE X'6000'.
059200     05  GRN-GEAR        PIC X(6) VALUE 'GEAR  '.
059300*               END AREA.
059400     05  GEIMG           PIC XX   VALUE X'9300'.
059500     05  GRN-GEIMG       PIC X(6) VALUE 'GEIMG '.
059600*               END IMAGE.
059700     05  GEPROL          PIC XX   VALUE X'3EFF'.
059800     05  GRN-GEPROL      PIC X(6) VALUE 'GEPROL'.
059900*               END PROLOG.
060000     05  GRESI           PIC XX   VALUE X'71FF'.
060100     05  GRN-GRESI       PIC X(6) VALUE 'GRESI '.
060200*               END SEGMENT.
060300     05  GFLT            PIC XX   VALUE X'C500'.
060400     05  GRN-GFLT        PIC X(6) VALUE 'GFLT  '.
060500*               FILLET.
060600     05  GCFLT           PIC XX   VALUE X'8500'.
060700     05  GRN-GCFLT       PIC X(6) VALUE 'GCFLT '.
060800*               FILLET AT CURRENT POSITION.
060900     05  GFARC           PIC XX   VALUE X'C706'.
061000     05  GRN-GFARC       PIC X(6) VALUE 'GFARC '.
061100*               FULL ARC.
061200     05  GCFLARC         PIC XX   VALUE X'8702'.
061300     05  GRN-GCFARC      PIC X(6) VALUE 'GCFARC'.
061400*               FILLET AT CURRENT POSITION.
061500     05  GIMD            PIC XX   VALUE X'9200'.
061600     05  GRN-GIMD        PIC X(6) VALUE 'GIMD  '.
061700*               IMAGE DATA.
061800     05  GLINE           PIC XX   VALUE X'C100'.
061900     05  GRN-GLINE       PIC X(6) VALUE 'GLINE '.
062000*               LINE.
062100     05  GCLINE          PIC XX   VALUE X'8100'.
062200     05  GRN-GCLINE      PIC X(6) VALUE 'GCLINE'.
062300*               LINE AT CURRENT POSITION.
062400     05  GMRK            PIC XX   VALUE X'C200'.
062500     05  GRN-GMRK        PIC X(6) VALUE 'GMRK  '.
062600*               MARKER.
062700     05  GCMRK           PIC XX   VALUE X'8200'.
062800     05  GRN-GCMRK       PIC X(6) VALUE 'GCMRK '.
062900*               MARKER AT CURRENT POSITION.
063000     05  GNOP1           PIC XX   VALUE X'00FF'.
063100     05  GRN-GNOP1       PIC X(6) VALUE 'GNOP1 '.
063200*               NO OPERATION.
063300     05  GPARC           PIC XX   VALUE X'E318'.
063400     05  GRN-GPARC       PIC X(6) VALUE 'GPARC '.
063500*               PARTIAL ARC.                                      !@05C
063600     05  GCPARC          PIC XX   VALUE X'A314'.
063700     05  GRN-GCPARC      PIC X(6) VALUE 'GCPARC'.
063800*               PARTIAL ARC AT CURRENT POSITION.                  !@05C
063900     05  GRLINE          PIC XX   VALUE X'E100'.
064000     05  GRN-GRLINE      PIC X(6) VALUE 'GRLINE'.
064100*               RELATIVE LINE.
064200     05  GCRLINE         PIC XX   VALUE X'A100'.
064300     05  GRN-GCRLINE     PIC X(6) VALUE 'GCRLIN'.
064400*               RELATIVE LINE AT CURRENT POSITION.
064500     05  GSGCH           PIC XX   VALUE X'0400'.
064600     05  GRN-GSGCH       PIC X(6) VALUE 'GSGCH '.
064700*               SEGMENT CHARACTERISTICS.
064800     05  GSAP            PIC XX   VALUE X'2208'.
064900     05  GRN-GSAP        PIC X(6) VALUE 'GSAP  '.
065000*               SET ARC PARAMETERS.
065100     05  GSBMX           PIC XX   VALUE X'0DFF'.
065200     05  GRN-GSBMX       PIC X(6) VALUE 'GSBMX '.
065300*               SET BACKGROUND MIX.
065400     05  GSCA            PIC XX   VALUE X'3404'.
065500     05  GRN-GSCA        PIC X(6) VALUE 'GSCA  '.
065600*               SET CHARACTER ANGLE.
065700     05  GSCC            PIC XX   VALUE X'3304'.
065800     05  GRN-GSCC        PIC X(6) VALUE 'GSCC  '.
065900*               SET CHARACTER CELL.
066000     05  GSCD            PIC XX   VALUE X'3AFF'.
066100     05  GRN-GSCD        PIC X(6) VALUE 'GSCD  '.
066200*               SET CHARACTER DIRECTION.
066300     05  GSCR            PIC XX   VALUE X'39FF'.
066400     05  GRN-GSCR        PIC X(6) VALUE 'GSCR  '.
066500*               SET CHARACTER PRECISION.
066600     05  GSCS            PIC XX   VALUE X'38FF'.
066700     05  GRN-GSCS        PIC X(6) VALUE 'GSCS  '.
066800*               SET CHARACTER SET.
066900     05  GSCH            PIC XX   VALUE X'3500'.
067000     05  GRN-GSCH        PIC X(6) VALUE 'GSCH  '.
067100*               SET CHARACTER SHEAR.
067200     05  GSCOL           PIC XX   VALUE X'A0FF'.
067300     05  GRN-GSCOL       PIC X(6) VALUE 'GSCOL '.
067400*               SET COLOR.
067500     05  GSCP            PIC XX   VALUE X'2104'.
067600     05  GRN-GSCP        PIC X(6) VALUE 'GSCP  '.
067700*               SET CURRENT POSITION.
067800     05  GSECOL          PIC XX   VALUE X'2602'.
067900     05  GRN-GSECOL      PIC X(6) VALUE 'GSECOL'.
068000*               SET EXTENDED COLOR.
068100     05  GSLT            PIC XX   VALUE X'18FF'.
068200     05  GRN-GSLT        PIC X(6) VALUE 'GSLT  '.
068300*               SET LINE TYPE.
068400     05  GSLW            PIC XX   VALUE X'19FF'.
068500     05  GRN-GSLW        PIC X(6) VALUE 'GSLW  '.
068600*               SET LINE WITDH.
068700     05  GSMC            PIC XX   VALUE X'37FF'.
068800     05  GRN-GSMC        PIC X(6) VALUE 'GSMC  '.
068900*               SET MARKER CELL.
069000     05  GSMP            PIC XX   VALUE X'3BFF'.
069100     05  GRN-GSMP        PIC X(6) VALUE 'GSMP  '.
069200*               SET MARKER PRECISION.
069300     05  GSMS            PIC XX   VALUE X'3CFF'.
069400     05  GRN-GSMS        PIC X(6) VALUE 'GSMS  '.
069500*               SET MARKER SET.
069600     05  GSMT            PIC XX   VALUE X'29FF'.
069700     05  GRN-GSMT        PIC X(6) VALUE 'GSMT  '.
069800*               SET MARKER SYMBOL.
069900     05  GSMX            PIC XX   VALUE X'0CFF'.
070000     05  GRN-GSMX        PIC X(6) VALUE 'GSMT  '.
070100*               SET MIX.
070200     05  GSPS            PIC XX   VALUE X'08FF'.
070300     05  GRN-GSPS        PIC X(6) VALUE 'GSPS  '.
070400*               SET PATTERN SET.
070500     05  GSPT            PIC XX   VALUE X'28FF'.
070600     05  GRN-GSPT        PIC X(6) VALUE 'GSPT  '.
070700*               SET PATTERN SYMBOL.
070800     05  GSPIK           PIC XX   VALUE X'4304'.
070900     05  GRN-GSPIK       PIC X(6) VALUE 'GSPIK '.
071000*               SET PICK IDENTIFIER.
071100   03  GR-TABLE          REDEFINES GR-NAMES
071200                         OCCURS 49,
071300                         ASCENDING KEY GR-ID,
071400                         INDEXED BY GR-ID-INDX.
071500     05  GR-VALUE        PIC X.
071600     05  GR-LENGTH       PIC X.
071700     05  GR-ID           PIC X(6).
071800*
071900*               GRAPHICS DRAWING CONSTANTS.
072000*--------------------------------------------------------------*
072100* GOCA GRAPHICS DRAWING CONSTANT VALUE.                        *
072200* USEFUL VALUES FOR DRAWING ORDER PARAMETERS.                  *
072300*--------------------------------------------------------------*
072400   03  GR-AREA-BOUNDARIES.
072500     05  GR-AREA-BOUNDARY    PIC X    VALUE X'C0'.
072600     05  GR-AREA-NOBOUNDARY  PIC X    VALUE X'80'.
072700   03  GR-CHAR-DIRECTION.
072800     05  GR-CDIR-DFLT        PIC X    VALUE X'00'.
072900     05  GR-CDIR-L2R         PIC X    VALUE X'01'.
073000     05  GR-CDIR-T2B         PIC X    VALUE X'02'.
073100     05  GR-CDIR-R2L         PIC X    VALUE X'03'.
073200     05  GR-CDIR-B2T         PIC X    VALUE X'04'.
073300   03  GR-COLOR.
073400     05  GR-COLOR-DFLT       PIC X    VALUE X'00'.
073500     05  GR-COLOR-BLUE       PIC X    VALUE X'01'.
073600     05  GR-COLOR-RED        PIC X    VALUE X'02'.
073700     05  GR-COLOR-MAGENTA    PIC X    VALUE X'03'.
073800     05  GR-COLOR-GREEN      PIC X    VALUE X'04'.
073900     05  GR-COLOR-CYAN       PIC X    VALUE X'05'.
074000     05  GR-COLOR-YELLOW     PIC X    VALUE X'06'.
074100     05  GR-COLOR-PDFLT      PIC X    VALUE X'07'.
074200     05  GR-COLOR-MEDIUM     PIC X    VALUE X'08'.
074300   03  GR-EXTENDED-COLOR.
074400     05  GR-ECOLOR-DFLT      PIC XX   VALUE X'0000'.
074500     05  GR-ECOLOR-BLUE      PIC XX   VALUE X'0001'.
074600     05  GR-ECOLOR-RED       PIC XX   VALUE X'0002'.
074700     05  GR-ECOLOR-MAGENTA   PIC XX   VALUE X'0003'.
074800     05  GR-ECOLOR-GREEN     PIC XX   VALUE X'0004'.
074900     05  GR-ECOLOR-CYAN      PIC XX   VALUE X'0005'.
075000     05  GR-ECOLOR-YELLOW    PIC XX   VALUE X'0006'.
075100     05  GR-ECOLOR-BLACK     PIC XX   VALUE X'0008'.
075200     05  GR-ECOLOR-BROWN     PIC XX   VALUE X'0010'.
075300     05  GR-ECOLOR-PDFLT     PIC XX   VALUE X'FF07'.
075400     05  GR-ECOLOR-MEDIUM    PIC XX   VALUE X'FF08'.
075500   03  GR-LINE-TYPE.
075600     05  GR-LINE-DFLT        PIC X    VALUE X'00'.
075700     05  GR-LINE-DOTTED      PIC X    VALUE X'01'.
075800     05  GR-LINE-SDASH       PIC X    VALUE X'02'.
075900     05  GR-LINE-DASHDOT     PIC X    VALUE X'03'.
076000     05  GR-LINE-DBLDOT      PIC X    VALUE X'04'.
076100     05  GR-LINE-LDASH       PIC X    VALUE X'05'.
076200     05  GR-LINE-DASHDDOT    PIC X    VALUE X'06'.
076300     05  GR-LINE-SOLID       PIC X    VALUE X'07'.
076400     05  GR-LINE-INVISIBLE   PIC X    VALUE X'08'.
076500   03  GR-LINE-THICKNESS.
076600     05  GR-THIK-DFLT        PIC X    VALUE X'00'.
076700     05  GR-THIK-NORMAL      PIC X    VALUE X'01'.
076800     05  GR-THIK-THICK       PIC X    VALUE X'02'.
076900   03  GR-MARKER-SYMBOL.
077000     05  GR-MARK-DFLT        PIC X    VALUE X'00'.
077100     05  GR-MARK-CROSS       PIC X    VALUE X'01'.
077200     05  GR-MARK-PLUS        PIC X    VALUE X'02'.
077300     05  GR-MARK-DIAMOND     PIC X    VALUE X'03'.
077400     05  GR-MARK-SQUARE      PIC X    VALUE X'04'.
077500     05  GR-MARK-6PT-STAR    PIC X    VALUE X'05'.
077600     05  GR-MARK-9PT-STAR    PIC X    VALUE X'06'.
077700     05  GR-MARK-FDIAMOND    PIC X    VALUE X'07'.
077800     05  GR-MARK-FSQUARE     PIC X    VALUE X'08'.
077900     05  GR-MARK-DOT         PIC X    VALUE X'09'.
078000     05  GR-MARK-SMCIRCLE    PIC X    VALUE X'0A'.
078100     05  GR-MARK-BLANK       PIC X    VALUE X'40'.
078200   03  GR-PATTERN-SYMBOL.
078300     05  GR-PATT-DFLT        PIC X    VALUE X'00'.
078400     05  GR-PATT-GREY-1      PIC X    VALUE X'01'.
078500     05  GR-PATT-GREY-2      PIC X    VALUE X'02'.
078600     05  GR-PATT-GREY-3      PIC X    VALUE X'03'.
078700     05  GR-PATT-GREY-4      PIC X    VALUE X'04'.
078800     05  GR-PATT-GREY-5      PIC X    VALUE X'05'.
078900     05  GR-PATT-GREY-6      PIC X    VALUE X'06'.
079000     05  GR-PATT-GREY-7      PIC X    VALUE X'07'.
079100     05  GR-PATT-GREY-8      PIC X    VALUE X'08'.
079200     05  GR-PATT-VLINES      PIC X    VALUE X'09'.
079300     05  GR-PATT-HLINES      PIC X    VALUE X'0A'.
079400     05  GR-PATT-L2R-DIAG1   PIC X    VALUE X'0B'.
079500     05  GR-PATT-L2R-DIAG2   PIC X    VALUE X'0C'.
079600     05  GR-PATT-T2B-DIAG1   PIC X    VALUE X'0D'.
079700     05  GR-PATT-T2B-DIAG2   PIC X    VALUE X'0E'.
079800     05  GR-PATT-NONE        PIC X    VALUE X'0F'.
079900     05  GR-PATT-SOLID       PIC X    VALUE X'10'.
080000     05  GR-PATT-BLANK       PIC X    VALUE X'40'.
080100   03  GR-IMAGE-MAPPING.
080200     05  GR-MAP-TRIM         PIC X    VALUE X'10'.
080300     05  GR-MAP-SCALE        PIC X    VALUE X'20'.
080400     05  GR-MAP-CENTER       PIC X    VALUE X'30'.
080500     05  GR-MAP-PEL          PIC X    VALUE X'41'.
080600     05  GR-MAP-DOUBLE-DOT   PIC X    VALUE X'42'.
080700   03  GR-IMAGE-ROTATION.
080800     05  GR-ROT-00           PIC X(4) VALUE X'00002D00'.
080900     05  GR-ROT-90           PIC X(4) VALUE X'2D005A00'.
081000     05  GR-ROT-180          PIC X(4) VALUE X'5A008700'.
081100     05  GR-ROT-270          PIC X(4) VALUE X'87000000'.
081200*
081300*               TRIPLET IDENTIFIERS.   .
081400*--------------------------------------------------------------*
081500* COMMON TRIPLET IDENTIFIERS.                                  *
081600* BYTE 1: LENGTH. ZERO REPRESENTS A VARIABLE LENGTH TRIPLET.   *
081700* BYTE 2: TRIPLET IDENTIFIER.                                  *  !@06A
081800*--------------------------------------------------------------*
081900   03  TR-NAMES.
082000     05  TR-GCSGID       PIC XX   VALUE X'0601'.
082100     05  TRN-GCSGID      PIC X(6) VALUE 'GCSGID'.
082200*               GCSGID/CPGID CODE PAGE/CHAR SET ID.
082300     05  TR-FQN          PIC XX   VALUE X'0002'.
082400     05  TRN-FQN         PIC X(6) VALUE 'FQN   '.
082500*               FULLY QUALIFIED NAME (SEE FQN IDS, BELOW).
082600     05  TR-MPO          PIC XX   VALUE X'0304'.
082700     05  TRN-MPO         PIC X(6) VALUE 'MAPOPT'.
082800*               MAPPING OPTION.
082900     05  TR-OCT          PIC XX   VALUE X'0010'.
083000     05  TRN-OCT         PIC X(6) VALUE 'OBJCLS'.
083100*               OBJECT CLASSIFICATION.
083200     05  TR-INTCHG       PIC XX   VALUE X'0518'.
083300     05  TRN-INTCHG      PIC X(6) VALUE 'INTCHG'.
083400*               MO:DCA INTERCHANGE SET.
083500     05  TR-FNTDSC       PIC XX   VALUE X'001F'.
083600     05  TRN-FNTDSC      PIC X(6) VALUE 'FNTDSC'.
083700*               MO:DCA INTERCHANGE SET.
083800     05  TR-OFS          PIC XX   VALUE X'0821'.
083900     05  TRN-OFS         PIC X(6) VALUE 'OFS   '.
084000*               OBJECT FUNCTION SET SPECIFICATION.
084100     05  TR-FCGCSID      PIC XX   VALUE X'0620'.
084200     05  TRN-FCGCSID     PIC X(6) VALUE 'FNTCHR'.
084300*               RESOURCE OBJECT TYPE
084400     05  TR-OBJTYPE      PIC XX   VALUE X'1021'.
084500     05  TRN-OBJTYPE     PIC X(6) VALUE 'OBJTYP'.
084600*               RESOURCE OBJECT TYPE
084700     05  TR-ERLID        PIC XX   VALUE X'0722'.
084800     05  TRN-ERLIB       PIC X(6) VALUE 'ERLID '.
084900*               EXTENDED RESOURCE LOCAL ID.
085000     05  TR-RLID         PIC XX   VALUE X'0424'.
085100     05  TRN-RLID        PIC X(6) VALUE 'RLID  '.
085200*               RESOURCE LOCAL ID.
085300     05  TR-SECNUM       PIC XX   VALUE X'0325'.
085400     05  TRN-SECNUM      PIC X(6) VALUE 'SECNUM'.
085500*               SECTION NUMBER.
085600     05  TR-CHAROT       PIC XX   VALUE X'0426'.
085700     05  TRN-CHAROT      PIC X(6) VALUE 'CHAROT'.
085800*               CHARACTER ROTATION.
085900     05  TR-BYTEOF       PIC XX   VALUE X'062D'.
086000     05  TRN-BYTEX       PIC X(6) VALUE 'BYTEOF'.
086100*               BYTE OFFSET.          .
086200     05  TR-ATVAL        PIC XX   VALUE X'0036'.
086300     05  TRN-ATVAL       PIC X(6) VALUE 'ATTVAL'.
086400*               ATTRIBUTE VALUE.
086500     05  TR-DESPOS       PIC XX   VALUE X'0343'.
086600     05  TRN-DESPOS      PIC X(6) VALUE 'DESPOS'.
086700*               DESCRIPTOR POSITION.
086800     05  TR-MEDEJ        PIC XX   VALUE X'0445'.
086900     05  TRN-MEDEJ       PIC X(6) VALUE 'MEDEJ '.
087000*               MEDIA EJECT CONTROL.
087100     05  TR-POCP         PIC XX   VALUE X'0046'.
087200     05  TRN-POCP        PIC X(6) VALUE 'POCP  '.
087300*               PAGE OVERLAY CONDITIONAL PROCESSING.
087400     05  TR-RESUAT       PIC XX   VALUE X'0347'.
087500     05  TRN-RESUAT      PIC X(6) VALUE 'RESUAT'.
087600*               RESOURCE USAGE ATTRIBUTE.
087700     05  TR-UOM          PIC XX   VALUE X'084B'.
087800     05  TRN-UOM         PIC X(6) VALUE 'UOM   '.
087900*               MEASUREMENT UNTIS.
088000     05  TR-OBJASZ       PIC XX   VALUE X'074C'.
088100     05  TRN-OBJASZ      PIC X(6) VALUE 'OBJASZ'.
088200*               OBJECT AREA SIZE.
088300     05  TR-AREADF       PIC XX   VALUE X'0F4D'.
088400     05  TRN-AREADF      PIC X(6) VALUE 'AREADF'.
088500*               AREA DEFINITION.
088600     05  TR-COLSPF       PIC XX   VALUE X'004E'.
088700     05  TRN-COLSPF      PIC X(6) VALUE 'COLSPF'.
088800*               COLOR SPECIFICATION.
088900     05  TR-ENCOD        PIC XX   VALUE X'0050'.
089000     05  TRN-ENCOD       PIC X(6) VALUE 'ENCOD '.
089100*               ENCODING SCHEME.
089200     05  TR-PGMAP        PIC XX   VALUE X'0656'.
089300     05  TRN-PGMAP       PIC X(6) VALUE 'PGMAP '.
089400*               MEDIUM MAP PAGE NUMBER.
089500     05  TR-BYTEX        PIC XX   VALUE X'0657'.
089600     05  TRN-BYTEX       PIC X(6) VALUE 'BYTEX '.
089700*               BYTE EXTENT.          .
089800     05  TR-SFOF         PIC XX   VALUE X'0658'.
089900     05  TRN-SFOF        PIC X(6) VALUE 'SFOF  '.
090000*               STRUCTURED FIELD OFFSET.
090100     05  TR-SFEX         PIC XX   VALUE X'0659'.
090200     05  TRN-SFEX        PIC X(6) VALUE 'SFEX  '.
090300*               STRUCTURED FIELD EXTENT.
090400     05  TR-OBJOFF       PIC XX   VALUE X'085A'.
090500     05  TRN-OBJOFF      PIC X(6) VALUE 'OBJOFF'.
090600*               OBJECT OFFSET.
090700     05  TR-HSCALE       PIC XX   VALUE X'045D'.
090800     05  TRN-HSCALE      PIC X(6) VALUE 'HSCALE'.
090900*               FONT HORIZONTAL SCALE FACTOR.
091000     05  TR-OBJCNT       PIC XX   VALUE X'085E'.
091100     05  TRN-OBJCNT      PIC X(6) VALUE 'OBJCNT'.
091200*               OBJECT COUNT.
091300     05  TR-DATETIME     PIC XX   VALUE X'1162'.
091400     05  TRN-DATETIME    PIC X(6) VALUE 'TMDT '.
091500*               OBJECT DATE AND TIMESTAMP.
091600     05  TR-CRC          PIC XX   VALUE X'0663'.
091700     05  TRN-CRC         PIC X(6) VALUE 'CRC  '.
091800*               CRC RESOURCE MANAGEMENT.
091900     05  TR-OBJORIG      PIC XX   VALUE X'3D64'.
092000     05  TRN-OBJORIG     PIC X(6) VALUE 'OORIG'.
092100*               OBJECT ORIGIN IDENTIFIER
092200     05  TR-UCOMMENT     PIC XX   VALUE X'0065'.
092300     05  TRN-UCOMMENT    PIC X(6) VALUE 'UCOMM'.
092400*               USER COMMENT.
092500     05  TR-MEDORI       PIC XX   VALUE X'0368'.
092600     05  TRN-MEDORI      PIC X(6) VALUE 'MEDORI'.
092700*               MEDIUM ORIENTATION.
092800     05  TR-RESINC       PIC XX   VALUE X'006C'.
092900     05  TRN-RESINC      PIC X(6) VALUE 'RESINC'.
093000*               RESOURCE OBJECT INCLUDE.
093100     05  TR-RESMIX       PIC XX   VALUE X'0370'.
093200     05  TRN-RESMIX      PIC X(6) VALUE 'RESMIX'.
093300*               PRESENTATION SPACE RESET MIXING.
093400     05  TR-MIXRUL       PIC XX   VALUE X'0071'.
093500     05  TRN-MIXRUL      PIC X(6) VALUE 'MIXRUL'.
093600*               PRESENTATION SPACE MIXING RULES.
093700     05  TR-DATIM        PIC XX   VALUE X'0D72'.
093800     05  TRN-DATIM       PIC X(6) VALUE 'DATIM '.
093900*               UNIVERSAL DATA AND TIME STAMP.
094000     05  TR-TONSAV       PIC XX   VALUE X'0674'.
094100     05  TRN-TONSAV      PIC X(6) VALUE 'TONSAV'.
094200*               TONER SAVER.
094300     05  TR-COLFID       PIC XX   VALUE X'0875'.
094400     05  TRN-COLFID      PIC X(6) VALUE 'COLFID'.
094500*               COLOR FIDELITY.
094600     05  TR-FNTFID       PIC XX   VALUE X'0778'.
094700     05  TRN-FNTFID      PIC X(6) VALUE 'FNTFID'.
094800*               COLOR FIDELITY.
094900     05  TR-ATTQUAL      PIC XX   VALUE X'1080'.
095000     05  TRN-ATTQUAL     PIC X(6) VALUE 'AQUAL'.
095100*               ATTIBUTE QUALIFIER.
095200     05  TR-PGPOS        PIC XX   VALUE X'0381'.
095300     05  TRN-PGPOS       PIC X(6) VALUE 'PGPOS'.
095400*               PAGE POSITION INFORMATION.
095500     05  TR-PRMVAL       PIC XX   VALUE X'0082'.
095600     05  TRN-PRMVAL      PIC X(6) VALUE 'PRMVAL'.
095700*               PAGE POSITION INFORMATION.
095800     05  TR-PRSCTL       PIC XX   VALUE X'0383'.
095900     05  TRN-PRSCTL      PIC X(6) VALUE 'PRSCTL'.
096000*               PRESENTATION CONTROL.
096100     05  TR-FNTRES       PIC XX   VALUE X'0684'.
096200     05  TRN-FNTRES      PIC X(6) VALUE 'FNTRES'.
096300*               FONT RESOLUTION AND METRIC TECHNOLOGY.
096400     05  TR-FINOP        PIC XX   VALUE X'0085'.
096500     05  TRN-FINOP       PIC X(6) VALUE 'FINOP '.
096600*               FINISHING OPERATION.
096700     05  TR-TXDFID       PIC XX   VALUE X'0786'.
096800     05  TRN-TXTFID      PIC X(6) VALUE 'TXTFID'.
096900*               TEXT FIDELITY.
097000     05  TR-MEDFID       PIC XX   VALUE X'0787'.
097100     05  TRN-MEDFID      PIC X(6) VALUE 'MEDFID'.
097200*               MEDIA FIDELITY.
097300     05  TR-FINFID       PIC XX   VALUE X'0788'.
097400     05  TRN-FINFID      PIC X(6) VALUE 'FINFID'.
097500*               FINISHING FIDELITY.
097600     05  TR-DOFDSC       PIC XX   VALUE X'108B'.
097700     05  TRN-DOFDSC      PIC X(6) VALUE 'DOFDSC'.
097800*               DATA OBJECT FONT DESCRIPTOR.
097900     05  TR-UP3IOP       PIC XX   VALUE X'008E'.
098000     05  TRN-UP3IOP      PIC X(6) VALUE 'UP3IOP'.
098100*               UP3I FINISHING OPERATION.
098200   03  TR-TABLE          REDEFINES TR-NAMES
098300                         OCCURS 54,
098400                         ASCENDING KEY TR-VALUE
098500                         INDEXED BY TR-VALUE-INDX.
098600     05  TR-LENGTH       PIC X.
098700     05  TR-VALUE        PIC X.
098800     05  TR-ID           PIC X(6).
098900*
099000*               FULLY QUALIFIED NAME IDENTIFIERS.
099100*--------------------------------------------------------------*
099200* FQN IDENTIFIERS                                              *
099300* BYTE 1: ID TYPE, 3RD BYTE OF FQN TRIPLET.                    *
099400*--------------------------------------------------------------*
099500   03  FQN-PREFIX        PIC 9(4) BINARY VALUE 4.
099600*               OFFSET TO NAME FIELD OF FQN.
099700   03  FQN-NAMES.
099800     05  FQN-GID         PIC X   VALUE X'01'.
099900*               REPLACE FIRST GID NAME.
100000     05  FQN-FFN         PIC X   VALUE X'07'.                     !@06A
100100*               FONT FAMILY NAME.                                 !@06A
100200     05  FQN-FTN         PIC X   VALUE X'08'.                     !@06A
100300*               FONT TYPEFACE NAME.                               !@06A
100400     05  FQN-RHR         PIC X   VALUE X'09'.                     !@06A
100500*               RESOURCE HEIRARCHY REFERENCE.                     !@06A
100600     05  FQN-BRG         PIC X   VALUE X'0A'.
100700*               BEGIN RESOURCE GROUP.
100800     05  FQN-ATTR        PIC X   VALUE X'0B'.
100900*               DOCUMENT ATTRIBUTE.
101000     05  FQN-PREL        PIC X   VALUE X'0C'.
101100*               PROCESS ELEMENT.
101200     05  FQN-PGRP        PIC X   VALUE X'0D'.
101300*               BEGIN PAGE GROUP.
101400     05  FQN-MTM         PIC X   VALUE X'11'.                     !@06A
101500*               MEDIA TYPE REFERENCE.                             !@06A
101600     05  FQN-DOFB        PIC X   VALUE X'6E'.                     !@06A
101700*               DOF FONT BASE FONT ID.                            !@06A
101800     05  FQN-DOFL        PIC X   VALUE X'7E'.                     !@06A
101900*               DOF LINKED FONT ID.                               !@06A
102000     05  FQN-BDT         PIC X   VALUE X'83'.
102100*               BEGIN DOCUMENT REFERENCE.
102200     05  FQN-ROR         PIC X   VALUE X'84'.                     !@06A
102300*               RESOURCE OBJECT REFERENCE.                        !@06A
102400     05  FQN-CPG         PIC X   VALUE X'85'.                     !@06A
102500*               CODE PAGE NAME REFERENCE.                         !@06A
102600     05  FQN-FCS         PIC X   VALUE X'86'.                     !@06A
102700*               FONT CHARACTER SET NAME REFERENCE.                !@06A
102800     05  FQN-BPG         PIC X   VALUE X'87'.
102900*               BEGIN PAGE REFERENCE.
103000     05  FQN-BMM         PIC X   VALUE X'8D'.
103100*               BEGIN MEDIUM MAP.
103200     05  FQN-CFN         PIC X   VALUE X'8E'.                     !@06A
103300*               CODED FONT NAME REFERENCE.                        !@06A
103400     05  FQN-BDI         PIC X   VALUE X'98'.
103500*               BEGIN DOCUMENT INDEX.
103600     05  FQN-BOR         PIC X   VALUE X'B0'.                     !@06A
103700*               BEGIN OVERLAY REFERENCE.                          !@06A
103800     05  FQN-DOIR        PIC X   VALUE X'BE'.                     !@06A
103900*               DATA OBJECT INTERNAL RESOURCE REFERENCE.          !@06A
104000     05  FQN-IGID        PIC X   VALUE X'CA'.                     !@06A
104100*               INDEX ELEMENT GID.                                !@06A
104200     05  FQN-OOID        PIC X   VALUE X'CE'.                     !@06A
104300*               OTHER OBJECT DATA REFERENCE.                      !@06A
104400     05  FQN-DOER        PIC X   VALUE X'DE'.                     !@06A
104500*               DATA OBJECT EXTERNAL RESOURCE REFERENCE.          !@06A
104600   03  FQN-TABLE         REDEFINES FQN-NAMES
104700                         OCCURS 24,
104800                         ASCENDING KEY FQN-ID
104900                         INDEXED BY FQN-INDX.
105000     05  FQN-ID          PIC X.
105100*--------------------------------------------------------------*
105200*      OBJECT CATEGORY IDENTIFIERS.
105300*--------------------------------------------------------------*
105400   03  CAT-NAMES.
105500     05  CAT-PSEG        PIC X   VALUE X'5F'.
105600*               PAGE     SEGMENT
105700     05  CAT-AREA        PIC X   VALUE X'6B'.
105800*               OBJECT     AREA
105900     05  CAT-COLATT      PIC X   VALUE X'77'.
106000*               COLOR ATTRIBUTE TABLE
106100     05  CAT-IMIMAGE     PIC X   VALUE X'7B'.
106200*               IM   IMAGE
106300     05  CAT-MEDIUM      PIC X   VALUE X'88'.
106400*               MEDIUM
106500     05  CAT-CFONT       PIC X   VALUE X'8A'.
106600*               CODED      FONT
106700     05  CAT-PELEM       PIC X   VALUE X'90'.
106800*               PROCESS       ELEMENT
106900     05  CAT-CONTAIN     PIC X   VALUE X'92'.
107000*               OBJECT     CONTAINER
107100     05  CAT-PRESENT     PIC X   VALUE X'9B'.
107200*               PRESENTATION        TEXT
107300     05  CAT-INDEX       PIC X   VALUE X'A7'.
107400*               INDEX
107500     05  CAT-DOCUMENT PIC X      VALUE X'A8'.
107600*               DOCUMENT
107700     05  CAT-PAGEGRP     PIC X   VALUE X'AD'.
107800*               PAGE     GROUP
107900     05  CAT-PAGE        PIC X   VALUE X'AF'.
108000*               PAGE
108100     05  CAT-GRAPHIC     PIC X   VALUE X'BB'.
108200*               GRAPHICS
108300     05  CAT-DATARSRC PIC X      VALUE X'C3'.
108400*               DATA    RESOURCE
108500     05  CAT-DOCENV      PIC X   VALUE X'C4'.
108600*               DOCUMENT ENVIRONMENT GROUP
108700     05  CAT-RESGRP      PIC X   VALUE X'C6'.
108800*               RESOURCE        GROUP
108900     05  CAT-OEG         PIC X   VALUE X'C7'.
109000*               OBJECT ENVIRONMENT GROUP
109100     05  CAT-AEG         PIC X   VALUE X'C9'.
109200*               ACTIVE ENVIRONMENT GROUP
109300     05  CAT-MEDMAP      PIC X   VALUE X'CC'.
109400*               MEDIUM       MAP
109500     05  CAT-FORMAP      PIC X   VALUE X'CD'.
109600*               FORM     MAP
109700     05  CAT-POVLY       PIC X   VALUE X'D8'.
109800*               PAGE     OVERLAY
109900     05  CAT-OVERLAY     PIC X   VALUE X'DF'.
110000*               OVERLAY
110100   03  CAT-TABLE         REDEFINES CAT-NAMES
110200                         OCCURS 23,
110300                         ASCENDING KEY CAT-ID
110400                         INDEXED BY CAT-INDX.
110500     05  CAT-ID          PIC X.
110600*--------------------------------------------------------------*
110700*      OBJECT CATEGORY IDENTIFIERS.
110800*--------------------------------------------------------------*
110900   03  OBJTYP-NAMES.
111000     05  OBJTYP-ATTRIB   PIC X   VALUE X'A0'.
111100*               ATTRIBUTE
111200     05  OBJTYP-COPYCNT  PIC X   VALUE X'A2'.
111300*               COPY COUNT
111400     05  OBJTYP-DESCR    PIC X   VALUE X'A6'.
111500*               DESCRIPTOR
111600     05  OBJTYP-CONTROL  PIC X   VALUE X'A7'.
111700*               CONTROL
111800     05  OBJTYP-BEGIN    PIC X   VALUE X'A8'.
111900*               BEGIN
112000     05  OBJTYP-END      PIC X   VALUE X'A9'.
112100*               END
112200     05  OBJTYP-MAP      PIC X   VALUE X'AB'.
112300*               MAP
112400     05  OBJTYP-POSN     PIC X   VALUE X'AC'.
112500*               POSITION
112600     05  OBJTYP-INCLUDE  PIC X   VALUE X'AF'.
112700*               INCLUDE
112800     05  OBJTYP-TABLE    PIC X   VALUE X'B0'.
112900*               TABLE
113000     05  OBJTYP-MIGR     PIC X   VALUE X'B1'.
113100*               MIGRATION
113200     05  OBJTYP-VARIABLE PIC X   VALUE X'B2'.
113300*               VARIABLE
113400     05  OBJTYP-LINK     PIC X   VALUE X'B4'.
113500*               LINK
113600     05  OBJTYP-DATA     PIC X   VALUE X'EE'.
113700*               DATA
113800   03  OBJTYP-TABLE      REDEFINES OBJTYP-NAMES
113900                         OCCURS 14,
114000                         ASCENDING KEY OBJTYP-ID
114100                         INDEXED BY OBJTYP-INDX.
114200     05  OBJTYP-ID       PIC X.
114300*--------------------------------------------------------------*
114400*      USEFUL CONSTANTS.                                          !@06A
114500*--------------------------------------------------------------*
114600   03  MCF2-RG-LEN-LEN   PIC 9(4) BINARY VALUE 2.
114700* LENGTH OF MCF2 REPEATING GROUP LENGTH